{
  "chapter": "ch05",
  "chapter_title": "ClaimCenter Introduction",
  "domain": "claims management",
  "video_count": 46,
  "total_duration_seconds": 13344.45,
  "total_duration_formatted": "03:42:24.450",
  "total_words": 33938,
  "avg_confidence": 0.9517,
  "videos": [
    {
      "filename": "IS_Claim_01_01.mp4",
      "stem": "IS_Claim_01_01",
      "duration": "00:03:16.840",
      "words": 522,
      "confidence": 0.9295
    },
    {
      "filename": "IS_Claim_01_02.mp4",
      "stem": "IS_Claim_01_02",
      "duration": "00:05:31.380",
      "words": 938,
      "confidence": 0.952
    },
    {
      "filename": "IS_Claim_01_03.mp4",
      "stem": "IS_Claim_01_03",
      "duration": "00:05:12.960",
      "words": 1007,
      "confidence": 0.9554
    },
    {
      "filename": "IS_Claim_01_04.mp4",
      "stem": "IS_Claim_01_04",
      "duration": "00:02:07.400",
      "words": 582,
      "confidence": 0.9354
    },
    {
      "filename": "IS_Claim_01_05.mp4",
      "stem": "IS_Claim_01_05",
      "duration": "00:04:13.420",
      "words": 802,
      "confidence": 0.974
    },
    {
      "filename": "IS_Claim_01_06.mp4",
      "stem": "IS_Claim_01_06",
      "duration": "00:01:16.080",
      "words": 355,
      "confidence": 0.9591
    },
    {
      "filename": "IS_Claim_01_07.mp4",
      "stem": "IS_Claim_01_07",
      "duration": "00:01:35.860",
      "words": 472,
      "confidence": 0.9681
    },
    {
      "filename": "IS_Claim_01_08.mp4",
      "stem": "IS_Claim_01_08",
      "duration": "00:02:26.000",
      "words": 400,
      "confidence": 0.9572
    },
    {
      "filename": "IS_Claim_02_01.mp4",
      "stem": "IS_Claim_02_01",
      "duration": "00:03:27.100",
      "words": 499,
      "confidence": 0.9574
    },
    {
      "filename": "IS_Claim_02_02.mp4",
      "stem": "IS_Claim_02_02",
      "duration": "00:04:29.860",
      "words": 728,
      "confidence": 0.9482
    },
    {
      "filename": "IS_Claim_02_03.mp4",
      "stem": "IS_Claim_02_03",
      "duration": "00:03:48.440",
      "words": 598,
      "confidence": 0.9838
    },
    {
      "filename": "IS_Claim_03.mp4",
      "stem": "IS_Claim_03",
      "duration": "00:09:04.360",
      "words": 1303,
      "confidence": 0.9544
    },
    {
      "filename": "IS_Claim_04.mp4",
      "stem": "IS_Claim_04",
      "duration": "00:06:20.400",
      "words": 535,
      "confidence": 0.9288
    },
    {
      "filename": "IS_Claim_05_01.mp4",
      "stem": "IS_Claim_05_01",
      "duration": "00:01:45.320",
      "words": 408,
      "confidence": 0.8089
    },
    {
      "filename": "IS_Claim_05_02.mp4",
      "stem": "IS_Claim_05_02",
      "duration": "00:10:25.340",
      "words": 1054,
      "confidence": 0.9437
    },
    {
      "filename": "IS_Claim_05_03.mp4",
      "stem": "IS_Claim_05_03",
      "duration": "00:07:01.340",
      "words": 784,
      "confidence": 0.9458
    },
    {
      "filename": "IS_Claim_05_04.mp4",
      "stem": "IS_Claim_05_04",
      "duration": "00:02:34.600",
      "words": 295,
      "confidence": 0.9659
    },
    {
      "filename": "IS_Claim_06_01.mp4",
      "stem": "IS_Claim_06_01",
      "duration": "00:08:27.620",
      "words": 1263,
      "confidence": 0.9697
    },
    {
      "filename": "IS_Claim_06_02.mp4",
      "stem": "IS_Claim_06_02",
      "duration": "00:03:55.720",
      "words": 719,
      "confidence": 0.964
    },
    {
      "filename": "IS_Claim_07_01.mp4",
      "stem": "IS_Claim_07_01",
      "duration": "00:01:55.140",
      "words": 200,
      "confidence": 0.814
    },
    {
      "filename": "IS_Claim_07_02.mp4",
      "stem": "IS_Claim_07_02",
      "duration": "00:01:59.880",
      "words": 376,
      "confidence": 0.9662
    },
    {
      "filename": "IS_Claim_07_03.mp4",
      "stem": "IS_Claim_07_03",
      "duration": "00:03:34.780",
      "words": 486,
      "confidence": 0.9484
    },
    {
      "filename": "IS_Claim_07_04.mp4",
      "stem": "IS_Claim_07_04",
      "duration": "00:04:28.000",
      "words": 512,
      "confidence": 0.9592
    },
    {
      "filename": "IS_Claim_08_01.mp4",
      "stem": "IS_Claim_08_01",
      "duration": "00:05:19.180",
      "words": 511,
      "confidence": 0.957
    },
    {
      "filename": "IS_Claim_08_02.mp4",
      "stem": "IS_Claim_08_02",
      "duration": "00:02:21.180",
      "words": 319,
      "confidence": 0.9681
    },
    {
      "filename": "IS_Claim_08_03.mp4",
      "stem": "IS_Claim_08_03",
      "duration": "00:03:17.120",
      "words": 587,
      "confidence": 0.9712
    },
    {
      "filename": "IS_Claim_08_04.mp4",
      "stem": "IS_Claim_08_04",
      "duration": "00:02:11.440",
      "words": 344,
      "confidence": 0.9337
    },
    {
      "filename": "IS_Claim_09_01.mp4",
      "stem": "IS_Claim_09_01",
      "duration": "00:06:38.610",
      "words": 1243,
      "confidence": 0.9261
    },
    {
      "filename": "IS_Claim_10_01.mp4",
      "stem": "IS_Claim_10_01",
      "duration": "00:07:47.440",
      "words": 1057,
      "confidence": 0.9519
    },
    {
      "filename": "IS_Claim_10_02.mp4",
      "stem": "IS_Claim_10_02",
      "duration": "00:04:33.240",
      "words": 715,
      "confidence": 0.9661
    },
    {
      "filename": "IS_Claim_11_01.mp4",
      "stem": "IS_Claim_11_01",
      "duration": "00:07:49.040",
      "words": 1091,
      "confidence": 0.9681
    },
    {
      "filename": "IS_Claim_11_02.mp4",
      "stem": "IS_Claim_11_02",
      "duration": "00:03:41.600",
      "words": 515,
      "confidence": 0.9495
    },
    {
      "filename": "IS_Claim_12_01.mp4",
      "stem": "IS_Claim_12_01",
      "duration": "00:08:41.420",
      "words": 1441,
      "confidence": 0.9544
    },
    {
      "filename": "IS_Claim_13_01.mp4",
      "stem": "IS_Claim_13_01",
      "duration": "00:06:16.220",
      "words": 1075,
      "confidence": 0.898
    },
    {
      "filename": "IS_Claim_14_01.mp4",
      "stem": "IS_Claim_14_01",
      "duration": "00:06:39.940",
      "words": 971,
      "confidence": 0.9482
    },
    {
      "filename": "IS_Claim_14_02.mp4",
      "stem": "IS_Claim_14_02",
      "duration": "00:06:32.980",
      "words": 1043,
      "confidence": 0.9548
    },
    {
      "filename": "IS_Claim_15_01.mp4",
      "stem": "IS_Claim_15_01",
      "duration": "00:05:59.000",
      "words": 937,
      "confidence": 0.9287
    },
    {
      "filename": "IS_Claim_15_02.mp4",
      "stem": "IS_Claim_15_02",
      "duration": "00:05:07.480",
      "words": 705,
      "confidence": 0.9693
    },
    {
      "filename": "IS_Claim_16_01.mp4",
      "stem": "IS_Claim_16_01",
      "duration": "00:05:06.500",
      "words": 811,
      "confidence": 0.963
    },
    {
      "filename": "IS_Claim_16_02.mp4",
      "stem": "IS_Claim_16_02",
      "duration": "00:05:41.860",
      "words": 786,
      "confidence": 0.9788
    },
    {
      "filename": "IS_Claim_17_01.mp4",
      "stem": "IS_Claim_17_01",
      "duration": "00:07:42.080",
      "words": 1108,
      "confidence": 0.9805
    },
    {
      "filename": "IS_Claim_17_02.mp4",
      "stem": "IS_Claim_17_02",
      "duration": "00:03:51.080",
      "words": 561,
      "confidence": 0.9483
    },
    {
      "filename": "IS_Claim_18_01.mp4",
      "stem": "IS_Claim_18_01",
      "duration": "00:04:35.420",
      "words": 985,
      "confidence": 0.9534
    },
    {
      "filename": "IS_Claim_18_02.mp4",
      "stem": "IS_Claim_18_02",
      "duration": "00:03:04.360",
      "words": 636,
      "confidence": 0.9422
    },
    {
      "filename": "IS_Claim_19_01.mp4",
      "stem": "IS_Claim_19_01",
      "duration": "00:03:53.060",
      "words": 593,
      "confidence": 0.9745
    },
    {
      "filename": "IS_Claim_19_02.mp4",
      "stem": "IS_Claim_19_02",
      "duration": "00:06:36.360",
      "words": 1066,
      "confidence": 0.9676
    }
  ],
  "full_text": "--- IS_Claim_01_01 ---\nIDA Belt is a customer service representative for Succeed Insurance. This demonstration reviews the basic functionality available to her in ClaimCenter. The first thing IDA does every day is log in to ClaimCenter. IDA is taken to the Claim Search screen when she logs in. As a CSR, she can see three tabs on the opening page, Claim, Search, and Address Book. In this scenario, IDA has never navigated to a claim. IDA is taken to the simple search screen for claims. When she clicks the Claim tab, the system takes her directly to a No Claim screen. From here, she can either create a new claim, or navigate to the Claim Search. If IDA had navigated to a claim previously, this screen would show her the last claim she was working on. IDA is where IDA can go to search for claims. When she clicks the Search tab, she is taken to the Simple Search screen for claims. When she clicks the Search drop-down, she sees that there are several options from which to choose. She can search for claims, activities, checks, recoveries, or bulk invoices. IDA decides to perform a simple claim search. She can use this page to search using a claim number, a policy number, or names of anyone listed on a claim. IDA needs to search for any claims that involve Ray Newton. Since she wants to see all claims where Ray Newton has any involvement, she selects any party involved. Then she enters Newt as the last name. And clicks Search. The results show all the claims where Ray Newton is involved. Ray is involved in two claims, one where he is the sole claimant, and one where he is one of several claimants. Another search option is called Search by Contact. This search uses a free text search engine which allows for searches on partial names, phonetic names, or sounds like names. She is unsure how Ray Newton spells his name, so she enters Newt on. And clicks Search. Although she misspelled Newton, the search returns results with any claim with the name Newton. The name field searches for the contents in the first name or last name. She is now looking for claims with the name Frank. She isn't sure of the spelling, and enters F-R-A-I-N-K as the name. She clicks Search. Again, even though the spelling doesn't match, the results show all claims which include any party with the name Frank. The advanced search page includes more search criteria. Such as assigned group, assigned user, jurisdiction, claim status, and more. Claim Center also allows users to search for vendors which are maintained in the address book, or contact manager. Aida needs to find information about a specific vendor. She knows the name starts with A-B but isn't sure of the rest. She enters A-B as the name, last name. And clicks Search. The result of the search shows A-B construction, which is a vendor maintained in the address book. This is the end of the Customer Service Representative Basics demonstration.             DEMONSTRATION                  DEMONSTRATION of the guilt of guilt. of the guilt of guilt. you\n\n--- IS_Claim_01_02 ---\nIDA is already logged into ClaimCenter. She gets a call from Mr. Henderson who wants to report an auto accident he had today. IDA will use the new claim wizard to create an auto claim. She uses the claim tab. To navigate to the new claim screen where she can create a claim. IDA enters part of Mr. Henderson's name as the search criteria. She searches for Mr. Henderson's policy. If multiple policies had matched the claim, criteria that IDA entered, she would see a list of policies in the middle of the screen. Since only one policy matched, she sees details of the policy, including claim history. Since there is only one policy for Mr. Henderson, it is automatically selected for this claim. Mr. Henderson told IDA that the accident happened today, so she uses the calendar icon to select the date. She clicks today to select today's date. IDA verifies the date. IDA verifies the date. She says that Mr. Henderson's address is still 85 Circle Road in West Lake Village. Now that she is sure she has the correct policy and person, she is ready to gather information for the claim. She proceeds to the next step of the new claim wizard. Since she is talking to Mark, she uses the drop-down to select Mark Henderson as the reporter. The relation to insured field automatically updates to self, since he is the insured. On the right, she sees that two cars are listed on this policy. The claim center shows both cars on the policy as possible involved vehicles. Mr. Henderson tells IDA that the vehicle involved is the 1991 Ford wagon. When she selects a vehicle, the page shows the coverage information for that vehicle. By selecting the 1991 Ford wagon, she identifies it as an incident on this claim, which is an item that was potentially damaged. Next, IDA gathers more details about what happened. Mark tells her that he was hit by another car in the intersection. She enters that information into the what happened field. Because there is another car involved, IDA chooses collision with motor vehicle as the loss cause. Mark also tells her the intersection was at 3rd and El Camino, in San Mateo, California. As IDA enters the city, claim center automatically generates a list of potential matches from previously imported cities. The state and zip code are auto-filled because of the zone data we imported. Mark describes the damage that was done to his vehicle. IDA uses the vehicle menu button to edit the vehicle information. IDA enters the description of the damage. The only detail is that there is severe damage to the right side of the car. IDA is the vehicle. Since that is the only detail that Mr. Henderson has, IDA saves her changes. Mark tells IDA that he has information on the car and driver that hit him. She adds a vehicle to the claim. The car that hit Mark is a 2005 Toyota Camry. The car that hit Mark sustained damage to the front bumper and fender. The airbags were deployed. Mark collected the other driver's name and information, so IDA adds a driver to this vehicle. The other driver was Maria Tostado. The other driver was Maria Tostado.  Ida enters Maria's phone number. Ida clicks OK to save the driver details. She clicks OK once more to save the vehicle details. She is now done with the claim details and clicks next to move to services. Mark tells IDA that he needs help finding an auto body shop to repair his car. On the services screen, IDA begins a search for a repair shop. She checks the box for a body shop. She wants to search for a convenient body shop, so she clicks the menu button to begin the search. She selects search. On the search screen, she narrows the search by limiting the type of service Mark needs, which is auto body. She enters San Mateo as the city. She searches for a vendor. The search results show that MB Garage is in San Mateo, so she clicks select. IDA uses the drop-down on the service address to select a convenient service location for Mark. That is the only service that Ida needs to arrange for now, so she continues to the final new claim wizard step. Ida is using the automated assignment rules to assign this claim, so she clicks Finish to complete the new claim wizard and assign the claim to an adjuster. As the last step, she tells Mark that his claim was assigned to Chris Craft, and that the adjuster will be in touch soon. This is the end of the customer service representative new claim wizard demonstration. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy                                                                          \n\n--- IS_Claim_01_03 ---\nChris Craft, the adjuster assigned to the new Mark Henderson claim, reviews his desktop activities and the claim work plan to determine what he needs to work on for the claim. He also reviews the claim summary for an overview of the claim. At the start of the day, Chris logs into ClaimCenter. When Chris logs in, he is taken to the activities screen on the desktop tab, which shows him activities that he is responsible for. The left-hand navigation panel shows items which have numbers of items that he is responsible for. He does not need to run into theount of theountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountount These activities are all associated with the new claim that was just assigned. Remember, activities are tasks that need to be done as part of working a claim. Chris clicks the claim number on one of the new activities for Mark Henderson. This opens the claim so he can have a closer look. The first screen he sees is the claim summary page. The top section of the summary screen shows essential information about the claim. Chris can see that the claim has been open for three days. The financial section at the top shows the total gross incurred is $3,000, and that nothing has been paid. There are no high-risk indicators. The loss details section shows the loss date, when succeed was notified, the location of the loss, and the description. The exposure section shows there is one exposure, which was probably created, automatically during claim creation. He can also see the planned activities for this claim. This entire screen is a view of a single claim. There are links on the left that will show more details about this claim. After looking at the claim summary, Chris looks at one of the activities that he is assigned. The activity is to make initial contact with the claimant. He calls the insured, but they don't answer, so he leaves a voicemail. The next step is to update the activity with a description of what he did, so he edits the activity. Chris enters a description of what he did for the activity. Then he clicks, update. Then he marks the activity as complete. When he does, the worksheet, the frame at the bottom of the screen, disappears and the activity is removed from the all open activities list. That's because he marked it as complete, and it is therefore no longer an open activity. He also knows that he needs to send an acknowledgement letter for this claim. He clicks the actions menu. He selects, send claim acknowledgement letter, under new activity, correspondence. The default values are acceptable, so Chris doesn't add any information to the activity. He clicks, update, to create, to create and assign the activity. Since he didn't specify an owner of the activity, it is automatically assigned to the claim owner, which happens to be Chris. He opens the new activity. The activity is to create a letter, and a letter template is already associated with this activity, which is handy. He clicks the create document button to create the letter. Before claim center creates the document, it allows him to change a few things, like the to, and from, fields, and the copy field. Again, the default values are fine, so he creates the document. When claim center creates the first pass or initial letter, it uses a document template that was created by the configuration team, so that adjusters don't need to create it from scratch. Claim center automatically fills in all of the claims specific data that it can, from the claim. The view edit button downloads the document where the adjuster can view, or, edit it. Chris clicks view edit to get the document. Chris needs to update his phone number. He enters the correct phone number. He saves his changes. He wants to save it as a new document. He changes the name to be more meaningful and saves the document. Since he changed the document, he clicks yes. When he does, he is prompted for the location of the edited document. He browses for the changed document. He clicks open to select the document. Chris knows that this is the final version of the letter, so he changes the status to final. He is finished creating the letter and updating this activity, so he clicks update. That was all he needed to do to complete this activity, so he marks it as complete. Chris wants to make sure the document was added to the claim, so he clicks documents. He sees that the letter he created and edited is attached to the claim and is marked as final. This ends the adjuster of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the \n\n--- IS_Claim_01_04 ---\nOver the life of a claim, the adjuster receives new information that could affect claim processing. Chris Craft is already logged into ClaimCenter. Later in the day, he hears back from Mr. Henderson with more information about the claim. Mark found a witness who verified that he was not at fault. Chris will use the loss details and parties involved screens to update the claim information. The Claim tab menu provides a list of Chris's recently viewed claims. He clicks the menu button. And selects the Mark Henderson claim. Angela Ramirez was walking by when she saw the Camry run a red light and hit Mr. Henderson. This means Chris needs to do two things. First, he needs to record that Mr. Henderson was not at fault, and second, he needs to record that there is a witness. He starts by opening the lost details screen. He then edits the lost details. On the lost details screen, he sets the fault rating to other party at first. He scrolls down to where he can see the lost details. He scrolls down to where he can see the witness section, and adds a witness. Chris uses the menu button on the name field to create a new person. He enters Angela as the first name. And Ramirez as the last name. Chris then clicks, update, to create the witness. He did get a witness statement from Ms. Ramirez, so he sets statement obtained to yes. Ms. Ramirez was walking by at the time of the accident, so she was a pedestrian. She saw the accident from 3rd Avenue. That's all the information Chris has for now, so he saves his changes. He returns to the summary screen. He notices two things have changed. First, in the high-risk indicators section, he sees the claim now shows that subrogation is in review. Secondly, he sees that there is now a subrogation menu option in the left pane. This is because the third party was at fault. There may be an opportunity. for succeed to recover the costs of the claim from the third party. This ends the adjuster party's involved and lost details demonstration. for the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the last of the \n\n--- IS_Claim_01_05 ---\nAs part of adjudication, an adjuster reviews the claims exposures to make decisions about damage. These decisions may include making payments for the claim. Chris is still logged into ClaimCenter. He selects the Mark Henderson claim. Chris needs to evaluate the cost of repairing Mr. Henderson's vehicle in terms of the value of the vehicle. If the repair costs are more than the car is worth, Succeed will just pay the value of the car. There is a total loss calculator function in ClaimCenter. The adjuster can use it to figure out how to proceed with this claim. Since the total loss calculator is related to an exposure, Chris starts by opening the exposures screen. He sees an exposure for Mark's vehicle, so he opens it to look at the details. He opens the total loss calculator. He clicks edit to make changes to the exposure. Chris knows that the vehicle is over 10 years old. And has over 100,000 miles. Mark, also told him that an extrication was required to remove him from the vehicle. He clicks, update, to save his changes and to see if the vehicle is a total loss. He sees that the calculator has qualified the vehicle as a total loss. Because the vehicle is considered a total loss, a new tab for vehicle salvage appears on the exposure. Chris goes to the claim work plan to see if anything has changed. He sees that there are two new activities, recover vehicle, and salvage vehicle. Moving forward on claim adjudication, Chris needs to make a payment against this exposure. He adds a check using the actions menu. He expected to simply issue a check to Mr. Henderson, but there are validation errors that must be fixed before he can continue. Claim Center uses validation levels to identify the maturity of a claim and its exposures. The claim and exposure are currently at the lowest validation level, new loss completion. This is fine for the early stages of adjudication, but in order to make payments, Claim Center requires that the claim and exposure be at the ability to pay validation level. Claim Center uses rules to identify validation, issues and set the validation level. The first, error states that in California, the insured driver's license number is required to make a payment. To correct the data, Chris clicks on the error to open the parties involved screen. He then selects Mark Henderson. He opens the contact details. The driver's license details are at the bottom of the screen, so he scrolls down on the page. The field in error is highlighted in red. Chris enters the driver's license number. He then selects California as the state. He scrolls up the page. And clicks Update. Chris then clears the error message. He has corrected the errors, but just to make sure, he uses the validation option to check that the claim and exposure, are at ability to pay. He sees that there are no errors, so he can proceed with issuing a check. He clears the validation results to close the worksheet. Just as before, he uses the actions menu to create a check. Since this payment is for Mark's vehicle, the payee is Mark Henderson. Chris continues to the next step of the check wizard. The payment is for Mark's vehicle, so Chris chooses first party vehicle, claim cost, auto body, as the reserve line for this payment. This is a partial payment. Chris enters $4,700 for the payment amount and applies the deductible. He continues to the last step. After reviewing the payment details, Chris creates the check. He notices that the check status is pending approval. Chris goes to the work plan. An activity has been added for his supervisor to approve the payment. Chris is done with this claim for now, so he logs out of claim center. This is the end of the exposures and financials demonstration. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy \n\n--- IS_Claim_01_06 ---\nAs a Claim Supervisor, Sue has many responsibilities. In addition to handling her own assigned tasks, she also monitors her team's workload and performance. Sue logs into ClaimCenter. Initially, she sees the activities screen just as an adjuster does. As a supervisor, she has an additional tab to help manage her team. The team screens hold information about the groups that the supervisor is responsible for. The My Groups, Summary view shows the aggregate counts for claims and other entities that are assigned to the groups. Sue supervises. Notice that she supervises a single group. Sue can also use the Team Summary to take a closer look at the details of what is assigned to her group. This screen shows Sue's workload and aggregate status of the items assigned to adjusters in her group. The table at the top shows the counts of objects assigned to each team member by status. The bottom half of the screen provides a graphical view of each team member's workload. Everything for the team looks fine for now, so Sue navigates back to her desktop to see the activities that she may need to address. Here are the review activities assigned to Sue. This is the end of the supervisor basics demonstration. So, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, of course, \n\n--- IS_Claim_01_07 ---\nSupervisor Sue Smith sees an activity in her desktop activities view to review and approve a new payment. The activity has a priority of urgent. She clicks on the subject to open the activity. This activity tells her everything she needs to know about the payment that requires her review and approval. Sue enters a justification for her approval of the payment. After entering the approval rationale, she clicks, Approve, to let processing of the payment continue. When Sue approves the check, the approval activity is marked completed. Since she had enough authority to approve the full amount of the payment, no additional approval activities appear in the work plan, and processing of the check continues. Note that when Sue approved the payment, she clicks Approve, to let processing of the payment continue. She accessed the payment, she accessed the Henderson claim itself, and is now viewing its work plan. She navigates to the claim financial summary to see the current status of the check. The financial summary shows a total paid amount of $4,200 for auto body claim cost for the vehicle exposure. This matches the amount of the checks you just approved. She navigates to the financial checks view. The check is now in awaiting submission status. This means that Claim Center is attempting to send the check information to a check writing system. Once the information has been sent, the status in Claim Center will update to submitted. This ends the supervisor review and approved payments demonstration. Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil  so                                                                                                                                                  \n\n--- IS_Claim_01_08 ---\nPart of Sue's job as a supervisor is to make sure that claims are processed as quickly as possible. Sometimes, she needs to reassign a claim from one adjuster to another, because of the adjuster's workload or other circumstances. She clicks the Team tab to see the workloads of her team members. The summary screen shows aggregated counts of the work assigned to her team. If she supervised multiple teams, it would show them all. The summary shows that her team has 10 open claims. five of which are flagged. She clicks the team in the left pane to see a list of her team members and their relative workloads. Sue now has a view of the relative workload of each of the adjusters on her team. The top half of the screen shows the information in a tabular format, and a graphical view is provided in the lower half of the screen. She notices that Andy Applegate has many open claims, and that his claim weight is higher than any other adjuster. He also has a few overdue activities. She expands the group so she can select any individual adjuster. Because of what she saw on the summary screen, she selects Andy Applegate to see the details of his workload. Sue decides to reassign the bill. Sue decides to reassign the bill Kinman claim to Dan Henson to reduce Andy's workload. She selects the bill Kinman claim by clicking the checkbox to the left of the claim. Then she clicks, Assign. On the Assign screen, she selects Dan Henson from the Select from List Assignment drop-down. And clicks Assign. After Sue Reassign. After Sue Reassigns the Kinman claim, she clicks, Auto 1, Team A, again to view the entire team. The Team Claim screen shows all of the open claims owned by her group. She sees that the Kinman claim is now assigned to Dan. Sue clicks the claim number to look at the claim details. She selects the work plan to look at the activities on this claim. The review coverage in question activity is now assigned to Dan. It was reassigned with the claim. Next, Sue looks at the exposures. She sees that, just like the activities, the exposures for this claim were also reassigned to Dan. She is done for now, so Sue logs out of Claim Center. This ends the supervisor reassign a claim demonstration.\n\n--- IS_Claim_02_01 ---\nIn this demonstration, Ida Belt, a customer service representative, receives calls from a vendor and two clients asking her to check on something specific about a claim in which they have an interest. Ida uses the advanced claim search capability in ClaimCenter to find the claims that are of interest to the callers. As usual, Ida logs into ClaimCenter. She takes a call from AB Garage. Mr. Smith at the garage needs to know which adjuster is assigned to the callers. He doesn't have the claim number, but has the car license plate number, and remembers that the claimant's first name is Ray. She accesses the search menu. She selects Advanced Search. She enters Ray as the first name. She also enters the license plate number for the search. She clicks Search. She scrolls down the page to see the search results. Ida sees the claim she is looking for. And that the adjuster is Andy Applegate. After reviewing the results, she scrolls back up to the top of the page. Next, Ida gets a call from Mr. Albertson. He is looking for information on his claim, but the only thing he knows is that he received a check for $1,500. Ida clicks Checks in the Search Tab's sidebar. She enters part of Mr. Albertson's name. The check search criteria uses a range of values for the amount. She enters $1,500 as the from amount, because that was the amount of the check. She enters the same amount for the to amount. She doesn't know when the check was issued or created, so she chooses any for the creation date. She clicks Search. The results return Mr. Albertson's claim. She opens the claim to see the details. Ida tells Mr. Albertson his claim number, and that the adjuster is William Dufresne. Next, Ida gets a call from Mr. Farley. He hasn't heard from his adjuster and needs to talk to him urgently. Ida starts another search. She selects Advanced Search in the Search Tab's sidebar. Ida uses the first few characters of Mr. Farley's last name for the search. She clicks Search. The search returns one claim from Mr. Farley, so Ida opens it. Ida verifies the claims lost date with Mr. Farley, and tells him that the adjuster is Andy Applegate. Mr. Farley is upset that he has not heard from the adjuster, so Ida uses the Actions menu to create a new general reminder activity for Andy to call Mr. Farley. She enters a new subject, ensure it needs a call back. She sets the due date as today. She sets the escalation date as today. Ida also sets the priority to urgent. Then she saves the new activity. Ida verifies that the new urgent activity is created. She tells Mr. Farley that Mr. Applegate should be calling him soon. Ida is done for the day, so she logs out of Claim Center. This ends the claim search and ad activity demonstration. DEMONSTRATION   DEMONSTRATION        DEMONSTRATION               DEMONSTRATION    DEMONSTRATION \n\n--- IS_Claim_02_02 ---\nAndy Applegate is an adjuster with Succeed Insurance. In this demonstration, he sees that he has an urgent, activity to call Mr. Farley, an insurance customer. He reviews the policy and the notes on the claim to re-familiarize himself with the claim. Andy logs into ClaimCenter. When Andy signs into ClaimCenter, the first page he sees is the desktop activities page. Although most of the adjusters use the activity to call Mr. Farley, an insurance customer. The second page is the default, the first page is the default. He has decided to call Mr. Farley, an insurance customer. He opens his preferences from the actions menu to change his startup view to desktop claims. Andy selects desktop claims as his new startup view. He then clicks Update to save the changes. For the changes to take effect, he needs to log out and log back in. Andy logs back into ClaimCenter. Now he sees his assigned claims as soon as he logs in. He reviews the claims and sees that there are no new claims assigned to him since yesterday. Now he looks at the activities page to see what activities are on his list of tasks to complete. One of the key pieces of information about an activity is the name of the insured. In the default tabular view, the insured column is in the middle, and Andy wants it to be closer to the beginning of the view. He drags the insured column and drops it just before the due date column. Notice that the insured column now appears to the left of the due date column. Just to make sure that he doesn't have any activities that he needs to prepare for, Andy changes the activities filter to all open. Andy notices that there is an urgent activity to call the insured, Mr. Farley, scheduled for tomorrow. He has some time, so he decides to make the call now. Andy wants to make sure he is familiar with the claim before he makes the call, so he opens the claim by clicking the claim number in the activity. Andy scrolls down the page to see the notes on the summary page. He looks at the notes on the summary page, and now he remembers Mr. Farley. He realizes that Mr. Farley is probably trying to get the status on his vehicle. Andy scrolls back to the top of the summary page. Before he calls Mr. Farley, Andy adds a note to the claim file, that he is making the call. Mr. Farley does not, so Andy leaves a voicemail saying that he was returning Mr. Farley's call. He leaves his name and phone number, and tells Mr. Farley that he can reach him whenever it is convenient. He enters information into the subject and text fields of the note, and clicks Update to save the new note. Andy presumes the call is about the service for Mr. Farley's car, he looks at services. He notices in services, there is an action assigned to him to approve a quote for the repair. He wants to see if there are any documents associated with the claim regarding the quote, or an estimate, so he clicks Documents. He sees that there is a document related to an auto repair estimate. He notices that the icon next to the document name means that the document is not stored in the system, but rather is a reference to an external document. He clicks the information icon to see details about the document. Andy sees that the document is an auto repair estimate, or a quote, and that the document is not stored on the server. It is a paper document that is stored in a physical location like a file cabinet. He finds and looks at the actual document. Once he reviews the document, he decides to approve the quote. He starts by navigating back to the summary screen. He then clicks Approve Quote on the service. He checks the amount on the latest quote and sees that it is correct, so he approves the quote. He accepts the proposed requested service completion date. After he approves the quote, Andy sees that the next action is finish the work. There are no other actions required on the claim at this time. This ends the check work plan and documents demonstration.\n\n--- IS_Claim_02_03 ---\nSue Smith is a supervisor with Succeed Insurance. In this demonstration, she checks for, escalated activities and finds that there is at least one item she needs to look at more closely. Sue Logs into ClaimCenter. As a supervisor, she regularly checks for activities that may have been, escalated. The first thing she does this morning is to look at her assigned activities. She sees that the review and approve quote activity on the Farley claim has been escalated. To investigate, she opens the activity. She sees on the activity, detail, that the activity relates to the auto body repairs being done by Joe's, auto body shop. She clicks on the link to see the related service. On the services detail page, she sees that someone has already approved the quote, since it has a status of approved, and the next action is to follow up with the vendor. Sue wonders when it was approved, since she has an escalated activity to approve it. She checks the history of the service. She sees in the history, that Andy recently approved the quote. Since the quote has been approved, the escalated activity is no longer needed. Sue marks the activity complete. Now that she has taken care of that activity, she wants to see if there is anything else that needs her attention. She navigates to the team summary to check her team status. She notices that within the groups she supervises, there are 10 open claims and 6 flagged claims. Since she only has one team, she clicks, auto 1, team, A, to see some details. She notes that, Andy Applegate, has flagged claims, so she decides to take a look at those first. Sue expands the team list. She selects Andy Applegate. As she looks at the list of his claims, she notices that one of the claims is for Ray Newton. Because she sees that this claim is flagged, she decides to take a closer look. On the summary page, Sue checks the top section to see if anything stands out. The number of days open is reasonable and the financials look okay. She notes that there are several high risk, indicators. She hovers the cursor over the flag icon to see details about the flag. She sees that there is a high priority activity that is overdue. She looks at the claim, work plan for more details. She sees that one of the overdue activities is to put the third party on notice of subrogation interest. Sue thinks that she probably needs to give Andy a call to see if there is anything she can do to help, but decides to do a little research first. She navigates back to the claim summary. Although notes are shown on the summary page, only the five latest notes display there. There is a notes page which shows all of the claim notes in one place. Sue opens the notes page. She sees that Andy has contacted the other insurance company and is waiting for a response. He needs to follow up with a letter of subrogation interest. Sue will remind him of that later. To find out more about this claim, she opens history. On the history screen, Sue sees when Andy first viewed the claim and when the system flagged the claim for subrogation. Now that she has more information about the history of the claim, she decides it's time to call Andy to see if there is anything she can help with on this claim. This is the end of the check escalated activities demonstration.\n\n--- IS_Claim_03 ---\nSucceed Insurance has decided to open a claims office in Houston, Texas. They have hired an adjuster, and initially the office will handle a small region. This region will consist of a few zip codes in the area. After a while, they plan on expanding the region to include all of South Texas. To set up the new office, a Succeed Administrator logs into ClaimCenter. The administrator has access to a number of administrative functions, including the new office. including everything required to set up a new office. Those functions include creating and managing regions, groups, users, and security. The administrator starts by clicking the Administration tab. Functions for handling users, groups, and regions, are all within the Users and Security screens. The administrator expands the Users and Security menu in the sidebar. First, he looks at the defined security zones. Security zones. Security zones. Security zones are one of the constructs that prevent users from seeing claims for which they are not authorized. For example, someone who is in the workers' comp security zone cannot see auto and property claims. Succeed has three security zones defined. Next, the administrator looks at the authority limit profiles. An authority limit profile sets limits on the transaction amounts a user can create without requiring further approval. The administrator opens the adjustment an adjuster profile to view its limits. An adjuster profile to view its limits. An adjuster who is assigned this profile can create claim payments without the need for further approval, as long as the total payments to date for the claim are less than $15,000. They may also create payments for up to $1,000 more than the reserves without further approval. Next, the administrator looks at attributes. Attributes can be assigned to users to help identify skills or training that may be useful in a due and adjudicating claims. This is generally customer-specific, so claim-centered does not include any attributes in the base application. It is up to each customer to decide what special attributes they need, and to create them. In setting up the Houston office, the administrator wants to identify those users who speak Spanish. He starts by adding an attribute. He enters Spanish Speaking for the Attribute Name. He also enters a description that may be helpful in deciding if this attribute applies to a specific user. Finally, he selects language as the attribute type. The administrator saves the new attribute. Now that the attribute is created, he continues to regions. This is a partial list of the regions that are defined in the base application. The administrator adds a new region. The new region is for South Texas. This region initially consists of several zip codes. The administrator adds the first zip code. The value is 77089. Using the Add button, the administrator adds additional zip codes until there are 4 in the South Texas region. The administrator saves his changes to create the new region. Now that the South Texas region is created, the administrator can create a group. He uses the Actions menu to create a new group. He enters a name for the new group. The new group will handle auto claims, so he sets the type to auto. He uses Select Group to assign the parent group. The Houston office reports in through the Local Claim Offices group. The administrator searches for a user to assign as the supervisor for this group. He knows the user's name starts with TW, so he enters this into the username field. He searches for the user. The search results include two users with a user name that starts with TW. The administrator selects Todd Wilson. Next, he sets the security zone to auto and property. Finally, he saves the changes and creates the new group. Now that the group is created, the administrator can select the region or regions the group serves. He clicks Edit to start the process. And clicks the Regions tab. On the Regions tab, he clicks Add, to add a region to the group. He knows that the Houston Claims Center will serve the South Texas region, so he enters South as the search criterion. Then, he clicks Search. The results show two regions that begin with South. He selects South Texas region. Because he could have checked multiple regions, he must click Select after the region or regions are selected to add them to the group. Now he saves all of the changes for the group. The Regions screen shows the South Texas region and the zip codes that are covered. Now that the group is created, the administrator uses the Actions menu to create a new user. To create the user, he enters the user's name, Joe Ramirez, and provides a user name and password. Next, he assigns Joe a role. Joe is going to be an adjuster in the Houston Claims Center. Next, the administrator assigns Joe, to, a group. He expands the local claim offices node in the groups tree to locate the Houston office. He finds and selects the Houston Claims Center. The next step is to assign an authority limit. For Joe to work as an adjuster, he needs authority limits. There are two ways to set authority limits. One is to create a custom profile using the Add Authority Limits button to manually add limits that apply only to Joe, and the other is to use an existing profile. In this case, the administrator selects the existing adjuster profile. With the authority limits set, the administrator moves on to attributes. Joe speaks Spanish fluently, so the administrator clicks, Add, to start the process of assigning the Spanish speaking attribute to Joe. He enters a few characters as a search criterion in the name field and clicks Search. He selects Spanish, Speaking, and clicks Select to assign the attribute to Joe. After assigning the attribute, he looks at regions. This screen is used to assign regions to Joe beyond those assigned to his group. Succeed Insurance only wants groups to have regions, so no changes are made to this tab. The administrator clicks Update to save the new user. Now that the user is created within the group and region, claims created within that, region will be assigned to Joe. To demonstrate this, the administrator logs out of Claim Center. Customer Service Representative Ida Belt logs into Claim Center. She creates a new claim as quickly as possible to show that based on the location, it will be assigned to Joe and the Houston office. The claim will be for Ray Newton, so Ida enters, N-E-W-T, as the last name and searches for his policy. The Ray Newton policy is found and selected, and she selects today as the lost date. She continues to the basic information step. Ray Newton called to report the claim, so Ida selects Ray from the name drop-down list. Ray reported that the 1996 Toyota was involved in an accident. Ida continues to the next step of the wizard. The loss causes collision with a motor vehicle. Ida enters the location details of the accident. Notice that the zip code is 77089, which is one of the zip codes assigned to the Houston Claim Center. She clicks Next to go to the next step of the wizard. Because this is a simple claim, no services will be added. The last step is to create and assign the claim. The assignment uses the automated assignment rules. Ida clicks Finish to create and assign the claim. The Houston Claim Center is assigned the South Texas region, which includes the zip code 77089. Because the accident occurred in zip code 77089, the claim was assigned to that group and to the only user in that group, Joe Ramirez. This sends the regions, groups, and users demonstration.\n\n--- IS_Claim_04 ---\nWelcome to the new Claim Wizard demonstration. As Eileen Lang, an adjuster, I need to enter a new workers compensation claim for hardhat construction. I log into Guidewire using my username and password. And I click Login. On the desktop, I click the Claim menu. And select New Claim. In the Organization Name field, I type hardhat, the beginning of the insured company's name. And click Enter to find policies which belong to matching organizations. To enter the date, I click the Calendar Picker button. For purposes of this demonstration, the date of the injury was one month ago. Which is to say October 22nd. When I click the date, the calendar picker automatically closes. The time of loss is optional, but I know it is 7.30 am, so I enter. The location is the location.  Now that this information is entered, I click Next. On the Basic Information step, I enter the location by clicking the picker. And selecting Hardhat Construction's Headquarters location. The accident was reported by a hardhat employee who is not in our database. I will add her to the claim by clicking New Person. By entering her first name, Lily. And her last name, Montez. This is all the information I need about her for now. So I click Update. Lily's relationship to Hardhat Construction. is that she is an employee. The injured worker also is not in our database. I will add him to the claim. His first name is Carrie. And his last name is Jones. Next, I enter Mr. Jones' social security number. His phone number is 650-555-8921. Jones' address is 3512 Centauri Court. In the city of Los Angeles. Which is in the state of California. His zip code is 95115. This is Mr. Jones' home address. This completes the information needed for Kerry Jones. So I click update. And now I move on to the add claim information page of the new claim wizard. This is an incident only claim report, meaning that it is being entered for purposes of making a record, but no payments are expected. Mr. Jones was injured by falling from a ladder. This occurred while he was going about his normal job duties. The employer was notified immediately. So I navigate to last month. And select the 22nd. The accident took place at. Hardhat Construction's main office. At first, Mr. Jones believed that his arm was broken. The accident clearly was not fatal. Though the cause of the injury is implied in the description above, it is required here. So I select the fall, slip, or trip injury option. When he had recovered from the fall, Mr. Jones moved his arm and realized it was just badly bruised, so no medical attention was required. As a result, no time was lost from work. That concludes this step, so I move on to step 4. Finally, I will assign the claim to myself. Meaning, in this scenario, I lean Lang. I click on the claim.  I click on the claim. This completes claim creation with the new claim wizard. I note the claim number, 000-00-000103. And I log out of Claim Center. This concludes the demonstration of the new claim wizard.\n\n--- IS_Claim_05_01 ---\nWelcome to the segmentation demonstration. I enter Eileen Lang's username and password and click Login. Let's look at the Carrie Jones claim. Note that there are no exposures on this claim because it is an incident only claim. On the status page.  I see that the claim segment is, workers compensation, medical only. By way of comparison. Let's look at the Jim Anderson claim. Here, there are two exposures, one for medical details and one for indemnity. And, when I look at the status page. Because there is an indemnity exposure associated with the claim, this claim is segmented as workers comp, indemnity. There is a third segment, workers comp, employers liability. But because segmentation takes place during claim setup, and the new claim wizard in the base configuration does not provide an option to indicate employers liability, this segment will not ordinarily be used. However, claims with employers liability may enter the system from an external FNULL application, and the wizard can be configured to enable indicating employers liability. I logout as Eileen Lang. This concludes the demonstration of segmentation.  This concludes the demonstration of segmentation. of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition of the exhibition exhibition of the exhibition of the exhibition exhibition of the exhibition exhibition of the exhibition exhibition of the exhibition exhibition of the exhibition exhibition of the exhibition exhibition of the exhibition exhibition of the exhibition exhibition of the exhibition exhibition of the exhibition exhibition of the exhibition exhibition of the exhibition exhibition of the exhibition exhibition of the exhibition exhibition of the exhibition exhibition of the exhibition exhibition of the exhibition exhibition of the exhibition exhibition of the exhibition exhibition of exhibition exhibition of the exhibition \n\n--- IS_Claim_05_02 ---\nWelcome to the assignment demonstration. In this demonstration I will create and assign two workers compensation claims. I begin by logging in as an administrator. I enter my credentials. And click login. To better understand this demonstration. I will navigate to the administration tab. And from users and security. Select groups. In the group name field, I type comp. And click the search button. There are two workers comp groups. The first team, A, deals with medical only claims. While team B, deals with claims involving indemnity, such as lost work time. That was all I needed to know for this demonstration. So I log out as the system administrator. So I log out as the system administrator. And as Eileen Lang. And adjuster. I log in to create two workers compensation claims. From the claim menu. I select new claim. In the organization name field. I enter L-E-N-N. And I click search. The only record that is found is a workers compensation policy for Lenar construction. This claim refers to a minor accident. Which occurred last Monday. I click next to enter contact details. The accident occurred. At Lenar's headquarters on Yount Lane. The accident was reported. By Jennifer Albee. Who is an employee. Of Lenar construction. The injured worker is not in our records. So I enter them as a new person. The worker's first name is Pat. And their last name is Murphy. And their social security number is 838-38-3838. I click update. And next. Pat received an electrical shock while using the toaster in the office break room. The incident occurred. The incident occurred in the office.           The incident occurred in the office. The incident occurred in the office. The incident occurred in the office.   The incident occurred in the office. The incident occurred in the office. The incident occurred in the office. The incident occurred in the office.   ! The incident occurred in the office of the incident.  The severity of the injury was minor. Pat was not killed by the shock. For the source of the injury I select miscellaneous causes, as none of the more specific categories really fits. The injury is of a specific type. Which is electric shock. The area of the body affected is the upper extremities. More specifically, Pat's hands and wrists. Both hands were involved. So I select both here. Medical attention was required by the company, to verify that no worse injury had been incurred. But Pat lost no significant amount of work time. I move on to the final page of the wizard, which is assignment. I click finish and claim center automatically assigns the claim. Because there was no loss of work time, the claim has been successfully created and assigned to adjuster Warren Motley of Team A, which as you recall works with medical only claims. Now I will create the second worker's compensation claim. This claim also relates to Lenar construction. So when I click select, the same policy appears as for the first claim. This claim is for an ongoing condition, but it is first being reported today. I click next to start entering information about the claim. Once again, the injury has occurred at Lenar's Yout Lane HQ. And the injury was reported by Jennifer Albee. Who is a particularly conscientious employee of Lenar construction. The injured employee, once again, is not in our files. So I will add them. The injured employee is named Terry. With last name, Pacek. I add Terry's social security number. Then click update. And next, to enter the main claim details. Terry has been experiencing pain and numbness in the wrists and hands while typing. The injury has occurred on the job, where Terry spends much of the day at the keyboard. Though the pain has been building over time. It has recently gotten bad enough that, today, Terry made a formal report of injury to Jennifer. Of course. This took place at Lenar's headquarters. The injury is not fatal. In fact, it is considered a minor injury. The cause of the injury is listed as rubbed or abraded by. And the detailed injury type is strain. The area of the body is the upper extremities while the specific body parts are the wrists and hands for both hands and both wrists on both sides. Medical attention will be required with physical therapy and possible surgery. There will be time lost from work. I click next to move to the assign and finish screen. And, using the default of automated assignment, I click finish. The claim has been submitted and assigned to Candace Payne of Team B, which, you recall, deals with indemnity claims. Now I will search for the first claim I created. While I do know the claimant's name, I will search for any party involved. Whose last name is Murphy? When I click search, the claim I created appears. I click the claim number to navigate to the claim. On the status page, I see that the segment is workers' comp, med only, which matches the assignment to team. There is also an exposure for medical details. Now let's look at the other claim I created. Returning to the claim search page, I enter the last name Tachek and click search. Once again, I click the claim number to navigate to the claim and select the status page. Here I see that the claim segment is workers' comp, indemnity, which matches the assignment to team B. In addition, there are both medical details and indemnity exposures. Finally, I will assign this claim to myself for use in further demonstrations. From the actions menu, I select assign claim. On the select from list, field, I select my own name. Note that Eileen Lang is the only name from team A visible. This is because the claim is currently assigned to team B, so only team B adjusters are visible. Eileen Lang is visible, despite being a member of team A, because she is a currently logged in user and has the correct privileges to own a claim. I click assign. The adjuster for this claim is now Eileen Lang, comp, team A. This concludes the demonstration of claim assign.       so the plan of claiming B, so the plan of claiming B, so the plan of claiming B,                \n\n--- IS_Claim_05_03 ---\nWelcome to the demonstration of the work plan in Claim Setup. I created this claim in the previous demonstration. Let's look at its work plan. ClaimCenter has automatically created a work plan with seven activities in it. Three of these activities, the three-point contact activities, are automatically created for every worker's compensation claim. ClaimCenter, the contact activity for the medical provider and the get initial medical report activity, are associated with the medical details exposure. And one, the get wage statement and tax status activity, is associated with the indemnity exposure. From the activities menu. I can add activities to the work plan manually. There are several broad classes of activities available. I will create a correspondence activity. It is a common practice to send a letter to the claimant, acknowledging the receipt of the claim. Most of the key fields are automatically filled in. I only need a description, to remind me whom to send the letter to. I can add the activity to the work plan. Then I click update to save the activity. The new activity has been added to the work plan and assigned to the claim owner. It has a high priority in a due date tomorrow. It is not associated with either of the exposures. Next, I will create a new claim to demonstrate some more aspects of automated activity creation. In the first screen of the new claim wizard. I enter hard. And click select. The accident. The accident. Took place this morning. I move to the basic information screen. The accident in question took place. The accident. The accident. The accident.         The accident. The accident.  The accident. The accident.       The accident.   The accident.   The accident. The accident.    The accident.              who is not in our records yet. Her first name is Eleanor. And her last name is Mackenzie. And her social security number is 234-232-345. I click update to save her data. Because Eleanor is also the injured worker. I select her name here also. And add that her relation to insured is injured worker. I move on to the loss details screen. This is an incident-only report, meaning that there is no injury requiring medical attention or time off from work. Ms. Mackenzie tripped and bonked her head against the wall of a hallway in Hard Hats HQ. This occurred during her ordinary working hours. She notified her employer of the accident immediately after it occurred. Since the accident took place at Hard Hats Construction's HQ, I select employer here. The injury description is fairly simple. because Ms. Mackenzie returned to her duties immediately, with no medical inspection. We regard the injury as minor. And it obviously did not result in death. The cause of the injury was tripping in the hallway. We will leave the primary and detailed injury types at their default values. The area of the body for this injury is Ms. Mackenzie's head. specifically, Her skull seems to have absorbed most of the impact. Ms. Mackenzie returned to her work duties with no medical attention and no time lost from work. Moving on to the assignment step. I assign the claim to myself. I click finish. I navigate to the claim to view the exposures and activities it has created. Because this is an incident only claim, Claim Center generated no initial exposures. Now, when I look at the work plan, I see that ClaimStunner has automatically created the five activities always created for a worker's compensation claim, the three-point contact activities, one to determine compensability for the claim, and one to do a file review in 30 days. Now, later in the day, Eleanor reports feeling dizzy. The company physician treats her with an ice pack and sends her home from work. Her boss, Pauline Rigby, calls to tell us about this. Now, I will enter this information. Pauline is also nervous about the possibility of a lawsuit, as Eleanor added that the floor was wet and slippery when she fell. So medical attention was required after all. Eleanor is losing work time. And there is the possibility of the employer being liable for the accident. I click Update to save the changes I have made. Looking at the claim summary, I see that there are now three exposures associated with this claim, a medical details exposure, an indemnity exposure for lost time, and an employer liability exposure in case of lawsuit. Next, I'll look at the work plan. Two new activities have been added to the work plan, a get wage statement activity, associated with the indemnity exposure, and a get initial medical report activity, associated with the medical details exposure. This concludes the demonstration of automated work plan generating.\n\n--- IS_Claim_05_04 ---\nWelcome to the validation demonstration. Remember that the goal of the claim is to wreck the ability to pay maturity level. The claim must be at this maturity level before any of the exposures can be paid. Eileen Lang wants to see the maturity level of this latest claim. The validation level for this claim is new loss completion. Recall that the validation levels in the base configuration are load and save. New loss completion. Valid for ISO. Send to external system. And, ability to pay. To see what keeps the claim from reaching ability to pay. Eileen attempts to validate the claim. At the ability to pay level. The validation results pane displays three errors, all of them on the contacts page. Eileen wants to fix the problem so that the claim will be at ability to pay, so she clicks one of them to navigate to that page. Then she clicks clear to dismiss the validation results pane. Since the problem is lack of a primary address for Ms. Mackenzie, Eileen clicks her name on the contacts list. And, under the basics tab, clicks edit. She scrolls down to the primary address section. Eileen enters Ms. Mackenzie's street address. Films. Films. Films.   Films. Films. Films. Films. Films. Films.   Films. Films.                  Films.  Films. Films. Films. Films. She clicks Update to save the address. To verify her work. She goes through the same basic steps as before. Choosing this time to validate the claim and its exposures to ability to pay. This time, no errors are found and the claim and exposures are validated to ability to pay. Eileen closes the Validation Results pane. Since her work is now done. Eileen logs out of Claim Center. This concludes the demonstration of Claim and Exposure Validation. \n\n--- IS_Claim_06_01 ---\nThis demonstration is more of a tour of an existing claim than a demonstration. It shows where and how entities are manifested in the user interface. It reinforces the data model concepts with concrete examples of how those entities are used. Andy Applegate is an adjuster doing some research on a claim. He logs into ClaimCenter. On his desktop, there are four claims. Andy selects the Ray Newton claim. In the Loss Details section you can see the Loss Date, Notice Date, Loss Location, and the Description of the Loss. These are all aspects of the overall claim. Andy now wants to see more details about the loss. On the left side of the page, the loss details pertain to the overall claim. In addition to the fields on the summary, this section shows the Fault Rating, Weather Conditions, Date of Loss, Jurisdiction and and so on. Next, Andy looks at the incidents on this claim. He sees that there are two vehicle incidents and two injury incidents. The vehicle incidents are the Mazda and Saturn, and the injury incidents are for Stan Newton and Bo Simpson. He examines the Mazda incident. On the vehicle incident page, he can see details about the Mazda. It shows the year, make, and model of the car, along with other vehicle specific information. Remember that incident. Remember that incident is subtyped, and that other incident types show other information. Andy returns to, the Loss Details screen. Next, Andy looks at the Stan Newton injury incident. On the injury incident page, Andy sees the details of the injury. It shows things like severity, injury type, treatment type, primary doctor, and so on. Although this is also an incident incident, the data captured for the incident, the data captured for this incident is very different than the data captured for a vehicle incident. Next, Andy looks at some contact information. Andy sees that there is a list of contacts at the top of the page. Some of them are persons, while others are vendors. Each of them has at least one role assigned. The role describes the contacts' relationship to the claim, which is captured in the claim contact entity. They could be a claimant, a witness, a witness, a third party, an injured party, and so on. Andy looks at the contact details of Stan Newton. Stan Newton has several roles on this claim. He is a claimant, a covered party, a driver, and an injured party. At the bottom of the screen, there is a section that shows the detailed information about the contact. There is the full name, which is a composite of the first and last names, along with other bits of information about Stan. There are also fields to capture the driver's license number and state. This information is from the contact entity. Andy examines Mike's, Auto Detailing Shop, which is a service vendor. Mike's, Auto Detailing Shop has only one role on the claim, the role of service vendor. The contact details are very different from the details for Stan. The contact details are different because a vendor is a subtype of contact, just like person is a subtype of contact. Each subtype has its own set of attributes. Notice the attributes don't include first name or last name, but rather the name of the business. Another difference is that the vendor information does not include a driver's license number, or state. Next, Andy looks at the exposure on this claim. As we saw earlier, there are four incidents on this claim, two vehicle incidents and two injury incidents. In this case, we have one exposure for each incident, although we could have more than one exposure for each incident. Andy looks at the vehicle exposure for Ray Newton. This exposure is for collision coverage on the Saturn, which means that this exposure is related to the Saturn incident. The claimant is the insured, Ray Newton. Remember that Ray is listed on the parties involved as a claimant, along with other roles. The validation level for this exposure is at ability to pay, which means that the information on this exposure is sufficient for payment. Andy looks at the work plan, or activities for this claim. The work plan shows all the activities that relate to this claim. There is a drop-down where the user can filter which activities are displayed, but the default is all open activities. Andy opens the, Get Vehicle Inspected activity, which is related to the first-party vehicle exposure. The activity details display in a worksheet view in the lower third of the screen. Notice that this activity is related to the first-party vehicle, Ray Newton exposure. It is a reminder to Andy to have the vehicle inspected. This activity is related to the exposure entity. Andy closes the activity worksheet. That last activity was related to an exposure. Now Andy looks at the call witness activity. The activity, call witness, is related to the claim. It is not specific to any exposure, but, rather applies to the entire claim. The witness saw the accident, which is the overall claim, not a specific vehicle. Andy closes the activity worksheet. And opens the financial screen. The financial summary page shows the overall status of the financials for this claim. First notice that the top of the page shows the claim level totals. Each exposure has reserve lines under claim cost and expense. Those are the multiple reserve lines on a claim and exposures. In the claim financial transactions screen, Andy can also look at the transactions that make up the financial summary. The default list of transactions includes all types of transactions. The drop-down list in the upper right corner of the page contains additional filters to change the transaction view. Andy selects reserves to restrict the list to only reserve transactions. The list now shows all the transactions that have been applied to the reserve lines. These transactions are maintained in the transaction entity. The total of the submitted, non-pending transactions is the total incurred for the claim. Andy goes back to look at all the transactions. The transaction list now contains a mix of reserves and payments. As before, the total of the reserves is the total incurred. The total of the payments will be the total amount paid for the claim to date. These are payment transactions and not necessarily the number of checks submitted. Remember, a check may contain multiple payments. Next, Andy looks at the checks. Next, Andy looks at the checks. There has been only one check issued against this claim. The gross amount of the check is $2,000. Andy clicks the check number to see the details of the check. The net amount of this check is $1,900. This is because when the check was submitted, the adjuster applied a deduction for backup withholding. Applying a deduction is one of the options available when creating a check. At the bottom of the screen is the payments section. There are multiple payment transactions on this one check. The check is stored in the check entity, and may be related to multiple transactions. In this case, there are payments for the collision coverage, as well as multiple medical payments. The sum of all the payments is the gross amount of the check. Remember that in Claim Center, a check is a payment. It may be a physical check, or an electronic funds transfer. Andy logs out of Claim Center. This ends the entities in the user interface demonstration. D- D- D-                       D-   D-                           situation.\n\n--- IS_Claim_06_02 ---\nAndy Applegate is an adjuster doing some research on what data is available on a claim. From an operating system file window, he finds the ClaimCenter installation and drills down to build, dictionary, data. He opens index.html. From the opening page of index.html, Andy can see several views of the data entities and a list of type lists. He opens the data. Entities page. The opening page shows a list of the ClaimCenter entities on the left. Andy is looking for details of the claim entity, so he scrolls to where he can see the claim entity in the list. He clicks Claim to see the details of the claim entity. On the claim page, he can choose to navigate quickly to the fields, arrays, or unique keys for the claim entity. Since he is interested in seeing the relationship to activity, he selects the arrays link. In the arrays section of the claim entity, Andy sees the activities array. The text says that it is an array key for activity. That means that this array holds keys that point to all the activities that relate to a given claim. Andy clicks activity to open the activity entity page. The activity page, shows the same properties for activity. as the claim page did for the claim entity. There are links to the, fields, arrays, and unique keys. Andy is interested in the claim attribute, so he scrolls down the fields list to find it. The claim attribute is a foreign key back to the claim entity. So, for each activity associated with a claim, there is a pointer back to that specific claim. Andy navigates back to the claim entity. Andy navigates back to the claim entity and looks at the arrays list again. He could click either the browser back button, or the link to claim from the claim attribute. Using the back button takes him back to the arrays list on the claim. The claim link would take him to the top of the claim entity. From the claim entity array list, Andy scrolls to find the contacts attribute. Notice that, although the name is contacts, the array key is for claim contact. Remember that each claim may have multiple claim contacts. Andy opens the claim contact entity. He then scrolls down to find the claim attribute. He finds the claim attribute which is a foreign key, or pointer, back to the owning claim for this claim contact. Recall that each claim contact is related to one claim. Next, Andy scrolls to find the contact attribute. The contact attribute is a foreign key to contact. Remember that claim contact is what keeps track of each contact that has a relationship with a claim. Andy navigates to the contact entity. On the contact entity, Andy notices that there is a list of subtypes for contact, like company, person, and place. He also sees that the subtypes have their own subtypes. For example, company has company vendor which is further subtyped to auto repair shop, auto towing agency, and so on. Person has its own set of subtypes, including adjudicator, person vendor, and user contact. He clicks on the link for the person subtype. He notices a few of the fields, like date of birth, first, name, and last name, which seem standard information for a person. He navigates back to the claim entity. This ends the examining the data dictionary demonstration. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy                                                                          \n\n--- IS_Claim_07_01 ---\nWelcome to the demonstration of determining compensability. Eileen Lange needs to adjudicate a claim for the FitRight Manufacturing Workers Compensation Policy involving a fatality. The name of the worker involved is Bev Blackburn. Eileen navigates to the loss details page for the claim. And clicks edit to begin determining compensability. Note that the first compensability factor, injury during employment, was set during claim injury. Beve Blackburn was involved in normal business activities when the accident occurred. FitRight Manufacturing is not disputing the claim. FitRight provides adequate safety equipment. And Bev was using that equipment at the time of the accident. While Bev's supervisor says that there is very little likelihood of drugs being a factor in the accident, Eileen marks this as unknown pending further information. As for the actual compensability, the fact that the accident was not a factor in the accident. The fact that the accident was not a factor in the accident. Eileen sets it to pending. Eileen makes a note indicating that the final decision is pending a coroner's report. The fact that the accident was not a factor in the accident. Eileen clicks update to save her work. This concludes the demonstration of determining compensability.\n\n--- IS_Claim_07_02 ---\nWelcome to the exposures demonstration. Eileen Lang is still working on the Bev Blackburn claim for FitRight manufacturing. Blackburn's family attorney has contacted FitRight's counsel concerning the possibility of a wrongful death lawsuit. Eileen will add an appropriate exposure to the claim. In the classification section, she indicates that employer liability has entered the picture. And saves this information. On the summary page for the claim. She sees that an employer liability exposure has been added to the claim. Eileen navigates to it. To add the known details. The attorney is speaking of liability for Bev Blackburn's reasonably expected lifetime earnings and retirement benefits. She is speaking of a figure in the range of $4 million. Since the accident occurred in Illinois. Eileen scrolls down. And selects Illinois as the jurisdiction for the exposure. There is not much more known about the potential suit at this time, so Eileen saves her work. On the claims history page. The two most recent history events show that the employer liability exposure was created and assigned to Eileen Lang. On the litigation page, however, no legal matter has been automatically created. Matters, which track legal documents and processes, must be created manually in the base application when a suit is filed. Eileen's work on this claim is through. So she logs out of Claim Center for now. This concludes the exposures demonstration. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy \n\n--- IS_Claim_07_03 ---\nWelcome to the Reserve Lines Demonstration. In this demonstration, Eileen Lange adds ClaimCost and ClaimExpense Reserve Lines to the Eleanor McKenzie claim. Eileen enters her username and her password and logs into ClaimCenter. She expands the Claims menu and enters the claim number for the Paul Salah claim against TR Gromit. She navigates to the Financial Screen. Here, Eileen sees that there are two sets of reserves already created, on for each of the two exposures. Each reserve line maps to a single exposure. $17,000 has been set aside for this claim. These reserve lines tell the story of the claim from a financial angle. The high amount set aside for claim cost on the Medical Details Exposure, plus the expense reserve line for a nurse case manager, suggest a serious injury. Meanwhile, the indemnity exposure tells another part of the story. We see Claim Cost Reserve Lines for Temporary Total Disability and Vocational, which suggest that Paul, the injured worker, will return to work before he is fully recovered, and do some other job for which he will require training. Because that job pays less than Paul's regular job, a reserve line has been created for supplemental earnings. Now, Eileen needs to create some reserve lines for Eleanor McKenzie's claim. She navigates to the claim. And to its Financial Summary page. No reserves have been set so far. Eileen will create the preliminary reserve lines for the claim. Eileen really doesn't know much about Eleanor's work status yet, though she is sure that Eleanor will miss at least some work. But she does know that Eleanor's symptoms are suggestive of a concussion, so she sets aside some funds on that basis. Claim Center has already created exposures. Eileen adds reserve lines to the Medical Details Exposure. The cost type for this reserve line Is claimed cost, that is, money used for indemnifying the injured party. And the cost category Is for a medical examination Eileen knows that in a case like this an MRI will probably be required. Between that and the doctor's fees, she sets aside $5,000 as a reserve line. Based on her knowledge and experience, Eileen decides to add a second reserve line to the Medical Details Exposure. Because of the nature of the injury And the risks associated with a concussion. Eileen decides to add reserves For an A and O, adjusting another expense. In particular, Eileen decides to To budget for a nurse case manager. She sets aside $500 to cover this expense. Finally, Eileen saves her work. Returning to the Financial Summary Screen Eileen sees that the remaining reserves and net total incurred are both $5,500. Drilling down on a Single Reserve Line Eileen sees that the status of the reserve line is submitting. This means that no approval is required, Because the reserve is within Eileen's authority limit as an adjuster. This concludes the demonstration of reserve line.\n\n--- IS_Claim_07_04 ---\nWelcome to the demonstration of the loss details screen. Eileen Lang is still working on the Bev Blackburn claim. She has received additional information relevant to determining compensability for the claim. She navigates to look at the loss details screen. The loss details screen is the key to determining whether the claim is a covered event. The compensability factors and compensability decision sections are where the decision is actually made, but other information on the screen is relevant else. Eileen clicks Edit to add information to the screen. Description and specific activity being performed are important fields that help determine whether the youth's actions at that time fall in line with the terms of coverage. The injury section helps to estimate what medical costs may be expected prior to receiving actual invoices. Eileen has received information that Bev Blackburn was crushed from the neck to the pelvis. In addition, she has received Bev's wage data. Bev worked 5 days per week, 8 hours per day, for $15.50 per hour, making an average weekly wage of $620, paid bi-weekly. Bev was hired on July 1, 2014. Since then, FitRight Manufacturing operates solely in Illinois. And that is where Bev was hired. Since her date of hire. Bev has consistently been a full-time employee. Bev's manager is not in our database yet. So Eileen adds her. Her first name is Sam. And her last name is Benedict. Eileen clicks Update to save Sam Benedict and return to the loss details screen. Bev worked a typical work week of 5 days. Putting in a solid 8-hour day. The company's payment schedule for hourly workers. Is bi-weekly, with payment made one week after the end of the pay period. FitRight Manufacturing will pay the full day's wages for the day on which the accident took place. But they are leaving anything beyond that to succeed insurance to determine. And, of course, the concept of modified duty is irrelevant. In addition, we have received a copy of the coroner's report. Eileen adds the details of the coroner's report to the claim. The Metropolitan Report Type Is Coroner Reports The date on which Bev died Is the date of the accident. The report was filed by the Tazewell County Coroner's Office. And the report was issued today. Tazewell County is in Illinois. Eileen types the first few letters, ILL, to select it quickly. Clicking OK saves the report and returns to the loss details screen. Note that once the report is saved it cannot be further edited. The coroner's report indicates that there were no drugs involved. This allows Eileen to make a final determination that the claim is compensable. Eileen has determined that all qualifying factors for compensability are present and correct. With the determination of compensability complete, Eileen saves her work. The final step of determining compensability Is to complete the determined compensability activity in the claims work plan. Eileen clicks Complete. The activity worksheet closes And the activity is removed from the all open activities list. This concludes the demonstration of the loss details screen.\n\n--- IS_Claim_08_01 ---\nThe video is the main page for the medical details exposure. Eileen has received a call for a new workers compensation claim. She navigates to the new claim wizard. In the organization name search field, she enters George and clicks the search button. And the Georgetown roofing workers compensation policy is displayed. The incident occurred today. Eileen navigates to the basic information step of the wizard. The reporter is not in our records. The reporter is not in our records. So Eileen adds him. The reporter's first name is Richard. And his last name is Marin. Eileen saves the info. Mr. Marin works at Georgetown roofing. As a human resources specialist. As for the injured worker. He also is new to our records. His first name is Kim. His last name is Chung. And his social security number is 666-77-8888. Eileen saves and returns to the new claim wizard. And navigates to the lost details step. Here, she enters a description of what happened to Mr. Chung. of the Thank you. Thank you. Thank you. Which is a fairly severe occurrence. So Eileen marks it as of major severity. Due to his co-workers timely reaction, Mr. Chung is not dead. As for the cause or source of the injury, the best fit is miscellaneous causes. The primary injury type is specific injury as opposed to multiple injuries. And the specific type is vascular, as this incident involves the circulatory system. The area of the body affected. Is the trunk or torso. The specific body part affected by a heart attack. Is the heart. Mr. Chung will clearly lose a significant amount of time from work. He was taken to the emergency room and further medical attention will be required. This is all the information Eileen has at this time. On the final page of the new claim wizard. Eileen selects herself as the adjuster for this claim. This completes the creation of the new claim. Now Eileen navigates to the claim. And navigates to the medical details exposure. In the financials section, she can view the sum total reserves, payments, and recoveries associated with the medical details exposure. The coding section shows the details of how the exposure was segmented. The body parts section, drawing from the new claim wizard, lists the injured body parts, which is useful when the adjuster is not the same person who input the claim. The medical diagnosis section is always blank at first. A list will appear here showing the coded medical diagnoses provided by the injured workers medical team. There is also a list of activities specifically related to this exposure. In the base application, two activities are automatically generated upon creation of a medical details exposure, making contact with a medical provider, and getting the initial medical report. Of course, these activities are only part of the work plan for the whole claim. The base configuration has generated five additional activities, one associated with the indemnity exposure, and the other four associated with the claim itself. This concludes the medical details exposure demonstration.\n\n--- IS_Claim_08_02 ---\nWelcome to the Diagnoses and ICD-10 Codes demonstration. In this demonstration, Eileen Lang will add a doctor and a diagnosis to an existing claim. First, let's flip at the medical details screen. While an injury description can be the best estimate of a lay person, a diagnosis is a very specific matter that can only come from a medical provider. In particular, diagnoses come in the form of codes, called International Classification of Diseases, Tenth Revision, or ICD-10. ICD-10 codes, once entered, appear on the Summary Card of the Medical Details page. Eileen requested and has received the initial medical report. She will enter the doctor's information on the parties involved page, then enter the diagnosis. She clicks the New Contact button. And, from the drop-down list, selects Vendor. And then Doctor. The doctor's first name is Jack. And his last name is Booney Apodic. A tax ID is required for all vendors. For a contact to be associated with a claim, it must have at least one role on that claim. A role is generally associated with either an exposure or with a claim as a whole. In this case, the role is associated with the medical details exposure. There is a list of roles, which can be expanded by configuration. One of the listed roles is Other, which provides additional flexibility. In this case, the role is Doctor. Eileen saves the doctor's information. In a real implementation more data would be collected. Returning to the medical details exposure. Eileen selects the medical case management card. And clicks Edit. She adds the medical diagnosis. The ICD code on the diagnosis is I49.0. The code represents ventricular fibrillation and flutter. The provider name picker lists only medical personnel and organizations associated with either this exposure or the claim as a whole. Eileen selects Dr. Booney Apodic. Eileen saves her work. This concludes the demonstration of diagnoses and ICD-10 code.\n\n--- IS_Claim_08_03 ---\nWelcome to the demonstration of medical case management. In this demonstration, Eileen Lang adds a nurse case manager to the Kin Chung claim and adds the medications that have been prescribed for Mr. Chung. To add the nurse case manager, Eileen navigates to the parties involved screen and clicks new contact. A nurse case manager is added as a person. The nurse case manager's first name is Will. And his last name is Andrews. Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil manager. Eileen saves the newly created contact and returns to the medical details exposure. On the summary card, Eileen clicks edit and then from the list of available contacts selects Will Andrews, the only one who has the nurse case manager role. After saving her work on this card, she navigates to the medical case management card. Will Andrews will now work with the medical providers to monitor KIN's progress and provide details to succeed insurance. In the medical actions and information list, Eileen records any relevant information she receives during the course of treatment. Eileen receives a call. On the first day of medical care management, the source of the call is Will Andrews, the medical case manager. Will's source of information is an update from Dr. Bunia Paddock. The update on Mr. Chung's treatment status is that he will have to stay in hospital for a few days. As for returning to work, there will be a bit of a recovery period before he can take on modified duties. Will says that he expects another update from Dr. Bunia Paddock tomorrow afternoon. Will also tells Eileen about some medications Dr. Bunia Paddock has prescribed. The first field for a prescription is the prescribing doctor. The first drug is Captopril, an ACE inhibitor. The prescriptions were both written today. The second prescription is for Warfarin, an anticoagulant and blood thinner. Once again, Eileen clicks Update to save her work. As Kin's treatment progresses, Will will continue to provide updates and help to determine what drugs and procedures are necessary and appropriate for Kin to receive. It will remain up to Eileen to determine whether those drugs and treatments are covered under Georgetown Roofing's policy. This concludes the medical case management demonstration.\n\n--- IS_Claim_08_04 ---\nWelcome to the Indemnity Exposure demonstration. Eileen Lang is still working on the Georgetown Roofing claim for Kin Chung. Eileen has an open activity related to the Indemnity Exposure, which is to get Kin's wage statement and tax status. She has contacted Georgetown Roofing's HR department. By the next day, they have provided an electronic copy of Kin's information. So Eileen marks the activity complete. Then she navigates to the Indemnity Exposure Demonstration. She has provided an electronic copy of the Indemnity Exposure to add the information she has received. First, she adds information about the work time Kin is missing. Kin is off work and will be for some time. Kin's medical time off work began on the day of the incident, and it is not yet known when he will be able to return. Yesterday, the day of the incident, was the last day Kin worked. Georgetown Roofing has stated that Kin will be paid for that last day. Eileen is finished entering the work status, so she clicks OK to save it. A modified duty arrangement is not available, so Kin will not return to work until he is sufficiently recovered to do his normal job. But the doctor's expectation is that he will make a full recovery and will be able to return to work until he is sufficiently recovered. In the benefits tab, he will return to his usual job. On the benefits tab, Eileen calculates the workers' compensation payment Kin will receive. Kin makes $880 per week. Since there will be no period of modified duty, his post-injury wage will also be $880 per week. Eileen clicks Update to save her work and calculate the weekly compensation rate. Kin is temporarily disabled, he will return to work, but the disability is total, he cannot work even a modified duty until he is fully recovered. Looking at the temporary total disability section of the benefits card, Eileen sees that Kin will receive a weekly payment of $586.67. This concludes the indemnity exposure simulation. This concludes the indemnity exposure simulation.\n\n--- IS_Claim_09_01 ---\nThis demonstration provides a tour of the financial elements of a claim. It starts with a claim summary, moves to the financials summary, then reviews the exposures, transactions, and finally a check. Andy Applegate is an adjuster for Succeed Insurance. Several claims are assigned to him, so he periodically takes a quick look to see the status of the claim financials. Andy logs into ClaimCenter. His initial view is the desktop access. He has a list of the activities screen. He navigates to the claims page to see what claims are currently in his queue. He locates the claim for the insured Ray Newton and opens it. On the summary page, Andy sees that the gross incurred for this claim is $18,400, which represents the total of any open reserves plus total payments. He also sees that $2,000 has already been paid on the claim. Now that he has a high-level view of the claim, he navigates to the financials summary to look at the financial details for the claim. He examines the different exposures on the financials summary exposure view. Notice that there are four exposures. 1. Ray Newton collision. 2. Stan Newton Medical. 3. Beau Simpson liability property. And 4. Beau Simpson liability medical. The exposure view of the financials summary includes six financial measures. The first is open recovery. 2. Open recovery reserves, which are estimates of how much money might be recovered from others in settling the claim. Open recovery reserves are calculated by subtracting total recoveries from the total recovery reserves. Remaining reserves are the estimate of the remaining amount that the carrier still must pay out for the claim. This calculated value is all open reserves minus all approved eroding payments and future eroding payments. Future payments are the amount that is scheduled to be paid at a future date. 3. Total paid is the amount that is scheduled to be paid at a future date. Total paid is the amount already paid out for the claim. Recoveries are the amount of money collected to offset the claim payments, such as from salvage or subrogation. The last financial measure is net total incurred, the amount of money the company currently expects to pay for the claim. Now, Andy examines the Stan Newton medical payment exposure. 3. Note that the net total incurred is $3,500. There is a claim cost of $3,000 and an expense of $500. 4. Also, notice the remaining reserves is $2,000, and the total paid is $1,500. Now, Andy goes to the financial transaction screen so he can look at the transactions that make up the reserve line. 5. The financial transaction screen shows all existing transaction types for the claim. The Ray Newton claims financials currently include both reserves and payments. 6. Andy clicks on the sort arrow on the exposure column heading to order the screen contents by exposure. This makes it easier to view the transaction types for each exposure. 6. He sees 6 transactions for the second exposure, 3 that add to reserves, and 3 that are payments that reduce the remaining reserves. 6. The total of the reserve transactions for the exposure is $3,500. 7. Notice that the first two reserve transactions are for claim costs with a category of medical, one is for $500 and one is for $2,500. 7. The last reserve transaction is against the same exposure, but this one has a cost type of claim expense. 7. Remember that an expense is a cost that is incurred in the processing of the claim, such as retrieving a medical report, or getting a second opinion. 8. The next three transactions are payments made from the reserve lines. The total of these payment transactions is $1,500. 8. Subtracting $1,500 in payments from the total reserves of $3,500 results in remaining reserves of $2,000 for the exposure, as shown previously on the financials summary screen. 8. Andy navigates back to the financials summary screen to review the summary information again. 9. He verifies that the second exposure has remaining reserves of $2,000, total paid of $1,500, and net total incurred of $3,500. 9. Next, Andy wants to examine the medical payments for the second exposure, so he clicks on the amount in the total paid column for that exposure. 10. Notice that the total paid amount for the exposure consists of two payment transactions, each for $500. 10. Andy clicks on the first payment link to see what it covers. 11. Notice that this transaction covers a doctor's visit for $500, and that the check number is $10,436. 11. Andy navigates to the second payment. 12. The second payment is for physical therapy. 12. Notice the check number, 10,436, is the same as the check number of the previous payment. 12. Both of those payments, are for the medical payments exposure for Stan Newton. 12. Next, Andy navigates to the financial checks screen to look at any checks that may have been issued for payment. 12. There is only one check for $2,000. 12. Andy clicks on the check number to look at the details on the check. 12. First notice that the check is written to Ray Newton, that he is the only payee, and that the payment is for $1,900. 12. The gross payment amount is $2,000, which is reduced by the backup withholding amount of $100. 12. Scrolling down to the payments section, notice that there are multiple payments from multiple exposures. 12. There are three for medical exposures and two for the collision exposure. 12. Andy clicks on the magnifying glass next to the $400 payment for the collision exposure to view the payment details. 13. Notice that this payment is for a collision specialist fee. 14. It is an expense cost type and it erodes the reserve. 14. Now Andy clicks on the View Check button to return to the check. 15. Andy sees that the check has already been issued for a payment that covers several of the expenses. 15. Now he has an idea of the financial status of this claim. 15. This ends the demonstration for claim financial terms and conditions. 16. So, the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the \n\n--- IS_Claim_10_01 ---\nWelcome to the Creating and Changing Reserves demonstration. Gerald Ikes, an adjuster, logs on to ClaimCenter. Due to the pandemic, there is a shortage of customer service representatives today. So Gerald is taking accident reports and entering them into ClaimCenter as needed. Gerald receives a call from Lenar Construction. So he starts the new Claim Wizard, types Lenar for the organization name search criterion, and clicks the search button to find policies. Lenar Construction's workers' compensation policy is the sole record returned. The accident being reported took place today. Gerald navigates to the basic information page. The incident is associated. The injured worker is associated with Lenar's headquarters at 846 Yount Lane in Hollywood. The call reporting the accident came from Jennifer Albee. Ms. Albee is a human relations specialist at Lenar. The injured worker is not in our records. So Gerald will add him. The injured worker's first name is Bob. And his surname is Tyre. Mr. Tyre's social security code is 882-54-6378. And he lives at 5 964 Sabo Road in Hollywood. Bob was inspecting some brickwork. On the second story of a new house. When he lost his footing and fell. From the letter. The accident took place at the premises of a Lenar Construction customer. At 5490 Hughes Road in Hollywood. The accident took place at the end. Because the premises where the accident took place is neither that of the employer or any lissie thereof, Gerald picks other for the accident premises. He appears to have broken his left ankle. A broken ankle would be considered a minor injury. And nobody is dead. For the cause of injury, source. Gerald selects fall, slip, or trip injury. And for the detailed cause, source. He selects fall, slip, or trip injury from ladder or scaffolding. For the primary injury type, the default, specific injury is correct. The detailed injury type is fracture. The body area involved is the lower extremities. While the specific body part is the ankle. When you select body parts that are reflected from side to side, claim center makes the side field available. It is Mr. Tyre's left angle that is in this case affected. Mr. Tyre was assisted TP a CARF and taken to the ER, where medical treatment was applied. And Mr. Tyre will certainly miss at least a few shifts because of the injury. Gerald moves on to the last step of the new claim wizard. This is the save and assign claim step. He assigns the claim to himself. And he saves it. This takes him to the new claim saved page, which is unusual in having no sidebar links. He clicks the new claim number to navigate to the claim. Gerald looks at the summary and sees that the financials have zero gross incurred, meaning that there are no reserves set for this claim. He sees that the claim is in review for subrogation. That is an automatic setting based on the loss type. When the loss type is fall from ladder, there is a higher probability of subrogation, so claim center sets that automatically. He also notices that there are two exposures on the claim, medical details, and indemnity. He wants to add a reserve line to the medical details exposure, so he selects it from the exposures list. At the top of the medical details exposure screen are a number of action buttons. Gerald clicks create reserve. The exposure column for the new reserve is preset to one medical details. This reserve is being made against expected claim costs. While the cost type is about where the money is going to the cost category is more about where it is going. That is, the purpose of the planned expenditure. In this case, the money is for medical expenses associated with Mr. Tyre's ankle injury. The usual and customary costs for a broken ankle are generally in the range of $4,000. So Gerald enters that amount into the new available reserves column. There is another reserve line to be added. Again, the medical details exposure is automatically selected. This will generally be the case when reserves are added directly from an exposure. This reserve is for adjusting in other, A&O, expenses. In the case of claims, A&O reserves cover expenses associated with the claim, but not directly for making the claimant whole. For example, for a large medical reserve, it is common to add a medical case management expense, for a nurse case manager who tracks treatment and ensures that all expenses being reimbursed are necessary and proper. Gerald estimates case management costs for this exposure at $1,000. Gerald enters this amount. Those were the only reserves needed for this exposure, so Gerald saves his work. This brings Gerald to the financials, transactions screen. Some time later, he discovers that the proper amount for the claim cost reserve line is $4,500, so he comes to this screen and clicks the reserve button for that reserve. On the reserve details screen, he clicks the edit button. And edits the amount for the reserve line by replacing the first zero with a five. The amount is now correct, so Gerald clicks save. Saving the new transactions brings Gerald back to the transactions screen. Although there are two transactions highlighted here, they are both related to the same reserve line. This concludes the demonstration of creating and changing reserves. Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of Filogy of the Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of                                                                          \n\n--- IS_Claim_10_02 ---\nWelcome to the issuing payments demonstration. In this demonstration, Gerald Ikes issues two payments for the Bob Tyre claim. One way to navigate to a claim from the desktop is to click its claim number. Since Gerald is about to issue payments, he needs to make sure that the claim and its exposures are all at the ability to pay validation level. From the actions menu, Gerald selects the validate claim and exposures action. And tests the validity of the claim to the ability to pay validation level. There are no validation errors, so Gerald clicks clear to close the validation results pane. Gerald has received bills from the medical provider and the nurse case manager. He will issue payments to cover these bills. The first payment is to the medical provider, Dr. Jim Kildare. Next to the reserve line for medical costs, Gerald clicks the picker. And selects create check. Remember that, in ClaimCenter, the word check refers to any payment. The payment instrument, be it's a payment instrument, be it cash, electronic, or a paper check. On the first step of the check wizard, the payee is selected, and details about them added to the check object. The medical provider is named Dr. Jim Kildare. On the second step of the check wizard, Gerald will enter details about the payment. A further bill is expected from Dr. Kildare when the cast is removed from Mr. Tyre's ankle. In the comments field, Gerald enters a note about the specific service for which the payment is made. A single payment instrument may cover more than one expense item within the cost type and cost category selected for the check. In this case, there will only be one expense item. The expense item is a payment to Dr. Kildare, so Gerald selects the doctor expense category. Note that the categories are filtered so, for example, only categories relevant to a medical expense appear here. This bill covers an emergency clinic visit, testing, x-rays, diagnosis, and treatment. The third step of the check wizard contains information which may not be relevant for all payment instrument types. None of the information gathered here is relevant to this check, so Gerald clicks finish to submit the payment for processing. The status of the check is awaiting submission. ClaimCenter processes payments in a batch on a regular basis, typically once per day. Until the batch is run, the status of all new checks will be awaiting submission. If Gerald now looks at the transaction screen. He sees a payment transaction in the amount of $3,875 against the claim cost, medical exposure. It was created by Gerald Ikes and its status is awaiting submission. Now Gerald will enter the second check. Now Gerald will enter the second check. He returns to the financial summary screen. This payment will be made against the reserve set aside for case management. Once again, he selects create check from the picker dropdown. On the first step of the check wizard, he selects the nurse case manager. Gerald, who, for this claim, is Suzanne Roche. The payee type does not autofill for payees with only one role. The payee type is vendor. Gerald navigates to step 2 of the check wizard. In this case, Ms. Roche does not expect to do any further work on this case, so she has sent us a final bill. Setting a payment to final has implications down the road. Gerald enters a note to the effect that this is the full and final payment to Ms. Roche for this claim. Ms. Roche's final bill, and our payment to her, is for $650. He navigates to the next page. And clicks finish to submit the claim. Once again, Gerald navigates to the transaction screen. Here, in addition to the $650 payment transaction, there is a minus $350 reserve transaction. The purpose of a reserve transaction is to zero out any balance remaining on a reserve when the final payment has been made against it. So now, if Gerald navigates to the financial summary screen. He sees that there are $625 remaining for the claim cost reserve line. While there is no money left in the case management reserve line, because it has been zeroed out. This concludes the issuing payments demonstration.\n\n--- IS_Claim_11_01 ---\nThis demonstration shows how authority limits help constrain payments and transactions. It reviews the definition of a reserve limit and how the limit impacts a reserve change. Finally, it shows how to modify an authority limit to restrict what a user can do. First, a system administrator logs into ClaimCenter to look at a user's authority limits. She navigates to the administration screens. And then to the user's screen to search for the user's. Search for a specific user. She searches for user Andy Applegate by entering part of his user name into the search criteria. She opens the Andy Applegate user contact record from the search results. The basic information for Andy's user profile displays. To look at his authority limits, she clicks the authority limits tab. Andy's authority limits profile includes three authority limits. The first is for total pay. The second line of the profile limits. The second line of the profile limits the total reserves on a claim to $15,000. This means that if Andy creates or changes a reserve so that the total reserves on the claim exceed this threshold, the transaction will require approval. The third limit allows Andy to make payments that exceed reserves without approval as long as the payment amount is less than $1,000 over the reserve. The system administrator logs out of ClaimCenter. Now claims adjuster Andy Applegate logs into ClaimCenter. On the desktop claims screen, he locates and opens the Ray Newton claim. Notice on the summary screen that the grossing current is $18,400. That is the total reserves. That is the total reserves for this claim. Now Andy goes to the financial summary screen. Andy heard from the garage where Mr. Newton took his car, and the repair costs are higher than the reserve. Andy needs to increase the reserve, so he locates the auto body reserve line and clicks the menu button. He chooses Edit Reserve from the menu. He changes the value in the new available reserves field to $1,400. Notice that this increases the reserve amount by $1,000. Andy saves the change. The transaction created for the reserve change displays at the bottom of the financials transactions screen. Notice the status is pending approval. Even though the transaction amount was only $1,000, it will increase the claim total reserves over the limit of $15,000. Andy returns to the financials. Andy returns to the financials summary screen to see the impact of the reserve transaction. Notice that the net total incurred for the claim is still $18,400, because although Andy created a reserve change transaction, it is not yet approved, so it is not reflected in the total. Andy logs out of ClaimCenter. This section of the demo shows what happens when a user has no authority limit for a transaction, and also what happens when additional restrictions are added to a limit. The system administrator logs back into ClaimCenter to modify an existing authority limit profile. She navigates to the administration screens, and then to the user's search screen to search for Andy Applegate. She enters the first few characters of Andy's user name and clicks the search button. She opens the user contact record for Andy Applegate from the search results. She navigates to Andy's authority limits. She puts the screen in edit mode to modify his authority limit profile. Andy currently has the adjuster authority limit profile. The system administrator selects custom from the list of available profiles to create a custom profile for Andy. Notice that the custom profile has automatically picked up the limits from the adjuster profile previously assigned to Andy. Now these limits can be changed, and they will only apply to Andy. The system administrator selects the two payment related limits in the profile. And removes them from the profile. She modifies the remaining limit for ClaimTotal reserves by adding a policy type restriction to the limit. Now the limit only applies if the claim is associated with a business owner's policy. Finally, she saves the changes to create Andy's custom authority limit profile. Now the system administrator logs out of Claim Center. Andy Applegate logs back into Claim Center to test the authority limit changes. He locates the Ray Newton claim in his desktop claims view and opens it. From the claim summary screen, he navigates to the financial summary screen to review the claims reserves. Andy will increase the claim cost reserves for the first party vehicle exposure. He locates the reserve line and clicks on the menu button. He chooses Edit Reserve from the menu. He changes the amount for the new available reserves to $1,401. As soon as Andy navigates out of the new available reserves field, Claim Center calculates the amount of the reserve change and displays it in the change field. He saves the change to create a new reserve transaction. Notice the error message at the top of the screen. Andy does not have the authority to submit this reserve transaction for approval. When he modified the reserve line in the first part of the demo, the reserve authority limit was not restricted by policy type. Now that this restriction has been added, Claim Center simply does not allow him to create the transaction on a claim that has a policy type other than business owners. He cancels the reserve change. He returns to the financial summary screen. Andy will attempt to create a check. He locates the auto body reserve line for the first party vehicle exposure and clicks the menu button. Notice that the reserve line menu includes no check creation options. Andy tries another approach. From the actions menu, he looks at the new transaction options. Again, there is no check option, because Andy has no payment related authority limits. Andy logs out of Claim Center. Now the system administrator logs back into Claim Center to change Andy Applegate's authority limit profile again. She navigates to the administration screens. She clicks on the Users and Security menu link in the left pane. She enters the first few characters of Andy Applegate's username and searches for his user contact record. She opens the user contact record from the search results. She navigates to Andy's authority limits. Puts the screen in edit mode. And changes Andy's authority limit profile from custom back to adjuster. She verifies that the limits are correct, and saves the change. The system administrator logs out of Claim Center. This is the end of the authority limits demonstration. This is the end of the authority limits demonstration.\n\n--- IS_Claim_11_02 ---\nIn this demonstration, a group supervisor approves a transaction and reviews the claim financials to see the impact of the approval on the claim total reserves. Claims adjuster Andy Applegate logs into ClaimCenter. In the desktop claims view, he locates the Ray Newton claim and opens it. He goes to the financials summary screen. Notice that the total incurred is $18,400. Now Andy navigates to the financials. Now Andy navigates to the financials transactions screen. He notes that the last reserve transaction is for $1,000, and is pending approval. Andy opens the reserve transaction to see more details. The reserve details show that there is currently $400 left in open reserves for the first exposure for claim cost, auto body. This reserve transaction is for $1,000. And is pending approval. Andy logs out of claim center. Andy logs out of claim center. Sue Smith is Andy Applegate's supervisor. Now Sue logs into claim center to review and approve the reserve transaction. When Sue Smith logs in, her default view is desktop activities, showing her activities for today. Notice there are several activities that need her attention. The first activity in the list is the review and approve reserve change activity for the Ray Newton claim. Sue opens the activity. The approval activity opens in a worksheet view in the lower part of the screen. The first section of the activity provides an approval history. Sue is the first supervisor to approve the transaction, so this list currently has only one line. If an approval activity is approved is approved, a new activity is approved, a new activity is approved, a new activity is approved, a new activity is approved, and another line is added to the approval history. This process continues until a user with sufficient authority approves the activity. The next section of the activity provides relevant information about the reserve, such as the amount of the transaction and the current open reserves for the exposure. The cost type and cost category are also included. This information helps the approver review the transaction. The toolbar buttons allow Sue to approve, reject, view the full reserve request, or edit all the reserves for the claim. In this case, Sue is aware of the additional potential costs and approves the request. When Sue approves the transaction, the updated work plan shows the open activities for the Ray Newton claim. The reserve request is now complete so it isn't in the list. Sue can verify that the activity was completed by changing the work plan filter to show all activities. The list of all activities includes the review and approve reserve change activity, and shows that it was completed by Sue Smith. Next, Sue looks at the financial summary screen again. Notice that the total incurred for the claim is now $19,400, which includes the newly approved reserve increase of $1,000. Notice also that the reserve change was to the first party vehicle for claim cost against the auto body category. Sue Smith logs out of claim center. This ends the demonstration on approving transaction.                    the                          the                           \n\n--- IS_Claim_12_01 ---\nThis demonstration shows how ClaimCenter constrains payments using financial holds based on maturity level, unverified policy, and coverage in question. In the first scenario of the demonstration, claims adjuster Andy Applegate will attempt to issue a payment for an exposure that has not reached the ability to pay validation level. Andy logs into ClaimCenter. In the Desk Claims screen, Andy locates the ClaimCenter. ClaimCenter. He opens it. He navigates to the Financials Summary screen to examine the Claim Financials. Notice that the net total incurred for the claim is $19,500. Andy needs to issue a payment against the third-party bodily injury exposure for ClaimCenter. He locates the medical reserve line under the exposure and clicks the menu button. He selects Create Check from the Options menu. An error is raised because the bodily injury exposure is not at validation level ability to pay. The specific validation errors display in the validation results worksheet in the lower half of the screen. Andy doesn't know enough about the exposure to correct the error, so he clears the validation results and moves on. The next part of the demonstration shows what happens when a policy becomes unverified, and how that impacts payments. The policy is changed in ClaimCenter to update a limit. Andy starts by going to his desktop view. He navigates to his claims. He locates the Robert Farley claim in the list and opens it. To force the policy into an unverified state, he needs to change something on the policy. First, he navigates to the policy. Notice that the policy is in force from May 9, 2018, until May 8, 2019. Also notice that the verified policy field is set to yes, indicating that the claims policy snapshot was retrieved from the policy system of record when the claim was created. Andy navigates to the policy's vehicle information. He wants to change the incident limit on the vehicle, so he puts the screen in edit mode. Note that as soon as he attempts to edit the policy, ClaimCenter displays a warning message that the policy will be marked unverified. He clicks OK to continue the edit. And he locates the incident limit for the collision coverage in the coverages section of the screen. And changes the limit to $30,000. He saves the change. And returns to the policy general screen. When Andy edited the policy, it was flagged as unverified. Notice that the verified policy field is now set to no. Next Andy navigates to the financials summary screen to create a check. He locates the auto body reserve line for the first party vehicle collision exposure for claimant Robert Farley, and clicks on the menu button. He selects the menu option Create Check. The first step of the check wizard displays. And he accepts this information and continues to the payment step. On the payment information step, the exposure and reserve line are also set automatically from the financial summary. Andy enters the payment amount in the existing line item. He keeps the default values for the payment type and eroding fields. Notice that after the payment amount is entered, the exposure line is updated with additional information. And he continues to the final check wizard step. There are no special instructions, so he clicks the finish button to create the check. An unverified policy validation error is generated, blocking creation of the check. Andy cancels the check wizard. And clicks OK on the warning message to exit and cancel the changes. He navigates back to the policy screen. Recall that the policy is unverified because it was edited. This results in a financial hold, preventing payments from being made. Andy refreshes the policy to replace the edited version with a fresh copy from the policy system. On the policy comparison screen, the current policy column shows the changes made to the policy, and the new policy column shows the original policy as it was retrieved from the policy system. Andy expands the nodes for the policy's vehicle information, and he can see the difference in the collision incident limit and the verified status of the current and new policy. He clicks the finish button to complete the refresh. Now the policy is verified again. In the final scenario, we will continue with the Robert Farley claim and observe how a coverage in question condition can be caused by changing the claims date of loss to a date outside of the effective dates for the policy. Note again that the policy is in effect from May 9, 2018, until May 8, 2019. Andy navigates to the loss details screen. Now he will change the loss date of the claim to be outside of the effective dates of the policy. He puts the loss details screen in edit mode. He enters a loss date that is before the policy's effective date. And clicks the update button. A warning message displays at the top of the screen indicating that the policy will become unverified as a result of the change. And he clicks the update button again to complete the date change. Notice the new icon in the claim information bar. This indicates that coverage is in question for the claim. Next, Andy will look at the claim's status information by clicking the summary menu link. And then the status link. Notice that coverage in question is set on the claim, and that the reason is that the loss date is before the policy effective date. Andy puts the screen in edit mode to turn the coverage in question indicator off. The coverage in question field is not editable, because Andy does not have the permission necessary to change the value. He cancels the edit. He returns to the loss details screen to set the loss date back within the policy effective dates. He puts the screen into edit mode. And changes the loss date to fall within the policy effective dates. He saves the change. Notice that the coverage in question icon still displays in the claim information bar. He navigates to the claim status screen again to check the coverage in question value. Notice that the coverage in question status indicator is still in place. He returns to the loss details screen. And logs out of claim center. Andy's supervisor is Sue Smith. She logs in to remove the coverage in question flag from the claim. Sue's default view is the desktop activities screen. To search for the Robert Farley claim, she clicks on the menu button of the search tab. And selects first claims, and then simple search from the menu. She types the first few letters of the insured's last name into the search criteria, and clicks the search button. The Robert Farley claim is returned in the search results, and she opens it. She navigates to the claim status screen. And after confirming the coverage in question setting on the claim, puts the screen in edit mode. She sets the value of the coverage in question flag to no. And saves the change. Notice that after updating the claim, the coverage in question icon is no longer displayed in the claim information bar, and the coverage in question indicator has been reset. Sue logs out of claim center. This is the end of the financial holds demonstration. So, you know, the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of winner of winner of winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner trade.\n\n--- IS_Claim_13_01 ---\nThis demonstration on managing contacts shows how to add contacts to a claim. Examples include adding both person and vendor contacts, which can be local or shared. The process of transferring roles from one contact to another is also covered. Claims Adjuster Andy Applegate logs into ClaimCenter. He locates the Andrew Williams claim in his desktop claims list and opens it. Claims Adjuster Andy has learned that there was a passenger in the vehicle involved in the collision, and he needs to add them to the claim. He navigates to the parties involved screen. Claims Adjuster The passenger is Kayla Marie. The only information he has about her right now is her phone number. To add the passenger to the claim, he clicks on the new contact menu button. Claims Adjuster And selects Person from the options list. He enters her name and mobile phone number into the new person screen. Claims Adjuster In order to save this contact, he must give it at least one role. Claims Adjuster When the new row displays, the related to field defaults to the claim. Claims Adjuster Andy will add the passenger role first, which should be related to the vehicle incident. Claims Adjuster He clicks the related to drop down. Claims Adjuster And selects the vehicle incident from the list. Claims Adjuster Next, he selects passenger from the roles list. Claims Adjuster He adds an additional row to the list view for the second role. Claims Adjuster He selects witness from the roles list, and keeps the default value for the related to field, which is the claim. Claims Adjuster He saves the new contact. Claims Adjuster Andy also found out that Mr. Williams requested that an alternate contact be added to the claim. Claims Adjuster To add another new contact, he clicks the new, contact menu button and selects person from the options list. Claims Adjuster Andy also has only a name and mobile phone number for the alternate contact, and he enters this information into the new person screen. Claims Adjuster He adds a role to the new contact. Claims Adjuster Selecting alternate contact from the list. Claims Adjuster He saves the new alternate contact. Claims Adjuster Mr. Williams also told Andy that he has chosen a vendor to repair his truck. Claims Adjuster Vendors are considered shared contacts because the same vendor can be used on multiple claims. Claims Shared contacts are stored in Contact Manager. Claims Adjuster Andy goes to the address book search screen to locate the auto repair vendor. Claims Adjuster Mr. Williams is going to use Mynake Car Care Center for the repairs to his truck. Claims Adjuster They are located in San Jose, California. Claims Adjuster Andy enters values for the name and city for the search. Claims Adjuster He clicks the search button to find the vendor. Claims Adjuster He selects the record in the search results to add it to the claim. Claims Adjuster The vendor's information displays in the new repair shop screen. Claims Adjuster Andy needs to add a role to the vendor in order to add it to the claim. Claims Adjuster Since the vendor will be repairing the truck, he selects the vehicle incident for the related to field. Claims Adjuster He also selects the role of repair shop. Claims Adjuster He adds a second role because this vendor will provide services for the claim. Claims Adjuster He selects Service vendor from the roles list. Claims Adjuster This role is associated with the claim, so he keeps the default related to value for the role. Claims Adjuster And he saves the new vendor contact. Claims Adjuster Notice that the claim now has 4 claim contacts, 3 persons and 1 vendor. Claims Adjuster Selecting a contact in the list highlights the contact row, and the details for the selected contact display below the list. Claims Adjuster Andy clicks on the row for Alyssa Grace to display her contact details. Claims Adjuster Notice the contact link status message that displays above Alyssa Grace's contact details. Claims Adjuster The fact that this contact is not linked to the address book indicates that it is a local contact, known only to this claim. Claims Adjuster Next, Andy selects another person contact, Cala Marie. Claims Adjuster Notice that this contact is also a local contact and is not linked to the address book. Claims Adjuster The last person contact, Andrew Williams, is also a local contact. Claims Adjuster Finally, Andy selects the vendor contact, Meineke Car Care Center. Claims Adjuster Notice that the link status for this contact indicates it is linked to the address book and is in sync. Claims Adjuster This means that the contact is a shared contact maintained in Contact Manager, also known as the address book. Claims Adjuster When linked contacts are in sync, Claims Adjuster The information in Claims Center matches the information in Contact Manager. Claims Adjuster Andy talks to Mr. Williams again. Claims Adjuster He has now decided that the alternate contact for the claim should be Kayla instead of Alyssa. Claims Adjuster He clicks Kayla Marie in the list of contacts. Claims Adjuster From Kayla's contact record, Andy initiates the transfer of the alternate contact role. Claims Adjuster The transfer role screen displays. Claims Adjuster The existing roles for contact Kayla Marie are listed at the top, followed by a list of other claim contacts and their roles. Claims Adjuster First, Andy selects the Alyssa Grace contact to transfer the role of alternate contact from Alyssa Grace to Kayla Marie. Claims Adjuster Then he clicks the select button. Claims Adjuster Notice that after the Alyssa Grace contact is selected, a message displays stating that she will no longer have any roles on the claim, and a second message identifies the roles Kayla Marie will have after the transfer. Claims Adjuster After reviewing the messages, Andy proceeds with the role transfer. Claims Center displays a final warning message. Kayla Marie will now also have the alternate, contact, role, and Alyssa Grace will no longer be a claim, contact because she will have no roles on the claim. Andy accepts the message to complete the transfer. The role transfer is completed, and Alyssa Grace has been removed from the claim because she has no roles. Kayla Marie now has the alternate, contact, role. Andy logs out of Claims Center. This is the end of a demonstration on managing claim, contact. D-YEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYEYE \n\n--- IS_Claim_14_01 ---\nRoles and permissions help control what a user can and cannot do on a claim. In most cases, users are assigned roles, like customer service representative, adjuster, supervisor, and others which contain permissions specific to their jobs. Users may be assigned multiple roles which help keep specific permissions from being assigned to a wide group of users. For example, any adjuster can add activities or documents to closed claims. If the insurer decides to be a restrict those permissions, an administrator can assign them to a single role. Andy Applegate logs into ClaimCenter. Andy is going to work on the Bill Kinman claim, so he starts with a search. He enters Kinman as the last name and clicks search. Bill Kinman is a claimant on three claims. The first claim in the list is the only one where the claim is closed and he is the sole claimant. This is the claim Andy is looking for. There is an icon at the top of the screen and a status in the summary that shows the claim is closed. Now that he has the claim, Andy adds an activity as a reminder to send a letter to the claimant. On the new activity screen, he makes sure that the reminder activity is assigned to himself. The default values for the other details of the activity are fine, so he clicks update. Andy has also received a document confirming the claimant. The client has accepted the claim payments, so he adds the document to the claim. Andy enters the name of the document. He sets the status of the document to approved. And the document type to letter received. He reviews the fields for completeness. And clicks update to save the document reference. He opens the document screen. And sees the customer acceptance letter he just added to the claim. Since he is finished with this claim for now, he logs out of claim center. The administrator. Succeed Insurance has decided that there are too many adjusters who are adding activities and documents to claims that are closed. To address this problem, Succeed has asked the system administrator to remove that ability from all adjusters with the exception of Andy Applegate. The administrator. The administrator. Logs into claim center. The administrator goes to the administration section of claim center. And clicks users and security. The administrator is going to use roles to solve the issue of too many users creating activities and documents on closed claims. She starts by opening the adjuster role. The adjuster role includes the permissions create activities on closed claim. And create documents on closed claim. The administrator clicks edit to make changes to the permissions on the adjuster role. She selects create activities on closed claim. And create documents on closed claim. The administrator clicks remove. To remove the selected permissions from the role. She clicks update to save the changes. With those two permissions gone. Adjusters will no longer be allowed to create activities or documents on closed claims. The administrator logs out of claim center. To demonstrate the effect of the changes to the adjuster role. Andy Applegate logs into claim center. As before. He selects the bill Kinman claim. Remember the Kinman claim is closed. Andy selects the actions menu and sees that there are no activity or document options. This is because his role. Adjuster. No longer contains those permissions. Andy logs out of claim center. Remember that succeed insurance wants only Andy to be able to add documents and activities to closed claims. During the previous steps. The administrator removed those permissions from all adjusters. Now. She needs to somehow grant those permissions to Andy. The claim center administrator logs back in. She starts with the administration tab. And then. Users and security. The administrator is going to use roles to grant those closed claim permissions to Andy. She is going to add a role created specifically for creating activities and documents on closed claims. On the roles screen. She clicks add role. The administrator names the role. Closed claims. And then describes the purpose of the role. The next step is to choose which permissions will be assigned to this role. The first permission the administrator adds is. Create activities on closed claim. She adds the second permission. The second permission for this role is create documents on closed claim. The new role is named closed claims. It has two permissions assigned. Create activities on closed claim. And create documents on closed claim. The administrator clicks update to save the new closed claims role. The administrator verifies that the role closed claims is now included in the list of roles. Next. She needs to assign the closed claims role to Andy. The administrator searches for Andy by entering the first few letters of his user name and clicking search. She then clicks Andy Applegate in the search results. Because she is going to make changes to the roles Andy has. The administrator clicks edit. Currently Andy has two roles. Trusted for sensitive claims. And adjuster. The administrator clicks add to add the new role. She selects the new role. Closed claims. From the list. Andy now has three roles assigned. Trusted for sensitive claims. Adjuster. And closed claims. He inherits all the permissions from each of these three roles. The administrator clicks update to save the changes. And logs out of claim center. To verify that he has permission to create activities and documents on claims that are closed. Andy logs back into claim center. He opens the Bill Kinman claim. Which is closed. He clicks the actions menu. And sees that even on this closed claim. He can now create both activities and documents. Andy logs out of claim center. This is the end of the managing roles and permissions demonstration.\n\n--- IS_Claim_14_02 ---\nAccess control lists are used to control access at the object level. For example, a user may have all claims access permissions, but they won't have access to claims that are outside of their security zone. This demonstration shows that for a given claim, users in different groups and security zones have different access to the claim. The ClaimCenter administrator logs into ClaimCenter. First, she navigates to the administration screens. And then to use a claim. List, users in security, users in security. The administrator wants to examine some groups to see the list of users in the groups, and which security zones each of the groups belong to. She searches for all groups with auto1 in the group name. There are three groups with auto1 in the group name, Team, A, Team, B, and Team, C. The administrator opens Team A. The auto1 Team A group is of type, auto, and is in the auto and property security zone. Two of the users in this group are Andy Applegate and Betty Baker. The administrator clicks the Groups menu link to perform another search. She is looking for groups with Western as part of the group name. She opens the Western Call Center group. The Western Call Center group is a new claim processing type group, and is also in the Auto and Property Security zone. Not only is Stacey Bain one of the users in this group, she is also the supervisor of the group. The administrator now knows that Andy and Betty are in Auto Team A, which is in the Auto and Property Security zone. Stacey Bain is in the Western Call Center, a different group, but that group is also in the Auto and Property Security zone. She logs out of Claim Center. In this part of the demonstration, Betty Baker checks to see if she can edit the rain new claim. Betty logs into Claim Center. And opens the search screen. She searches for any claim with the last name of Newton. The search returns three claims. Betty opens the second claim. Notice the adjuster assigned is Andy Applegate. She opens the status screen. Andy Applegate is the owner, or primary adjuster, on this claim. Betty can see and edit the claim. Notice the edit button, even though she does not own it. That is because the claim is using the default access profile, which allows anyone in the same group or security zone to edit the claim. Betty logs out of Claim Center. Stacey Bain is going to verify that she also has edit privileges on the Ray Newton claim. Remember that Stacey is not in Andy's group, but is in the same security zone. Stacey logs into Claim Center. Since the Ray Newton claim is not owned by Stacey, and she had not recently opened the claim, it is not in her claims list. She opens the search screen to find the claim. She searches for claims with the last name of Newton. Stacey opens the same Ray Newton claim that Betty opened earlier. And goes straight to the status screen. Not only can Stacey edit the claim, but she can also remove the flag. She can edit the claim because even though she is not in the same group as Andy, she is in the same security zone. Since she is a supervisor, she can also remove the flag. Stacey logs out of Claim Center. Andy Applegate logs back in. And selects the same Ray Newton claim. Then he opens the status screen. And edits the claim. Special claim permission is not set, which implies that the default access profile is in use. Remember that the default access profile allows any user in the owners group, or any user in the same security zone, to edit the claim. Andy changes the special claim permission to employee claim. This access profile grants view and edit access to only those users in the same group as the claim owner. In this case, Betty is in the same group as Andy, but Stacey is not. After setting the special claim permission to employee claim, Andy clicks Update to save the changes. By making this claim an employee claim, Andy has restricted access to only those users who are in his group. He logs out of Claim Center. Betty Baker now logs back into Claim Center. Since she is in Andy's group, she expects to still be able to see and edit the Ray Newton claim. Since she has recently viewed the Ray Newton claim, it is in her Claim drop-down list. She opens the status screen. Betty sees that the claim is now set to an employee claim, and that she still has edit permissions, even though she does not, own the claim. She has access because she is in the same group as Andy and the employee access profile specifies that anyone in the same group is granted those privileges. Betty logs out of Claim Center. Stacey logs back into Claim Center. Remember that Stacey is in the same security zone as Andy, but is not in the same group. Like Betty, Stacey recently accessed the Ray Newton claim, so it is in her claim drop-down list. Even though the claim was in her claims list, she no longer has access since the special claim permission was set to employee claim. The employee claim access profile only grants access to users in the same group as the owner. Betty starts a search to look for the claim another way. She enters Newton as the last name for the search. The search returns two claims where Ray Newton is a claimant. The claim that ends in 870, is not on the list because Stacey does not have access permissions for that claim. She resets the claim search. This time, she searches for the claim using the claim number. Even using the claim number, the search returns no claims that match. Although the claim does exist, she does not have any permissions on the claim. Not only can she not edit it, she cannot even view the claim. Stacey logs out of Claim Center. This is the end of the access control lists demonstration. Stacey logs out of Claimountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountount \n\n--- IS_Claim_15_01 ---\nWelcome to the demonstration of subrogation. In this demonstration, Succeed Insurance receives and processes information that suggests subrogation is appropriate for the Bob Tyre slash Lennar construction claim. Gerald Ikes logs into ClaimCenter. He has learned that Lennar suspects that the accident was caused by a failure of the ladder that Mr. Tyre was using. They have made that conclusion based on eyewitness accounts, and after talking with Mr. Tyre, Gerald navigates to the claim. And to its lost details screen. Because the cause of injury on the claim was fall, slip, or trip injury, ClaimCenter placed the claim in subrogation review status. This doesn't mean it is subject to subrogation, but it does mean there is a likelihood that it could be. Gerald opens the subrogation screen. Gerald is an adjuster, and as such, in the base application, cannot own a subrogation. But he can add a note that explains why this claim may be a candidate for subrogation. He adds a note explaining that ladder failure might be the cause of Mr. Tyre's fall. Returning to the general card. Gerald refers the claim to subrogation. He adds a note to the subrogation specialist. He adds a note to the claim to the claim. Informing them that, based on information received from Lennar Construction. This claim is a candidate for subrogation. Then he clicks Update to refer the claim for subrogation. The subrogation has been assigned by default to Gerald, so he clicks Assign. The base configuration of ClaimCenter has no defined subrogation team. So Gerald assigns the subrogation to Warren Motley. Warren is Gerald's supervisor and, for purposes of this demo, the subrogation specialist. Clicking Assign completes the assignment process. Gerald knows that Succeed Insurance notifies third parties of subrogation interest. So he creates a reminder activity to send them a letter. Gerald does not yet have the document ready to send or to attach to the activity, so he creates the activity with the default values. Now that the subrogation has been assigned. And the reminder activity has been created. We can take a look at what the subrogation specialist sees. Warren Motley enters his username and password. And logs into ClaimCenter. On his desktop, Warren sees that a claim for subrogation has been assigned to him. Noting that the subrogation status is in review, he navigates to the claim. Warren reads the note from the adjuster, and agrees that this claim should be subject to subrogation. In a normal sequence of events, the subrogation specialist will investigate and decide whether or not to pursue the subrogation. This propcus could be short, or could take a long time. For this demonstration, we will suppose that some time has passed before Warren begins recording the subrogation information. The first that he does is set the fault status. It is succeeds position that A&C latter company bears the responsibility for the accident. The subrogation is no longer in review. So Warren sets the subrogation status to open. Next, Warren adds the other party who is at fault. A&C is a new company, in the sense that it is not present in the contact manager address book. So Warren will add them to the claim as related to this claim only. Warren records the name of the latter company. As well as its street address. Warren only needs to type the first part of the city name. Warren clicks OK to save the new party. And clicks Update to save the subrogation data. And clicks Responsible Parties. And, on the Responsible Parties screen, selects the Financials card. Here he sees that the amount Succeed expects to recover from A&C latter is $2,906.25. Again, some time passes, and Succeed negotiates with A&C latter. From the Actions menu. Warren selects New Transaction, Other, Recovery. A recovery of $1,050 has been agreed upon, and A&C has issued a payment. Warren records the payment. The payer is A&C latter company. Any transaction must be recorded against a reserve line. Which is Medical Details, Claim Costs Slash Medical. There are several kinds of recovery transaction. From the list, Warren selects Subrogation. Finally, Warren enters the amount of the transaction, $1,050. When he clicks Update. He sees that the recovery transaction was created in the amount of $1,050. This concludes the demonstration of subrogation. So, you know, the plan of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of the transaction of \n\n--- IS_Claim_15_02 ---\nWelcome to the demonstration of litigation in ClaimCenter for workers compensation. In this demonstration we will create a new legal matter and add a planned activity to it. We begin by navigating to the litigation screen. On this screen, we will create a new legal matter. We enter a brief but descriptive name for the legal issue. Next, we enter details about the plaintiff. This is a new person to the claim file. We enter the plaintiff's first name, Lin. And her last name, Chang. Ms. Jang's home phone number is 213-555-8392. Next, we enter Ms. Chynig's relationship to the deceased worker. The related contacts list is empty. We will add one. The relationship is with Terry Chiang, Ms. Jang's spouse. Since Terry Chiang obviously cannot act as a primary contact, Ms. Chiang will act as the primary contact for Terry. This finishes the addition of Lin Chiang to the new legal matter. The defendant in this matter will be Georgetown Roofing. We also enter the case or docket number. We also enter the case or docket number, in this case IMCA underscore docket underscore 2022 underscore 72. Next, we enter Ms. Jang's legal representative. She is being legally represented by an attorney named Kevin Graff. We will also enter Mr. Graff's legal license number. Mr. Graff specializes in workers' compensation law. And, we click Update to save the information about this attorney. The court in which the suit has been filed is the California State Court for Imperial County. The case is assigned to a courtroom and judge specializing in workers' compensation cases. The case was served on Georgetown Roofing without prior notice or demand for compensation. Kevin Graff is a junior partner in the venerable and respected law firm of Graff, SPI, and Sons. Their corporate offices are on Lethe Avenue. In the fashionable Armstrong district of the city of Imperial. This is, of course, a business address. The firm specializes in labor law, including workers' compensation cases. Our primary point of contact with the firm will be Mr. Graff. This is all the information we need about the firm, so we click Update to save, and return to the legal matter at hand. We are logged in as Candice Payne, so we select her as the owner of the matter. We are done with the basic creation of the Terry Cheung Ronfield death matter, so we click Update to save our work and return to the matters list. We have made arrangements with Georgetown Roofing to interview the workers who were witnesses to Terry Jang's fall in early March. We turn to the calendar view. Here we have a view of the scheduled activities for this month. There are none. We also have the option of viewing all activities associated with the matter, not only our own. The appointment is in early March, so we click the right arrow to advance the calendar one month. No activities are displayed for the first week of March. This is because the activity has not yet been created and assigned. To create the activity, we use the Actions menu. The activity type is interview, and the subtype is get a statement from witness. We enter a description of the purpose of the interview. Of course, we associate the activity with the matter at hand. The due date currently shows February 10th. We must change that, so we click the Calendar Picker button. The interview is on March 1st, so we advance the calendar to March. And double-click the date. This activity should be of high calendar importance. Jennifer Albee, the corporate counsel for Georgetown Roofing, will be the external owner for this activity. As with the matter, we will assign the activity to Candice Payne. We always save our work. This takes us to the work plan for the claim, where we see the activity we just created. Now we return to the Litigation screen. On the Matter screen we click My Calendar. Here, we see that the Get a Statement from Witness activity appears on the calendar for March 1st. If we click the item, the Detail pane for the activity is displayed. This concludes the demonstration of how Claims Center records legal matters.\n\n--- IS_Claim_16_01 ---\nJurisdictional benefit parameters demonstration. In this demonstration we will review what benefit parameters are available and where they can be found. Workers compensation claims are partially controlled by parameters that are defined in ClaimCenter. To view and work with these parameters requires administrative privileges not granted to most workers. Let's log in as the system administrator and navigate to the administration tab. Expanding business settings. And WC parameters. We see that there are four menu links on the workers comp parameters menu, benefit parameters, PPD min and max, PPD weeks, and, cop mensibility parameters. Benefit parameters are based on jurisdiction. Each jurisdictional parameter has a jurisdiction and a start and end date. The combination of those values restricts the claims that are affected by the parameter. In the base application, there is sample data provided for several jurisdictions. For California, there are six parameters ranging in dates from 2013 to 2018. Each of the parameters may have differing values that will be applied to claims that fall within the start and end date periods. Looking at California for 2013. We see that the minimum weekly payment for total temporary disability, TTD, is $126. While the maximum is $728. While the maximum is $728. Using this as a basis for comparison. We can navigate to the next page of benefit parameters. And look at the benefits for 2018, the most recent year available in this sample database. The minimum weekly payment for TTD is now $143.70. While the maximum weekly benefit for TTD is $958.01. The start and end dates give a jurisdiction the ability to modify parameters over time. While keeping the original parameters and applying them based on the lost date. Now, to see these parameters at work. We will again assume the persona of Gerald Ikes. And log into Claim Center. We navigate to the Lenar Construction, Bob Tyre Claim. We will look at the indemnity exposure. To see what benefits, if any, have been applied. We see that the max and main comp rates match those we saw on the benefit parameter for California in 2018, the most recent period available. Notice also that the TTD weekly comp rate shows that it cannot be calculated. This is because there is no wage set for Mr. Tyre. On the lost details summary page. We set the average weekly wage to $1,000. After saving the new wage. We return to the indemnity exposure. And look to see what, if anything, has changed on the benefits card. The weekly comp rate is $666.67. That is 67% of the average weekly wage or AWW before injury. Now let's return to the lost details general screen. This time we will set the AWW to $2,000. This is more than twice the max rate of $958.01. This represents 45% of the $2,000 AWW. Which is less than the 67% of wages standard rate. And this is the case. As expected, the maximum stake comp rate overrides the percent of wages. Let's try one more AWW to finish verifying that the benefit parameters work as expected. This time we'll set the AWW to 100. This is less than the minimum weekly benefit of $143.70. So our expectation is that the weekly benefit. Will be set to the minimum amount. Even though that represents 144% of the pre-injury wage. We see that, as expected, the minimum comp rate also overrides the percent of wages. Now we have thoroughly investigated the implication is of this one benefit parameter. Our work as Gerald Ikes is through. But there are other parameters available besides the amounts and dates. So we will log back in as the system administrator. Navigate to the benefit parameters as before. Now let's look at the benefit parameters for Florida. Florida has several other jurisdictional factors. For example, there are special rules that apply to injured workers 70 and over. There is also an override formula for temporary partial disability. This concludes the demonstration of jurisdictional benefit parameters. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy \n\n--- IS_Claim_16_02 ---\nWelcome to the demonstration of compensability parameters, ICD codes, and user settings. This account has been set to open to the administration page. This account has been set to open to the administration page. So we navigate to business settings. Then expand WC parameters. And open the compensability parameters screen. Let's have a look at the compensability parameters screen for Florida. First, notice the effective date and the expiration date. Any loss that occurs within that range will be processed using these parameters. If benefit payment implies acceptance is set to yes, then when a payment is made, ClaimCenter displays a validation error that says that making a payment before compensability is determined implies acceptance. If it is set to no, then ClaimCenter asks you to confirm the transaction. There are three denial period formulas, X days after loss date, X days after notification date, and the greater of the two. This sets the number of days the insurer must approve or deny the claim. Depending on which you choose, you must set the target number of days and the days to include, business days or calendar days. Now, let's look at the ICD code screen. Open the body system picker. Here you can search for ICD codes related to a specific systemic cause. Let's look at external causes of morbidity. When we click search. This screen appears, showing all codes associated with external causes of damage. These codes can be very specific. Here, for example, is a code representing being hit by a roller skater while walking. If we click it. A page is displayed showing the details stored in ClaimCenter, including translations. Here, if we click the code number again. A pop-up window appears, showing the search results for this code on the ICD-10 data page. We can click the label. We see this page, showing the full details of the code, its meaning, and its history. We can see that this code was introduced to ICD-10 in 2016, and that the code is used to describe the circumstances that caused an injury, and not the injury itself. Let's close this pop-up and return to ClaimCenter. Enter the main ICD code reference page. Let's search for a different kind of code. This category is related to the one we were just looking at. Where that one described causes of injury, this describes the specific injury itself. We'll search for a specific family of codes, S00. When we execute this search. The results show a large number of very specific possible head injuries that can arise from external causes. Let's examine the most general, superficial injury of head. As an administrator, we can edit the details. As you see, several details cannot be edited, but the code number, description, and body system may be changed. Probably the most useful feature of this edit page, however, is the ability to add translations of the description into some of the most commonly used languages. Editing ICD codes can have unexpected results on existing claims, and should only be done by an expert. So we will cancel out of the edit page. Returning now to the main code reference screen. We can add new codes to the database. Here you can add all the details that were editable on the edit code screen. We have none to add, as this also should be done by an expert. Finally, we will examine the capabilities of user settings. To set the stage, we will need another user. So we will log in as Laura James. Laura is an adjuster with general responsibilities. We will take a look at the claims screen of Laura's desktop page. The claims are not sortable by claimant. When we click the header, nothing happens, and there are no up-down arrowheads present. Now let's change a user setting. To do this, we will log out as Lana James. To change user settings. We log in again as the system administrator. We'll navigate to Lana James' profile once again. Now, we will change a user setting for Lana. Specifically, we will change the loss type she works with from none, which makes her a generalist, to workers compensation. Now, to check the results of the change, we log out as the system administrator. And log back in as Laura James. Once again, we navigate to her desktop claims screen. The column header which previously read claimant now reads injured worker, and it contains up and down sorting arrows. If we click the down arrowhead. The claims are sorted by the name of the injured worker, in reverse alphabetical order. This concludes the demonstration of compensability parameters, ICD codes, and user setting. So, the                 of the                                     of the \n\n--- IS_Claim_17_01 ---\nIn this demonstration, Betty Baker takes a call from Andrew Williams who is reporting an accident. During the call, Betty looks at the coverage details of Andrew Williams's policy. When she creates the claim, she also manually creates some exposures. The exposures help, illustrate the relationship of the line of business model to the user interface and business. Betty logs into ClaimCenter. Andrew Williams is calling in to report an accident and to open a claim. Betty selects Claim, New Claim. She enters the first part of Andrew's last name. And clicks Search. Betty wants to verify a few of the policy details with Andrew before she creates the claim. She clicks the policy number to see the details. She sees that the policy is personal, auto, and that it is in force. She also sees that there are two vehicles covered on the policy. Once she verifies those details with Andrew, she closes the policy details screen. Andrew told her that the accident was today, so she selects today as the law state. With the policy and law state selected, she clicks next to start the claim entry. Betty wants to look at some of the policy details now that she has started entering the claim. She clicks Policy. She clicks Policy Details to see the specific details and coverages. On the Policy Details screen, Betty sees a few more details about the vehicles covered on this policy. She can also drill down to see more details about either of these vehicles. She clicks the link on the first vehicle. This is the vehicle. This is the vehicle, information for the Ford XLT. It shows vehicle data, like make and model, year, VIN number, and license plate and state. At the bottom of the page, it shows the coverages for the vehicle. Notice the deductible, exposure limit and incident limits for each of the coverages. These values come from integration with a policy system. Now that Betty has looked at the vehicle details. Now that Betty has looked at the vehicle details, she returns to the policy. She is done with the policy, so Betty clicks, back, to return to the new claim wizard. Betty selects Andrew as the reporter for the claim. Andrew reported that the accident was in the 2013 XLT, so she selects it as the involved vehicle. When she selects the Ford XLT, details about its specific coverages display, including deductibles and limits for each coverage. For comparison, Betty selects the other vehicle. Notice that the liability bodily injury coverage for the Ford FX4, is $75,000 per incident, with a $300,000 limit. The same coverage for the Ford XLT, is $10,000 per incident, with a $30,000 limit. Also, the Ford FX4, has rental reimbursement coverage, whereas the Ford XLT, does not. The claim is for the Ford XLT, so Betty D selects the Ford FX4. Now that the basic information is complete, she clicks next. Loss cause is restricted by the loss type, such as, auto, or property. This is to make sure that the loss cause makes sense based on the type of loss. In this case, the policy type, personal, auto, is associated with the line of business, personal auto line, which in turn is associated with the auto loss type. Therefore, since the loss type is, auto, the causes are restricted to auto type causes such as collision while turning left, glass breakage, rollover, and so on. It would not make sense for an auto, claim to have a loss cause of burglary or mold. Andrew told her that he hit another vehicle, so she selects collision with motor vehicle as the loss cause. Because he told her that he hit the other vehicle, she also sets the fault rating to ensure it at fault. Betty enters the location of the loss. This is a new location. She clicks next to continue to the next step of the wizard. Betty selects towing, and asks Andrew if he needs that, service. She reminds Andrew, that he does have towing coverage and the limit is $400. Andrew says that he does not need towing, at least for now. The services shown here are not, coverages. These are services that may be arranged for the client during claim intake. However, these services will show no coverage behind the service if there is no coverage for the service on the policy. Notice the difference between the rental, and towing services. The rental service is available, but it does show that this is not covered on the policy. Since he doesn't need any other services, Betty clicks next. The last page of the new claim wizard shows that there is one exposure. This exposure was created by business rules during the new claim wizard. There was a passenger in Andrew's truck who was injured in the accident. This will be an additional exposure. Because the exposure is for bodily injury, Betty clicks New Exposure and selects the Ford XLT, a covered vehicle on the policy. Then she selects the coverage liability, bodily injury and property damage, and finally, the sub-coverage liability, bodily injury. This exposure is for a passenger who was injured in the accident, so Betty adds a new injury incident. The injured person is a new person. The injured person is Kayla Williams, so Betty enters the first and last name. Betty clicks Update, to create the person. She sets the loss party to third party liability. Next, Betty clicks OK to create the injury incident. Next, Betty selects Kayla, as the claimant. Then she sets the claimant type to, occupant of insured's vehicle. Finally, Betty clicks OK to create the exposure. In addition to creating an exposure for a specific coverage on the policy, Betty can also create an exposure by coverage type. These coverages may or may not be on the policy. In this case, Betty selects Uninsured Motorist, Bodily Injury, as the coverage. The new exposure screen is the same regardless of whether or not the coverage is on the policy. This simply allows the user to create exposures regardless of policy coverage. In this case, Betty does not need to create the extra exposure, so she clicks Cancel. The claim now has two exposures, one for the vehicle, and another for bodily injury. Betty clicks Finish to create the claim. Notice that the claim is automatically assigned to the Houston Claims Center and Joe Ramirez. That is because the accident occurred in the 77089 zip code. Betty is done for now, so she logs out of Claims Center. This ends the auto claim and the line of business demonstration.\n\n--- IS_Claim_17_02 ---\nIn this demonstration, Betty Baker takes a call from John Albertson who reports that his home has incurred damage from a hail storm. As usual, Betty logs in to ClaimCenter. Betty takes a call from Mr. Albertson, who is reporting damage to his home from a hail storm. She clicks Claim, New Claim to start the new claim wizard. She enters Albertson, as the last name and clicks search. Although the search results are not in the case, it is not in the case, it is not in the case. When Betty returns two policies, she selects the second policy. This is the policy that has dwelling coverage. Betty wants to verify that she has the correct policy, so she clicks the policy number. She verifies with Mr. Albertson that the covered property is on Maple Avenue, and clicks close to return to the wizard. Mr. Albertson, told Betty that the storm was on January 6, 2019. Notice that the type of claim is property. This was determined automatically by the policy type. Now that she has the policy and law state selected, Betty clicks next to enter the details of the claim. Since Mr. Albertson is calling in with the claim, Betty selects him from the name field drop-down. She clicks next to move to the next step of the new claim wizard. The Add Claim Information screen is used for recording details about the claim, like loss date, location, and so on. Notice that the loss cause list includes causes you would expect for a property loss. These are different from the causes listed for auto claims. This list is restricted by the line of business model. For this claim, the line of business is property. Mr. Albertson reported that the damage was caused by a hail storm. Unlike an auto claim, a property claim includes a section with details about possible property damage. For example, it includes damage types of fire and water. It also includes a section on exactly what property was damaged. Was it the dwelling, or personal property? Since it was the dwelling that was damaged, Betty selects dwelling. Betty enters a description of the damage. She clicks next to continue. The services screen shows a list of services that are appropriate for a property claim. Just like the loss causes, this list is determined from the line of business. It does not include services typical for, auto, claims, like towing or rental. Mr. Albertson says that he does not need any help with services at this time. Betty clicks next to continue to the last step of the wizard. A customer service representative would not necessarily create exposures now. However, to demonstrate the relationship between policy type and valid coverages, Betty creates an exposure. Notice that under the Maple Avenue property, she can select dwelling, or earthquake coverage. That's because both of those coverages are on Mr. Albertson's policy. Betty selects coverage, a dwelling. She sets the claimant to John Albertson. She clicks OK to create the exposure. Now that the claim details are complete and the exposure is created, she clicks Finish to create and assign the claim. The claim is created and is assigned to the property team B group. Betty logs out of claim center. This ends the property claim and line of business demonstration.        She holds theount of claim center.               \n\n--- IS_Claim_18_01 ---\nContact Manager is the system of record for vendors. ClaimCenter allows users to create vendors, but they are stored in, and linked to, Contact Manager. Vendors created or modified from ClaimCenter require approval from Contact Manager. Andy Applegate logs into ClaimCenter. He is working on the Andrew Williams claim. Andy learns that the vendor that he chose for the claim, Meineke Car Care Center, is not able to take Mr. Williams' call. He goes to the car. He goes to parties involved. Since he is not going to use Meineke, he selects it. And clicks Delete. This simply removes the vendor from a relationship to this claim, it does not delete the vendor from the system of record, Contact Manager. Andy found a vendor that can repair Mr. Williams' car, but the vendor is not in the system. Since Andy thinks this vendor may be able to do the work and that it could prove useful later, he creates the vendor that can repair Mr. Williams' car, but the vendor is not in the system. Since Andy thinks this vendor may be able to do the work and that it could prove useful later, it's the vendor. The name of the vendor is Bill's Quick Auto Repair. The shop is located on Beamer Road in San Mateo, California. He has heard that the shop is not easy to find, so he adds that note to the vendor record. Like any parties involved, vendors need at least one rule to be related to a claim. Bill's Quick Auto Repair is going to be the repair shop for Mr. Williams' car, so he selects the Ford and sets the rule to repair shop. He also wants to set Bill's Quick Auto Repair as a service vendor for the claim. So he accepts the default related to, which is the claim, and selects service vendor as the role. He clicks Update to save the new vendor. The update adds the vendor to Claim Center and Contact Manager, as indicated by the linked message. However, although it is in sync, the contact is pending approval. Vendors created in Claim Center have a pending status until approved in Contact Manager. Carla Clark is the vendor manager for Succeed Insurance. She logs into Contact Manager to check for any vendors that have been changed or added from Claim Center. On the opening screen, she sees that there is one pending change. There are two tabs on the Pending Changes screen, one for Updates and one for Creates. The Updates tab shows that there are no updates that need approval. The Create tab shows that there is one Create action that needs to be approved. This is a new vendor created from Claim Center or another core product. Carla clicks the Create tab. Carla sees that the pending vendor is Bill's Quick Auto Repair. She looks at the details and although they are not very complete, she decides to approve the vendor creation. She clicks Approve to approve the new vendor. Meanwhile, back in Claim Center, Andy is still logged in, and has not moved off of the Contact screen. He refreshes the Contact record by selecting any other contact. And then clicks Bill's Quick Auto Repair. After the Contact is Refreshed, the Sync Message shows that the Contact is linked to the Address Book and is in Sync. Recall that earlier it was linked but not in Sync. Once Carla approved the new vendor, the contract was automatically flagged as in Sync in Claim Center. Next, we look at what happens when a vendor is changed in Contact Manager. Carla opens the Search screen. She enters Bill as the company name and clicks Search. Carla clicks Bill's Quick Auto Repair. She looks at the vendor details. The location description is not something she wants on a vendor record. So she edits the contact. Carla deletes the location description. Carla clicks Update to save the changes to the vendor record. She sees that the location description is now Blink in Contact Manager. Just as before, back in Claim Center, Andy is still logged in and is still on the Contact screen. To refresh the vendor contact, Andy clicks on any other contact. He then clicks Bill's Quick Auto Repair. Andy notices two things. First, that the contact is linked to Address Book and is in Sync. Secondly, he sees that the location description is now Blank. That's because Carla, the vendor manager for Succeed Insurance, removed the location description from the contact. This ends the Adding Contacts in Claim Center demonstration. Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil \n\n--- IS_Claim_18_02 ---\nIn Contact Manager, the Vendor Manager can add documents and services to a vendor record. When that vendor is used on a claim in ClaimCenter, the attached documents are available on that claim. Any services that are on the vendor, help with search criteria. Carla is the Vendor Manager for Succeed Insurance. She logs into Contact Manager. Bill's Quick Auto Repair has sent Carla two documents that they normally use on all the claims that they service. She wants to add documents that they service. She has sent those documents to the vendor record and starts by searching for Bill's Quick Auto Repair. She clicks Bill's Quick Auto Repair in the search results. Carla wants to see if there are any documents already on the vendor record. Bill's does not have any documents attached. She then clicks New Documents, Upload Documents. ClaimCenter opens a File System Explorer window, from which she can select the files for upload. Carla selects the service order for the vendor record. Carla does not need to know the Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil tab, Carla clicks the edit button to add those services. She locates the inspection, repair category under the auto service type, and clicks auto body, and glass, and towing. With all three of those services selected, Carla saves the changes. Back in Claim Center, Andy is still on the Andrew Williams claim. He is looking at the parties involved, contacts screen, and he wants to see if there are any documents associated with this vendor. There are two documents, a service order form and a service level agreement. These documents are here because Carla added them to the vendor record. They are automatically available to all claims that have bills quick auto repair as a vendor. Andy knows that Mr. Williams may need to have his truck towed, and wants to see if there are any vendors in San Mateo that offer that service. He wants to limit the search to vendors who provide specific services. Andy clicks add to specify services to restrict the search. He clicks towing, and clicks OK. He adds San Mateo as a city, and with the services restricted to towing, he clicks search. He sees that among others, bills quick auto repair provides towing, and is in San Mateo. Bills is returned in the results list because they are in San Mateo, and Carla added towing as a service to the vendor record. Andy logs out of Claim Center. This is the end of the adding documents and services in contact manager demonstration.\n\n--- IS_Claim_19_01 ---\nVendor services help identify the right vendors for a given incident or a claim. Adjusters can search for and assign work or services to a specific vendor. Services can be added to a claim during claim intake or later. Andy has been in touch with Mr. Williams about his claim. Mr. Williams told Andy that he is using Bill's quick auto repair for towing and repair of his truck. Andy logs into ClaimCenter. He locates and opens Mr. Williams's claim. He starts by using the Actions menu and selecting New Service. This service is for towing Mr. Williams's truck, so the service is related to the Ford XLT. He clicks Add to add the service. This service is for towing. And he clicks OK to accept towing as the service to perform. Since it is towing, he doesn't need or want to quote first. He just wants the service completed. To select a vendor for the towing service, he uses the drop down by the vendor name and selects Search. Andy adds San Mateo as the city for the search. Because San Mateo is one of the preloaded cities, ClaimCenter populates the state and zip code. The search is further restricted to only vendors who provide towing. He clicks Search. Bill's quick auto repair is one of the vendors returned in the search results. He selects Bill's quick auto repair. He adds additional instructions for the vendor to call Mr. Williams for towing details. Andy then selects the address for the service. The details on this service are complete. He is requesting towing service for the Ford XLT, without requiring a quote first. He also added instructions for the vendor, and provided the address for the service. Andy clicks Submit to create the service. Andy needs to create another service. This one will be for repair of Mr. Williams's truck. Just as before, he uses the Actions menu and selects New Service. Again, he relates the new service to the Ford XLT. And adds a service. This service is for auto body repair. He clicks OK to add the auto body repair service. Because of the scope of the repair, Andy wants to get and approve a quote, before the vendor performs the service. This time, Andy uses the drop-down list to select a vendor. Since Bill's has already been used on this claim, the vendor is a contact and therefore is available in the drop-down list. As he did before, Andy adds instructions for the vendor to call Mr. Williams to discuss the repairs. He selects the service address from the drop-down list. This time, he selects the location of the shop. Andy has entered everything he needs for this service. It's for auto body repair on the Ford XLT, and it's for quote and perform service. He will see a quote that needs to be approved before Bill's performs the service. He also added some instructions and selected the address where the service will be performed. Andy clicks Submit to create the service request. There are two service requests on this claim. The first one is for towing and the next action is to agree to perform service. When the vendor accepts the work, they will simply perform the service. The second service request is for a quote and perform service. The next action on this request is to agree to provide a quote. Once the vendor accepts the work, their first task is to provide a quote for the service requested. This is the end of the adding services demonstration.\n\n--- IS_Claim_19_02 ---\nOnce vendor services are created, an adjuster can manage those services. For example, he can track the exact status of a service, is it waiting for a quote, waiting to be completed, waiting for payment, and so on, the adjuster can update the status of a service based on information he receives from the vendor. If the ClaimCenter vendor was using a vendor portal, much of this management would happen through the portal. However, in this example, the adjuster enters quotes and invoices, and marks services as complete directly in ClaimCenter. There are two services on this claim. A towing service, which is perform service only, and a repair service, which is quote and perform service. Andy hears from Bills that they have accepted the work for towing Mr. Williams' truck. He starts by clicking the towing service. He sets the vendor progress to vendor accepted work. He accepts the default for the expected service completion date, and clicks update to save the changes. Some time later, Andy talks to Bills again and finds out that they have also accepted the auto body work. He clicks the repair service. Just as he did for the towing service, he sets the vendor progress to vendor accepted work. He accepts the default for the expected service completion date, and clicks update to save the changes. Now that both services have been accepted by the vendor, the work may begin. The next, action for the towing service is finish the work. The next, action for the repair service is add quote. After some time has passed, the work is completed for the towing service. And he clicks the towing service. He sets the vendor progress to vendor completed work. He also received an invoice for the towing service, so he clicks add invoice. He enters the description for the invoice. The invoice has only one line item, and it is for towing. The description for the line item is towing for Mr. Williams' truck to the shop. And the amount is $250. With all of the invoice information entered, Andy clicks update to save the invoice. Adding the invoice creates options in the details section to either pay, mark as paid, or withdraw the invoice. Straight through invoice processing is enabled in the base configuration, but Claim Center could not determine which reserve line to use for the payment, so it did not automatically pay this invoice. Andy chooses to pay the invoice. Paying the invoice opens the payment wizard with most of the fields completed. Andy verifies the basic information and moves to enter the payment information. He chooses the first party vehicle. Claim cost slash auto body reserve line. And sets the payment type to partial. The amount of the payment was completed automatically from the invoice, so he clicks next to continue. On this screen, Andy reviews the payment information. He sees there is a $70 deduction, and wants to find out what this is for. The deduction is for backup withholding. This is because the vendor's tax information has either not been supplied or has not been verified. And he clicks OK to return to the check instructions. The details look correct, so he clicks Finish to complete the payment. He also received the quote for the repair of Mr. Williams' truck. He clicks the Repair Service. And clicks the Details tab. He is adding the quote that he received from Bill's Quick Auto Repair, so he clicks, Add Quote. The quote says that it should take 15 days to complete the repairs. He adds the description of the quote. He adds the category, Labor, a description of the line item, and the amount of the first line item. The quote has two line items. One for labor, the other for parts. Andy adds a second line item for parts. He sets the category to parts, enters the description, and enters the amount of $400 for parts. With all the information from the quote, entered, he clicks, Update to save the quote. After the quote is entered, Andy can approve the quote. The actions he can take are Approve Quote, Request a Requote, or Revise the quote. Andy thinks the quote is in line with what was expected for the repairs, so he approves the quote. He accepts the default requested service completion date, and clicks Update. The process of entering the quote and the invoices, and marking a service as complete, all affect the vendor metrics. These metrics help monitor the effectiveness of a vendor. For example, if on the quote, they reported the work could be completed in 5 days, but it took 20 days, that would be reflected in the metrics. Bill's quick auto repair sent Andy an invoice for the repairs along with a note that the work is completed. Andy first sets the vendor progress to vendor completed work. Andy sees that the next, action changes to add invoice. He clicks add invoice to start the process. Andy enters the description of the invoice. The first line item on the invoice is for labor. He adds the description, and sets the amount to $500. He clicks, add, to create a new line item. This line item is for parts. He enters the description and sets the amount to $400. Andy checks that the line items match the invoice and that the total is correct. With that verified, he clicks Update to save the invoice. The invoice creation, automatically triggered creation of a check, because Claim Center could correlate the invoice with a reserve line. The next, action for the repair is now none, invoices paid. Andy logs out of Claim Center. This ends the managing services demonstration. D ounce of Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy so                                                                                                                                                   ",
  "generated_at": "2026-02-13T12:00:18.106584"
}