{
  "chapter": "ch06",
  "chapter_title": "BillingCenter Introduction",
  "domain": "billing operations",
  "video_count": 28,
  "total_duration_seconds": 6608.7,
  "total_duration_formatted": "01:50:08.700",
  "total_words": 17974,
  "avg_confidence": 0.9521,
  "videos": [
    {
      "filename": "Billing_05_01.mp4",
      "stem": "Billing_05_01",
      "duration": "00:03:00.860",
      "words": 432,
      "confidence": 0.9659
    },
    {
      "filename": "Billing_07-02.mp4",
      "stem": "Billing_07-02",
      "duration": "00:02:50.100",
      "words": 410,
      "confidence": 0.95
    },
    {
      "filename": "Billing_07_01.mp4",
      "stem": "Billing_07_01",
      "duration": "00:02:58.720",
      "words": 597,
      "confidence": 0.9565
    },
    {
      "filename": "Billing_08_01.mp4",
      "stem": "Billing_08_01",
      "duration": "00:01:20.960",
      "words": 207,
      "confidence": 0.9513
    },
    {
      "filename": "Billing_08_02.mp4",
      "stem": "Billing_08_02",
      "duration": "00:02:09.320",
      "words": 457,
      "confidence": 0.9527
    },
    {
      "filename": "Billing_09_01.mp4",
      "stem": "Billing_09_01",
      "duration": "00:03:06.440",
      "words": 584,
      "confidence": 0.9258
    },
    {
      "filename": "Billing_10_01.mp4",
      "stem": "Billing_10_01",
      "duration": "00:03:53.160",
      "words": 659,
      "confidence": 0.9719
    },
    {
      "filename": "Billing_10_02.mp4",
      "stem": "Billing_10_02",
      "duration": "00:02:08.420",
      "words": 349,
      "confidence": 0.9465
    },
    {
      "filename": "Billing_11_01.mp4",
      "stem": "Billing_11_01",
      "duration": "00:06:34.540",
      "words": 908,
      "confidence": 0.9477
    },
    {
      "filename": "Billing_11_02.mp4",
      "stem": "Billing_11_02",
      "duration": "00:03:27.980",
      "words": 672,
      "confidence": 0.9674
    },
    {
      "filename": "Billing_12_01.mp4",
      "stem": "Billing_12_01",
      "duration": "00:06:37.520",
      "words": 1262,
      "confidence": 0.9611
    },
    {
      "filename": "Billing_13_01.mp4",
      "stem": "Billing_13_01",
      "duration": "00:05:28.200",
      "words": 1005,
      "confidence": 0.9624
    },
    {
      "filename": "Billing_13_02.mp4",
      "stem": "Billing_13_02",
      "duration": "00:03:29.200",
      "words": 652,
      "confidence": 0.9
    },
    {
      "filename": "Billing_14_01.mp4",
      "stem": "Billing_14_01",
      "duration": "00:07:53.500",
      "words": 1290,
      "confidence": 0.9538
    },
    {
      "filename": "Billing_14_02.mp4",
      "stem": "Billing_14_02",
      "duration": "00:04:07.980",
      "words": 637,
      "confidence": 0.9493
    },
    {
      "filename": "Billing_14_03.mp4",
      "stem": "Billing_14_03",
      "duration": "00:02:22.820",
      "words": 285,
      "confidence": 0.9378
    },
    {
      "filename": "Billing_15_01.mp4",
      "stem": "Billing_15_01",
      "duration": "00:02:28.780",
      "words": 408,
      "confidence": 0.9666
    },
    {
      "filename": "Billing_15_02.mp4",
      "stem": "Billing_15_02",
      "duration": "00:02:37.800",
      "words": 459,
      "confidence": 0.9697
    },
    {
      "filename": "Billing_15_03.mp4",
      "stem": "Billing_15_03",
      "duration": "00:02:19.860",
      "words": 349,
      "confidence": 0.9678
    },
    {
      "filename": "Billing_15_04.mp4",
      "stem": "Billing_15_04",
      "duration": "00:01:31.020",
      "words": 364,
      "confidence": 0.9491
    },
    {
      "filename": "Billing_16_01.mp4",
      "stem": "Billing_16_01",
      "duration": "00:04:23.320",
      "words": 828,
      "confidence": 0.9531
    },
    {
      "filename": "Billing_16_02.mp4",
      "stem": "Billing_16_02",
      "duration": "00:03:47.140",
      "words": 529,
      "confidence": 0.9547
    },
    {
      "filename": "Billing_16_03.mp4",
      "stem": "Billing_16_03",
      "duration": "00:05:32.560",
      "words": 755,
      "confidence": 0.9436
    },
    {
      "filename": "Billing_17_01.mp4",
      "stem": "Billing_17_01",
      "duration": "00:04:26.520",
      "words": 638,
      "confidence": 0.9497
    },
    {
      "filename": "Billing_18_01.mp4",
      "stem": "Billing_18_01",
      "duration": "00:03:51.340",
      "words": 624,
      "confidence": 0.9277
    },
    {
      "filename": "Billing_18_02.mp4",
      "stem": "Billing_18_02",
      "duration": "00:09:21.520",
      "words": 1286,
      "confidence": 0.9484
    },
    {
      "filename": "Billing_19_01.mp4",
      "stem": "Billing_19_01",
      "duration": "00:04:49.020",
      "words": 828,
      "confidence": 0.959
    },
    {
      "filename": "Billing_19_02.mp4",
      "stem": "Billing_19_02",
      "duration": "00:03:30.100",
      "words": 500,
      "confidence": 0.9659
    }
  ],
  "full_text": "--- Billing_05_01 ---\nIn this demonstration, you will see how the payment plan controls the way BillingCenter slices a premium charge into installments and places them on invoices. Here's Kerb Smith's account. I'm going to open the policy issuance wizard to quickly add a policy with a premium charge. I select Add Policy from the Actions menu. This time I'll create a Homeowners policy. Let's give it a policy number. I select Homeowners as the product. I'll use the same payment plan that we used in the previous demo. Here's PP07. I select it. Let's move on to step 2. I click Add to create the premium charge. The amount of the charge is $1,804. I type in the amount. And click Finish. We're back at the account summary. Let's take a look at the charge first. I click Charges in the sidebar. The premium charge is listed at the top of the screen. Below the charge, it's easy to see the 25% down payment in the 11 installments that resulted from the charge. How did the down payment and first installment end up on the same invoice? The answer is, Look at the invoice bill date of the first invoice. Now look at the placement dates of the down payment item and the first installment item. Both invoice items have placement dates that are on or before the invoice bill date. Let's look at the invoices. The first invoice has both the down payment and first installment. Looking at the second invoice, we see just one installment. In fact, all of the remaining invoices have one installment invoice item for the same amount. Let's look at the invoice stream. The periodicity is monthly. The Override Day of Month field specifies the anchor date for the invoice stream. The anchor date came from the payment plan. Let's revisit the payment plan. From the Administration tab menu, I select Payment Plans from the Business Settings menu. The payment plan is PP07. We can see the down payment can be invoiced as early as 25 days before the charge date. The first installment will be invoiced 10 days after the charge date. This explains the difference in placement dates between the down payment and first installment items. Is there a way to ensure that the down payment and first installment land on different invoices? The answer is, yes, there is. This topic is covered next in the lesson. This concludes our demonstration on invoicing a premium charge. of the                   of the of the   of the      of the      of the     of the   of the           of the  Thank you.\n\n--- Billing_07-02 ---\nIn this demonstration, I'll show how BillingCenter charges an invoice fee according to the Accounts Billing Plan. Here is the Account Summary screen for the Lauren Ramirez account. To find the Accounts Billing Plan, we'll go to the Account Details. I'll click BP02 to go to the plan. Notice the plan specifies a $2 invoice fee. Let's return to the Account Details screen. Next, I'll go to the Invoices tab. I can see the first invoice is for $410. The bill date is today, so no need to advance the clock. Let's switch to Super User to run the invoice batch process. Here's the invoice batch process. I click Run. Now let's return to Jeff Park. To refresh the screen, I click on the Next Invoice. Notice the first invoice is now billed. Let's look at the invoice items for the first invoice. Here's the one-time fee in the amount of $2. The invoice fee charge was added by the invoice batch process. Let's look at the first planned invoice. This invoice only has a premium item of $123 and no invoice fee item. Why is there no invoice fee on the planned invoice? The answer is, invoice fees are created by the invoice batch process only when it changes the invoice status from plan to build. Now let's look at the payment requests screen. I click the menu icon for payments in the sidebar. Now I click Payment Requests. As we know, this account has a non-responsive payment instrument. Here's the payment request. The invoice batch process created the payment request on the invoice bill date. Notice the status is created and the request date is tomorrow. Let's return to Super User to advance the clock by a day and run a batch process. We first go to Internal Tools. Here's the testing system clock menu item. I click Add Day. The clock has been advanced by a day. Now we'll go to Server Tools. Here's the payment request batch process, which I'll run now. Let's return to Jeff Park to see what's happened to our payment request. First, I refresh the screen by clicking to another screen. And now I return to Payment Requests. Notice the status of the payment request has changed to Requested. As time advances and the other payment request dates are reached, the payment request batch process will update the payment request statuses accordingly. This concludes our demonstration on invoice fees and payment requests.\n\n--- Billing_07_01 ---\nIn this demonstration, I am going to simulate the invoice process by manually advancing the clock and running two batch processes. Of course, in a production environment, the billing process occurs automatically as time passes and various batch processes are executed according to schedule. Here's the AmeriQuest account. Let's go to the invoices screen. I'll select the invoice. Invoice stream for the GL01 policy. I select the invoice stream. The first invoice has a planned status, so we know that an invoice has not been billed for this policy. The bill date is February 12th. I'll switch to the SuperUser browser to advance the clock to the bill date. I need to advance the clock to February 12th. Invoice stream for the invoice. Now I click Change Date. Next, I'll go to the Server Tools tab. I'll scroll until I see the invoice batch process. Here it is. I click Run. The batch process will look for all invoices with a bill date of today and bill them. Let's go back to Jeff Park to see the result. I'll refresh the display by clicking the second invoice. Notice the status of the first invoice has changed from Plan to Build. This means that the invoice has now been sent. Note the due date of the first invoice is March 5th. Again, I'll switch to SuperUser to advance the clock to March 6th, which is one day following the due date of the first invoice. I click the Internal Tools tab. Here's the testing system clock menu link in the sidebar. I click in the date field. And type March 6th. Now I click Change Date. I need to go back to Server Tools to run a batch process. Here's the invoice due batch process. When I click Run, the batch process will search for all billed invoices with a due date of yesterday. Let's go back to Jeff Park. To refresh the display, I click the second invoice. Notice the status of the first invoice has changed from Build to Due. By the way, the invoice due batch process considers only invoices with a status of Build, so an invoice must be billed before it becomes due. This concludes our demonstration on sending invoices. Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Thank you.\n\n--- Billing_08_01 ---\nAshley Peterson, a policyholder, has requested a change to her due date. The billing clerk agrees to modify the due date to the 15th of every month. In this demonstration, we see how to make the requested change. Let's take a look at Ashley's invoices. Notice the first invoice is billed. The other invoices are planned. All the invoices have the same due date, the 8th of the month. We need to go to the invoice stream screen. I click the invoice stream to make the requested change. Notice that the invoice stream uses due date invoicing. I click the invoice days arrow icon. Then I select modify. The override day of month is currently the 8th. I change the date to the 15th as requested. I click update to save the change. The invoice stream has been updated. Let's revisit the invoice. The due date on the first invoice. The due date on the first invoice, which is the only billed invoice, remains unchanged. This is because it has already been sent. The due dates on all the planned invoices have been changed to the 15th. The bill dates have also been updated on all planned invoices. This concludes our demonstration on modifying invoice due dates.\n\n--- Billing_08_02 ---\nThis demonstration shows how to change a billing schedule. Ashley is interested to know what her payments would be if she were billed every other week instead of every month. First, I need to confirm that Succeed Insurance offers the option of billing every other week. To do this, I'll go to the Administration tab to look at the list of payment plans. I click the arrow icon for Business Settings in the sidebar. Then I click Payment Plans. I see that PP21 is our every other week payment plan. I'll click on the PP21 payment plan. I confirm that the Payment Interval field is every other week, so this payment plan will satisfy the requirement. Next I'll go back to the Account Summary. I select Ashley Peterson from the drop-down list on the Account tab. Here's the Policy Number link, which will take me to the Policy Summary. Now, I'll click the link in the sidebar to go to the Payment Schedule screen. Here is the payment schedule for this policy. I click Change Payment Plan. The Change Payment Plan screen lets me try out different payment schedules. I click the New Payment Plan field. Now, I'll change the New Payment Plan field to PP21, which is on the second page of the list. I select PP21. Notice the Edit Type column. This shows me what will be reversed, in the case of a billed invoice, removed, or added with this change. As the billing clerk, I inform Ashley, changing from a monthly plan to an every other week plan, your down payment will be $1,440 and the installments will be $98 and either $18 or $19, depending on the date. Ashley isn't sure she wants to make a change at this time, so I simply click Cancel. This concludes our demonstration on changing the payment schedule. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy Thank you.\n\n--- Billing_09_01 ---\nFor this demonstration, I am going to enter three payments into BillingCenter. I'll use the Multiple Payment Entry Wizard to get this task done as quickly as possible. Currently, I'm looking at my desktop. I click the Actions menu button and select Multiple Payment Entry from the New Payment menu. I'm on the first step of the Multiple Payment Entry Wizard, where I can enter a set of payments, each with a target of an account, invoice, policy, or producer. The first payment is for an account, a MaryQuest, and the first payment is for a number of $3.5. In the Account Number field, I'll click the Account Picker button. I already know the name of the account. I type the first four letters of a MaryQuest in the Account Name field. Then I click Search. Here's the a MaryQuest account. I click Select. I type in the amount. The second payment is from OpenZoom. The payment has a note saying the payment is for their business owner's policy B0010Zoom. The amount of this check payment is $540. So now I'll enter the payment. Policy numbers are unique in BillingCenter, so there's only one policy with that policy number. I'll search on policy numbers beginning with B0010Zoom. I click Search. Here's the policy I am looking for. I click Select. I type in $540. The third payment is from Standox LLC. The payment also has a note on it saying the payment is for their commercial property policy number CP01 Standox. This time, I type in the policy number without searching for it. This payment is for $1,800. I type in the amount. We have entered all three payments. I'll click Next to go to Step 2. BillingCenter has detected a problem. The error message informs me that policy number CP01 Standox cannot be found in BillingCenter. So either the policy number is incorrect or the policy has not yet been set up in BillingCenter. I'll research that later. The second part of the message suggests using the policy picker or selecting Suspense Payment. I want to record the payment now, so I'll simply change the type from Payment to Suspense. I select Suspense from the list. I click Next to move to Step 2. Everything looks good, so I'll click Finish to complete the wizard. Let's take a look at the Suspense Payment. Notice I can edit the payment. I can also manually apply it as soon as the CP01 Standox policy is known by BillingCenter. We'll talk more about Suspense Payments in a later lesson. This concludes our demonstration on entering multiple payments. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy Thank you.\n\n--- Billing_10_01 ---\nThe payment allocation plan is used by BillingCenter to automatically apply payments. In this demonstration, we take a look at the various settings on a payment allocation plan. Payment allocation plans are on the Administration tab along with the other BillingCenter plans. I click the arrow to expand Business Settings. And I click Payment Allocation Plans. The default payment allocation plan is shipped with BillingCenter. Let's take a look at it. The default payment allocation plan can be modified or used without changes. Another option is to clone it to use it as a starting point for a custom plan. This is what I will do. First I click Clone. The middle section of the plan is called what invoice items should be paid. When the payment allocation process runs, it looks at all unsettled invoice items associated with the account. The term settled means fully paid. Unsettled is not fully paid. This is where you can specify the invoice items to include in the payment allocation. Let's take a look at a few of the filters that are selected. I'll click the sort arrow icon in the name column to put these in alphabetical order. First, we have the Build or Do filter selected. This means that payment allocation will only consider invoice items that have a status of either Build or Do. Planned invoice items will not be included. As you saw in the previous demo, a payment can be earmarked for a specific invoice or policy period. The invoice and policy period filters ensure that a payment that is targeted for a specific invoice or policy period is applied only to that target. Finally, we have the positive filter. This filter restricts payment allocation to invoice items that have amounts greater than zero. There are additional filters in Billing Center that are not currently used in this plan. I'll click add to see what else is available. Next planned invoice, if selected, includes invoice items from the next planned invoice. Pass due restricts invoice items to those that are past due. Let's go back to our clone plan. Billing Center warns me that unsaved changes will be discarded. That's okay. Now that we've discussed filters, let's turn our attention to the bottom section of the screen. This is where the invoice item payment priority is specified. The priority determines the order in which invoice items will be paid. The priority list directs billing center to pay recapture charges first. Next billing center pays invoice items in order of their placement dates, oldest first, and finally, if there is money left over, the payment priority is by charge pattern priority. By the way, a recapture charge represents money the insurer wants to get back from a policyholder after an incorrect disbursement. As with filters, there are additional items you can use to prioritize the order in which a payment is applied to invoice items. I'll click add to take a look at these. There are a number of payment priority items available. Let's focus on Spread Access Even. This priority item tells the payment allocation plan to pay all billed and due invoice items first. And then if there is money left over, to pay the planned items proportionally. So let's select Spread Access Even. I click add priority. Our new priority item is now listed as the fourth priority item. I can control the order of the payment priorities, using the arrows in the move priority column. I'll click the move up arrow next to placement date to move it to the top. This means that items will first be paid in order of their placement dates. Now I'm going to move placement date back down by clicking on the move down arrow, because I want to pay recapture charges first. We've finished examining a payment allocation plan, so I'll just click cancel. This concludes our demonstration on payment allocation plans. We'll see you next time!\n\n--- Billing_10_02 ---\nThis demonstration will show how to override a default payment allocation in the Direct Bill Payment Wizard. Here's the OpenZoom account that we used in the previous demo. OpenZoom has sent us a $200 payment. A company representative wants to know how much they will owe on their next invoice after this payment is applied. So I will enter the payment and apply it immediately to a future invoice. I click the Actions menu button. OpenZoom button. And I select New Direct Bill Payment from the New Payment menu. I know that OpenZoom uses policy level billing with cash separation, so first I select the Designated Unapplied Fund. I click the Designated Unapplied Fund for the policy. Next I type in the amount. The payment is for $200. Notice no invoice items are listed at the moment. This is because our payment allocation plan has a filter that allows only billed and do invoice items. In this case, however, I want to apply this payment to planned invoice items. I need to override the behavior of the payment allocation plan. So I click Override Distribution. Now I'll change the selection for which invoice items to include. I select Up to Amount Under Contract. This setting will list all unsettled invoice items, including those unplanned invoices. Now let's look at the invoice items that are displayed. Currently, each invoice item is listed separately. For a more concise view, I'll change the aggregate field to Summary so that the invoice item amounts are rolled up to display one row per invoice. We can easily see that the entire $200 payment will be applied by default to the next planned invoice. I'll click Execute to complete the payment. OpenZoom wants to know how much their next invoice will be. I'll go to the Invoices screen. I can see that the next planned invoice will be $140. This concludes our demonstration on overriding payment allocation in the Direct Bill Payment Wizard. OpenZoom needs to be updated.     OpenZoom needs to be updated. OpenZoom needs to be updated. OpenZoom needs to be updated.          Thank you.\n\n--- Billing_11_01 ---\nIn this demonstration, we take a look at how BillingCenter handles suspense payments. I'll begin by entering a suspense payment for a policy BillingCenter does not know about. Subsequently, after the target policy is specified, the suspense payment will be applied to the unapplied fund associated with the policy. First I click the Actions menu button to open the Multiple Payment Entry wizard to create the payment. I select Multiple Payment Entry from the New Payment menu. I want to add a payment for policy number B001VADX with a payment amount of $3,600. I type in the policy number. The policy does not exist in BillingCenter, so I'll change the type to suspense. I select suspense. Next, I type in the amount. The amount of the payment is $3,600. Let's go to the next step. Step 2 is a confirmation step. Everything looks fine, so I'll click Finish. Let's take a look at the suspense payment. The suspense payments screen shows two payments. The one I just entered is highlighted. The other suspense payment is from a previous demo. Next, I'll create the target policies for these payments so you can see how BillingCenter applies suspense payments. I start by clicking the arrow icon for the account tab. First, I'll create the business owner's policy for VAADX, which is listed in the account dropdown. I want to create a new policy, so I click the Actions menu button. I select Add policy from the menu. In the policy issuance wizard, I start by typing in the policy number. I make sure the number matches the target policy number for one of the suspense payments. This is a business owner's policy. I select business owners from the list of products. I click in the Payment Plan field. We'll use PPO1 Payment Plan. Let's go to step 2. I click Add to add a premium charge. Premium is pre-selected. I simply need to enter the amount of the charge. The charge is for $3,600. I click Finish. Now that the first target policy has been created, I will create a target policy for the other suspense payment. This policy is for the Standox account, which I will search for. I click the arrow icon on the Search tab. I select Accounts. I want to search for the Standox account. I click in the Account Name field. I type ST. And click Search. I click the account number for Standox in the search results. Next I'll add a policy to the Standox account. I select Add policy from the menu. The policy number will be CPO1 Standox. This is a commercial property policy. I select Commercial property from the list of products. We'll use PPO1 Payment Plan. I select PPO1. I click Next to go to Step 2. I click Add. It's a premium charge for $1,800. I enter the amount. Next I click Finish. As we discussed earlier, there are two ways in Billing Center to release suspense payments, manual and automatic. First, we'll use the manual process. Let's return to the desktop. I click Suspense Payments in the sidebar. Here's the suspense payment for the VAIDACS policy. Now that the policy exists, I can apply the suspense payment. I click Apply. The Apply Suspense Payments screen allows me to change the payment target if needed. For example, I could select a different policy number. However, this is the correct policy number, so no changes are needed. I click Update to release the suspense payment. The suspense payment for VAIDACS is no longer listed on the Suspense Payments screen. I select All to show all the suspense payments. Now I can see the payment and its status of Applied. Let's return to the Account tab. So let's see where the payment money is in Billing Center. I'll open the Account Summary for VAIDACS. The Financials section shows the $3,600 in the total unapplied. I'll click the link. The Unapplied Funds detail screen shows us that the $3,600 payment is in the designated Unapplied Fund for the policy. That was a brief demonstration of manually allocating a suspense payment. Let's return to the desktop to learn about automatic allocation of a suspense payment. I click Suspense Payments to return to the Suspense Payments screen. Here's the suspense payment for $1,800 that I entered earlier. Currently the status is Open. Let's go to the SuperUser browser to run a batch process to release the payment from suspense. I look for the suspense payment batch process on the Batch Process Info screen in Server Tools. Here is the batch process. I click Run. And now we'll return to Jeff Park's browser. First, I'll refresh the display by visiting another screen. Now let's look at the suspense payment. Notice the status of the suspense payment has been changed to Applied. I'll revisit the Account Summary for Standox. I select the Standox account from the drop-down list. In the Account Summary for Standox, we can see there is $1,800 in the total unapplied field. I'll click this link. The Unapplied Funds detail screen shows that the $1,800 payment is in the unapplied fund for this policy. Both the manual and automatic approaches to releasing suspense payments achieve the intended results. This concludes our demonstration on handling suspense payments.  Filmed into the Filmed into the   Filmed into the  Filmed into the       Filmed into the                    Filmed into the Filmed into Filmed into the Filmed into Thank you.\n\n--- Billing_11_02 ---\nIn this demonstration, we are going to look at a scenario where a payment was received, but was applied to the wrong policy. Our customer, Todd Davidson, has a homeowner's policy and a personal auto policy with us. He paid for both policies using a single check. We have learned that the payment was not applied as he requested. Instead, the whole payment was applied to the homeowner's policy. The account summary shows the two policies, homeowner's and personal auto. Also, I see that the graph shows that $840 has been paid, but there is still an amount of $300 that has been billed but not paid. So let's fix this problem. We'll start by looking at the payment. I click payments in the sidebar. Here we can see the payment of $840. I'll click the payments so that we can view the payment details. The first two rows show the payment was applied to the billed invoice. The third row shows that $300 of the payment was applied to the next planned invoice. Instead, the $300 should have been applied to the billed invoice for the personal auto policy. Let's modify the payment. I'll select Modify Distribution from the list of payment actions. The Modify Payment screen is similar to the Direct Bill Payment screen. The Distribution tab shows that the payment has been applied to the billed and planned invoices for the homeowner's policy. I can reallocate the payment by adding invoice items from the personal auto policy to the allocation. First I click Override Distribution. Notice the Override toolbar is now displayed. I click Add Items to find all billed items, which I want to add to the payment distribution. The Add Items screen allows me to search for and then add unsettled invoice items from any policy to the payment allocation. Note the payer account is already set as a search criterion. I click Search. My first search returns several items. I decide to restrict the next search to invoice items that are on invoices with a billed status. I click the Build Status field. I select Billed from the list of statuses. Now I click Search. This time the search returned just two billed items. I click the checkbox next to each item. Now I click Add Selected Items. Notice the plus icon next to the items I added. The icon lets me know that these are the manually added items. The red amount in the remaining fields shows more money will be allocated than is available. To get a clearer view of the billed and planned invoices, I click the Aggregate field. I want to see a summary of the invoices. To remove the proposed allocation for the planned invoice, I click in the Override Amount field for the planned invoice. I enter 0 as the override amount. Now the available and distributed amounts are equal. To apply the modified payment allocation, I'll click Execute. On the Payments screen, we can see that the entire payment has been applied to billed invoice items only. Let's return to the Account Summary screen. In the Financials section of the screen, the pie chart details show that $840 has been paid and the billed amount is $0. I successfully modified the payment allocation as requested by the customer. This concludes our demonstration on reallocating a payment. Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Filmed Fil Thank you.\n\n--- Billing_12_01 ---\nFor this demonstration, I'm going to show you how to test delinquency processing. In a production system, delinquency processing occurs over a period of weeks. However, by manually advancing the testing clock and running batch processes, we can see the whole delinquency process in a few minutes. I have set up a test policy for the Ella Lundstrom account. We're looking at the invoices screen for the account. The first invoice is due and has been paid in full. The second invoice is billed but not paid. Notice the date in the info bar is the due date of the second invoice. This invoice has not been paid yet. Let's go to the account summary. Here we see an alert bar to indicate this account will become delinquent if the expected payment is not received today. Now I'll open the policy. Here we see a similar alert about the upcoming delinquency on the policy summary. Let's switch to superuser to make the policy delinquent. First, I'll advance the clock by one day. Then I go to the server tools tab. I scroll the display to find the invoice due batch process. Here is invoice due. I click run. Let's return to Jeff Park to see the result. To refresh the browser, I click the details link in the sidebar. Then I click the summary link to return to the policy summary screen. Let's take a look at what has changed on the policy summary screen. The screen has been designed to quickly provide the most commonly needed information about an active delinquency. The alert bar message has changed to an alert stating the policy has a past due delinquency. The delinquencies field has been updated to show this policy has had one delinquency in 12 months. In the financials section, the past due field displays the past due amount and also indicates a $50 late fee has been charged. The policy summary screen gives us the high level status of this account. Now, let's view the details of the delinquency process. I'll do this by clicking on the link in the alert bar to open the delinquencies screen. This screen shows the delinquency is open and the delinquency reason is past due. I'll scroll to show the events area of the screen. Here we see a list of the workflow events that you can use to track delinquency processing. Two events have completed, Dunning Letter 1 and Late Fee. The next event is Dunning Letter 2, which will cause a second Dunning Letter to be sent to the delinquent policyholder. Inception date refers to the start date of the delinquency. In the example, the inception date is one day after the due date of the unpaid invoice, which is today. The Dunning Letter 2 event is scheduled for inception date plus seven days. So I'll switch to Super User and add seven days to the billing center date. First I'll go to internal tools to advance the testing system clock. I select testing system clock from the menu. Now I click add week to advance the clock to the date of the Dunning Letter 2 event. Next, I need to run a batch process to wake up the workflow. I click the server tools tab. I scroll the list to locate the workflow writer batch process. Now I click run. Let's return to the Jeff Park browser to see the result. To refresh the display, I click the journal link in the sidebar. Now I return to the delinquencies screen. Immediately, I see the current event is Dunning Letter 2 and the next event is send notice of intent to cancel. Let's look at the second activity. The workflow has updated the Dunning Letter 2 event to show the event is complete and the date it was completed. The workflow has also created two activities. The general activity is an activity that specifies the Dunning Letter was sent. I'll click the details link so that we get more information about this activity. We can see the subject, description and priority. This activity is really just an informational activity and does not require any user action. Let's look at the second activity. The second activity is different from the general activity. It is an approval activity that requires approval to be approved. The second activity is a result of the cancellation. Notice the mandatory column is set to yes. This activity is mandatory because the delinquency workflow is waiting for this activity to be completed. I'll click the details link so that we get more information about this activity. Notice this activity has an approve button. It also has a due date and an escalation date. If this activity is not completed by the escalation date, it will be escalated based on business rules. Although the activity is not assigned to me, I can approve it, so I click approve. Now, I click complete activity. We can see the activity status has changed to complete and the approved field changed to yes. The next event in the events list is send notice of intent to cancel, which is scheduled 14 days from the inception date. The current date is 7 days after inception, so I need to advance the clock by a week. For this, I switch to super user. First, I click the internal tools tab. And I select testing system clock from the menu. I click add week to add another 7 days to the billing center clock to reach the target date of the event. Now let's run the workflow writer batch process. Here is the workflow writer batch process. I click run. Let's return to the Jeff Park browser to view the result. To refresh the display, I click the journal link in the sidebar. Now I return to the delinquencies screen. I scroll the display to view the activities and events. The intent to cancel notification event has been marked complete. Also, the workflow created a new general activity about the notification. Let's return to the policy summary. The most recent workflow event changed the cancellation status to pending cancellation. At this point, the delinquency process is waiting for a response from the policy administration system that the policy has been cancelled. When billing center receives notification, the status will be changed to cancelled. Let's visit the delinquencies screen once more. There are other delinquency workflow events listed. The policy can be sent to a collection agency. Ultimately, the workflow can write off the overdue amount. There is also a rescind slash reinstate event. All of these events require some configuration. This concludes our demonstration on testing delinquency processing. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy Thank you.\n\n--- Billing_13_01 ---\nIn this demonstration, we create a trouble ticket. The trouble ticket will place holds on delinquency processing and invoice billing. Ashley, a policyholder, has requested a reduction in her bill because she has just lowered the coverage on her homeowner's policy. An alert warns that the account has a passed due delinquency. Let's look at the policy. $130 is passed due and a late fee of $50 has been charged. The first step in resolving this issue is to place a hold on delinquency processing and on billing. I can do this by means of a trouble ticket. I click the trouble tickets link in the sidebar. I click New to launch the trouble ticket wizard. I need to select the type of trouble ticket. I select Customer Complaint from the list of types. Next is the trouble ticket. Next is the trouble ticket subject. I enter the policy number that the trouble ticket is for. I type in a short description in the details field. The bill needs to be adjusted because of a change in coverage. Next is the priority of this trouble ticket. I select Urgent from the list. Next is the priority of this customer. We want to act fast to fix this issue to keep the customer happy. So I type in today's date in the date due field. I also type in today's date for the escalation date. Let's go to step 2. Here I see the account, policy, and policy period are already associated with the trouble ticket. This means a trouble ticket alert will be displayed in the UI for the account, the policy, and the policy period. Let's go to the next step. The primary purpose of this trouble ticket is to place holds on both delinquencies and billing, so I will select those two holds. A hold on delinquency blocks the automatic processing of delinquencies. I also place a hold on invoice sending. I decide not to specify dates for automatically releasing the holds on a certain date. The holds can be released manually. Also, closing the trouble ticket automatically releases all trouble ticket holds. Let's move to step 4. In step 4, I can add any related transactions. This is purely for documentation purposes. Here I'll add the late fee that Ashley was charged. I select the policy late fee charge transaction. And click select. Let's go to step 5. This is the last step. I want to assign the trouble ticket to myself. I select Jeff Park. Now I click finish to save the trouble ticket. The new trouble ticket is listed here. I click the trouble ticket number to view the trouble ticket. There are some tabs at the bottom of the trouble ticket screen. Currently, the trouble ticket has no notes or activities. I will add an activity to the ticket later in the demo. Let's look at transactions. On the transactions tab, I see the late fee transaction listed. Let's look at the holds tab. The holds I placed on billing and delinquency processing are shown here. Let's go back to the policy. As expected, on the policy summary, troubled ticket alerts for the policy and policy period have been generated. Let's see what's happening with the delinquency. The status of the past due delinquency is on hold. The next delinquency event, which is Dunning Letter 2, is in one week. I'll switch to Super User to advance the clock and run a batch process to wake up the workflow. I click Add Week to advance the clock by 7 days. Next I click Server Tools to run the batch process. I click the sort arrow icon to make it easy to access the Workflow Writer batch process. I find Workflow Writer and I click Run. Let's return to Jeff Park's browser to see what has changed. First, I'll refresh the display by visiting another screen. Now I return to the delinquencies screen. The target date for the Dunning Letter 2 event is now red. But the event cannot be completed because of the trouble ticket hold. We know the delinquency hold is working. Now I want to see the effect of the hold on invoice sending. I'll switch over to Super User to make the third invoice build. First I add a month to the testing clock. Next, I go to the Server Tools tab. Here's the invoice batch process. I click Run. Let's return to the Jeff Park browser to see the result. I click the account number in the info bar to go to the account. Let's go to the Invoices screen for the account to see how Billing Center handles the hold on billing. Here's the invoice we're interested in. Notice the due date has passed. The status field for the third invoice is carried forward. This means Billing Center carried the invoice items forward to the next planned invoice as a result of the invoice hold. The amount field on the third invoice is empty. This concludes our demonstration on trouble tickets and trouble ticket holds. Let's return to the lesson to learn more about trouble tickets.  Filogy of the Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Fil                            \n\n--- Billing_13_02 ---\nThis demonstration is a continuation of the previous trouble ticket demonstration. Ashley, the policy holder, has requested removal of the late fee that she was charged. Jeff Park decides to add an activity to the trouble ticket to accomplish this task. Let's add an activity to the trouble ticket to assign the responsibility for removing the late fee. I clicked the link in the trouble ticket alert. I can create the activity on the activities tab of the trouble ticket we created in the previous demo. I want to be able to assign this activity to a billing center user, so I click the arrow icon for new assigned activity. I select to do from the request menu. An activity often serves as a request to do something. I click in the subject field. And type in remove late fee. For the description, I'll type in the policy number. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I click the winner. I I click in the Assign to field. And assign the activity to myself. I click Update to save the new activity. The new activity is listed at the bottom of the trouble ticket screen. Now I'll go to my desktop to view the activity. Here it is in the list of activities that are assigned to me. I'll click the subject, Remove Late Fee. Because the activity is associated with a trouble ticket, Billing Center opens the trouble ticket screen. I can see the activity listed in the workspace below. The activity directs me to remove the late fee. To do this, I return to the policy summary. Here's the late fee in the Financials section. I click the arrow icon for the Late Fee field. And select Reverse. There's only one late fee listed. I click Select. Step 2 allows me to select a reason. I select Customer Request. To complete the removal of the late fee, I click Finish. I see immediately that the late fee has been cleared. Next, I can revisit the trouble ticket and mark the activity complete. I click Complete Activity. Now let's assume that Billing Center has received the policy change billing request that lowers Ashley's bill. This means that I can close the trouble ticket. On the trouble ticket screen, I click Close. Closing the trouble ticket automatically closes all trouble ticket holds and open activities associated with the trouble ticket. I click OK. Let's see what has happened with the delinquency. I clicked the link in the alert bar. The status of the delinquency is now open. This is because closing the trouble ticket released the hold on delinquency processing. Let's look at the delinquency events. The target date for Dunning Letter 2 is no longer displayed in red. The date has been adjusted to allow time for Ashley to receive the adjusted invoice and to pay it. This concludes our demonstration on trouble tickets and activities.\n\n--- Billing_14_01 ---\nIn this demonstration, we will look at the basic components involved in the commission process in BillingCenter. Let's start by viewing a producer. I click the arrow on the Search tab. I select Producers from the menu. We'll search for Stevens Gray Insurance on the Producers Search screen. I'll type ST and click Search. Here is Stevens Gray Insurance LLC. I click the link. Clicking the producer name takes me to the summary screen for the producer. The first column shows basic information about this producer. Notice the tier is gold. A producer's tier indicates the level of service the producer generates and helps determine how much commission the producer earns. In the Status column, the fields track the commission earned and paid to the producer. The fields are empty right now, but we'll see these in action later in the demo. In the last column on the right, the field settings determine how and when BillingCenter pays commission to this producer. The direct bill fields in the top right specify that the commission day of the month is 20 and payment frequency is monthly. This means that Stevens Gray is paid commission on the 20th of each month. Stevens Gray has just sold a policy. Let's add the policy to BillingCenter so the producer will earn some commission. First, I'll open the Myra Hammond account. I click the arrow icon on the Account tab. I select the Myra Hammond account. Next, I click the Actions menu button to open the Policy issuance wizard. I select Add policy from the menu. As always, the first step is to enter the policy number. The product is Personal Auto. I select Personal Auto from the list. Next, the new policy needs a payment plan. And I select Personal Auto from the list. I select our Full Pay Payment Plan . Next, I want to add Stevens Gray as the primary producer. I'll click the Look Up button on the Primary field. This opens the Producer search screen. I enter ST for the producer name. Now I click Search. The search returns Stevens Gray Insurance. I click Select. Stevens Gray Insurance is now the primary producer on the policy. Because this producer has only one producer code, the code has been auto-filled for me. Notice there are also fields for secondary and referrer producers. A policy can have up to three producers earning commission. However, for this demo, we have a single producer, so I'll leave the other fields blank. I click Next to go to Steps. Step 2. On Step 2 of the wizard, I click Add to add a premium charge of $3,600. The type defaults to Premium. I type in the amount in the amount field. Now I click Finish. We now have a policy that earns commission. The new policy is listed on the account summary. Let's return to our producer. I select Stevens Gray Insurance LLC from the list. On the producer's summary screen, notice the $360 in both the Total Commission Reserve and Total Commission Expense fields. Why did Billing Center put this money into reserve? The answer is, when Billing Center received the issuance billing request for the policy, it set aside enough money in reserve to pay the total commission amount during the life of the policy. The commission rate for this producer is 10%, so 10% of $3,600 is $360. That is the amount Billing Center placed in reserve. Currently the Total Commission Payable field is empty. No commission has been earned yet. What causes the commission to be earned? The commission plan provides the answer. Let's go to the commission plan to see when Stevens Gray will earn commission on this policy. The commission plan link is next to the producer code. The policy we just created is associated with this commission plan through the producer code. There are three things I want to learn from the commission plan. What types of charges earn commission? What is the commission rate? And when will the commission be earned? Let's go to the commissionable items tab first. Here we see that premium charges will earn commission. Taxes do not earn commission. Let's return to the general tab. On the general tab, the commission earning rates are specified for the three producer roles. I can see that Stevens Gray, as the primary producer, earns 10% commission according to this plan. Under payable criteria, the earned commission field is set to on billing. This means the producer will earn commission over time as the policy is billed. There are a number of other fields for a commission plan, which we'll explore later. Let's bill an invoice so we can see the earned commission. I click the arrow on the account tab to return to the Myra Hammond account. I select Myra Hammond. I click the invoices link in the sidebar. There's only one invoice for this account. I notice that the bill date is today. I'll switch to the super user browser to bill the invoice. As super user, I'll simply run the invoice batch process to make the invoice billed. Let's return to the Jeff Park browser. I'll refresh the screen by clicking a link in the sidebar. I click the invoices link to return to the invoice. We see the status of the invoice is now billed. Let's take a look at the producer. I select Stevens Gray from the list. The policy in this scenario was billed in full on a single invoice, so all the commission was earned when the invoice was billed. If we had a policy that was invoiced over a number of installments, the commission would have been paid out proportionally as each installment was billed. Some money would be moved from reserve to payable with each invoice. As we saw earlier, the commission day of month for this producer is the 20th. I'll switch to super user to advance the clock and generate the producer's commission statement. I click the arrow icon on the internal tools tab. And I select testing system clock from the list. I click in the date field. I type in the new date of April 20th. Now I click change date. The testing system clock is now set to our producer's payment date. Next, I want to run a batch process to generate the producer payment. I find the producer payment batch process in the list of batch processes. I click run. Now let's return to the Jeff Park browser to see the result. We're back to the summary screen for the producer. I'll refresh the screen by clicking a link in the sidebar. Now I click the summary link to return to the producer summary. The $360 has moved from total commission payable to commission paid year to date. This means that we have paid the commission and currently there is no additional commission to be paid. The producer payment batch process updated the commission totals. It also generated a commission statement for the producer, which we'll look at next. I'll click the direct bill commission statements link to go to the list of commission statements for this producer. Here's the commission statement that was just generated. I'll click the statement number so we can view the statement details. The statement screen shows the policy activity for the producer. There is just one policy with an earned commission item in the amount of $360. I'll click the policy number to view the policy activity. Here we see the event that caused commission to be earned. In addition, the screen specifies the account, policy, and charge type, as well as the basis, commission rate and commission. This concludes our review of the commission process.\n\n--- Billing_14_02 ---\nIn this demonstration, we take a closer look at a commission plan. Then we'll modify a commission plan to include special rates for the personal auto line of business. Let's revisit the commission plan that we used in the previous demonstration. I clicked the link to CP03 on the Producer Summary screen. At the top of the screen are settings that apply to the commission plan as a whole. The Allowed Tiers area indicates this plan is available to all producer tiers, Gold, Silver, and Bronze. A commission plan can have more than one subplan. Here we see that CP03 has just one subplan, which is named Default. Default is the only required subplan. All primary producers using this plan will earn commission at the same rate and commission is always earned on billing. This is because there is only one subplan, Default. Currently, the Default subplan specifies a 10% rate for the primary producer regardless of the line of business. Succeed Insurance has a requirement for the rate for primary producers to be 15% for personal auto policies only. We can satisfy this requirement by adding another subplan. The first step for adding a conditional subplan is to put the commission plan into edit mode. I click Edit. Before I add a subplan, notice the default subplan has only 4 tabs. Next, I'll click Add. A fifth tab has appeared. All non-default subplans have a Subplan Availability tab for restricting usage of the subplan. Next, I'll name the subplan Personal Auto. Primary producers will earn commission at the rate of 15%. Secondary producers will earn commission at 10%. Producers with a role of referrer will earn commission at 5%. I click in the Earn Commissions field to specify when producers will earn commission according to this subplan. The list of values for Earned Commissions shows all possible payable criteria, including Custom, which would require configuration. I'll select On Billing. Suspend for delinquency is the last field on the General tab. I click Yes to suspend commission for delinquent policies. Now, I'll go to the Commissionable Items tab to specify which charge types will earn commission. Notice that no commissionable items are selected by default, so commissions will only be paid if something is listed here. For this subplan, commissions are paid on premium only. I'll click Add. I click in the Item field. Typically, commissions are paid on premium only. However, Billing Center can be configured to allow commissions to be paid on additional charge types. I select Premium from the list. Now we'll go to the Subplan Availability tab. This tab is available only for conditional subplans. The purpose of the Subplan Availability tab is to specify properties that restrict the usage of the subplan according to policy, producer, and account properties. Since the default subplan is always available with no restrictions, it has no need for an Availability tab. Each subplan has several options to restrict its usage. For example, we can limit a subplan to a specific product such as Personal Auto. This is what we want to do for this subplan. I click the Select button for Allow Products. This lets me select the individual products that this subplan applies to. By default, all products are allowed. I will click No for each one except Personal Auto. Notice I skipped Personal Auto because that is the product this conditional subplan will apply to. So now we have a conditional subplan that will be available only for Personal Auto. All other products will use the default subplan. The new subplan is complete. I click Update to save the changes to the Commission Plan. I click Return to Summary to go back to the Producer Summary screen. This concludes our demo on creating a Commission subplan. of the ! of the   of     Thank you.\n\n--- Billing_14_03 ---\nIn this demonstration, I'll test the commission subplan we created in the previous demo. To test the conditional subplan, I'll add another personal auto policy to the Myra Hammond account. I click the Actions menu button. I select Add Policy to open the Policy Issuance Wizard. First, I type in the policy number. The product is Personal Auto. I select Personal Auto from the list of products. Next, I'll select our Full Pay Payment Plan. I select PP01. Next, we need to add the primary producer. I start by clicking the Lookup button. StevensGrey is already in the search results from a previous search, so I click Select. Notice the code field is automatically populated with Steven Grey's producer code. This is because StevensGrey has only one producer code. Now we can move on to Step 2. I click Add to add a premium charge. The charge type defaults to premium. I simply need to type in the amount. The charge amount is $3,600. Next, I want to add a taxes charge. I click Add. I click in the Type field. And I select Taxes. The amount for taxes is $400. Now that I've entered both charges, I click Finish. Let's go to the producer to confirm the commission was calculated correctly according to the conditional subplan. I click the arrow icon on the Producer tab. StevensGrey is listed in the drop-down list of recently used producers. Notice that we now have $540 in the Total Commission Reserve field. This confirms that our conditional subplan was used to calculate commission because 15% of $3,600 is $540. We have met the requirement for Personal Auto Policy Commission. This concludes our demonstration on testing a commission subplan.  \n\n--- Billing_15_01 ---\nIn this demonstration, I show how to simulate a policy change request that results in a reduction in premium. Then we see how BillingCenter allocates the credit from the premium reduction. Here's the Gayle Lohmann account, which has a personal auto policy with a premium amount of $1,200. First, I'll take a look at the invoices for this account. I click the invoices link in the sidebar. The first invoice has been paid in full. There are three other invoices, which are planned and unpaid. Let's assume the policyholder has removed a driver from her personal auto policy, resulting in a premium reduction. I'll simulate what happens in BillingCenter when the $300 premium credit is received. To do this, I'll go to the policy. I click the Actions menu button. And select Change Policy to open the Policy Change Wizard. The Policy Change Wizard is available in a development environment to simulate a policy change billing instruction. There's nothing for me to modify on Step 1. Let's advance to Step 2. I want to create a billing instruction to reduce the premium by $300. I click Add. Since this is a credit, I'll enter minus 300 as the amount. Now I click Finish. Let's take a look at how BillingCenter handled the credit. To see this, I'll go to the Charges screen. The Policy Change Charge is already selected. Let's look at the invoice items that resulted from the charge. The amount column shows the $300 credit was sliced according to the payment plan into three installment items, evenly distributed across the remaining three unpaid invoices. In the Paid Amount column, we see each negative installment item was paid immediately. Paying a negative item makes the money from the credit available to be allocated to unsettled positive items. Next, I'll select the Policy Issuance Charge. Looking at the Paid Amount column on the invoice items, we see the $100 credit amounts have been allocated to pay positive invoice items on the remaining three invoices. Now, let's take a look at the invoices for this account. I click the account number in the info bar. Now I click the invoices link in the sidebar. Notice the amounts for the remaining invoices are for $180 instead of the original $280 amounts. The $300 reduction in premium has been applied to the planned invoices. This concludes our demo on simulating a policy change request that results in a reduction in premium.\n\n--- Billing_15_02 ---\nIn this demonstration, we take a look at the return premium plan that influenced the allocation of policy credits in the previous demonstration. Return premium plans are located with the other plans on the administration tab. I click the arrow icon. Now I select return premium plans on the business settings submenu. Currently, there is only one plan, the default return premium plan, which is shipped with BillingCenter. Let's take a look at it. First, we see the eligible items field. This setting specifies which positive items will be paid during credit allocation. On this plan, the only items that are eligible to be paid by a credit are ones that have the same payer and belong to the same policy period and same charge pattern as the credit being allocated. Notice the plan has two return premium handling schemes. Each of these defines the rules for allocating credit. Each name field entry corresponds to a billing instruction type, with the exception of the exception of the other context. So the scheme name cancellation is used for charges from a cancellation billing instruction. The other scheme is used for charges that do not match any other scheme. Every return premium plan must have a scheme named other, which serves as the catch-all scheme. For example, this return premium plan has no scheme that is specifically for policy change, so the other scheme will be used. The other scheme uses the proportional method. This is the scheme BillingCenter used when applying the credit of $300 in the previous demonstration. As we saw, the $300 was allocated proportionally over the eligible invoice items. The cancellation scheme uses the cancellation scheme. The cancellation scheme uses the last to first method. This means for all cancellation billing instructions, BillingCenter will allocate credits starting with most recent eligible items, which are those having the latest placement date. The when to allocate field controls when credit allocation will take place. Both schemes specify on receipt. As we observed in the previous demo, the credit was allocated as soon as BillingCenter received the billing request. Let's go back to the list of return premium plans. BillingCenter is shipped with a default return premium plan. You can modify it directly or clone it to modify a copy of the plan. However, the important thing to remember is the return premium plan with a priority of 1 is the only active return premium plan for the billing system. Whenever a new policy is issued, the active plan is automatically associated with a new policy period. Making a different plan active does not affect existing policy periods. This concludes our short demonstration on return premium plans. Films Films   Films Films     Films   Films               Films Films                     Films Films Films Films Films                           \n\n--- Billing_15_03 ---\nThe purpose of this demonstration is to test how BillingCenter handles a cancellation. In this demo, we'll use the same policy that I used in the previous demo to show policy change processing. However, I need to be logged in as SuperUser to run a debug command. Let's start by going to the policyholders account. I click the invoices link in the sidebar. On the invoices screen, in the do column, there is a total of $540 remaining to be paid on the policy. This is the amount we'll specify on the debug command to cancel the policy. I click the policy link to return to the policy summary screen. Notice the current cancellation status is open. I click in the quick jump box to enter the cancel command. The command is, run policy cancel this minus 540. I press return to execute the command. I press return to execute the command. Immediately, we see the cancellation status has changed from open to canceled. Let's take a look at the charges for the policy. A new cancellation charge has been added in the amount that I specified on the run command. Let's return to the account summary screen. In the policy period section, we can see today's date has been entered in the cancellation date field for the policy. Next, I'll go to the invoices screen. Notice there are only two invoices, the original due invoice and one planned invoice. The planned invoice is the future invoice that resulted from the cancellation. I'll click the plan invoice. As we see, all invoice items from the original planned invoices have been moved to this invoice. Let's switch the sort to group by installment number. Now let's look at the charges. The cancellation charge is already selected. Notice the negative $540 was sliced into a down payment, and three installments according to the payment plan. Does it matter how the charge was sliced? No, for a cancellation, all unsettled invoice items end up on the same invoice, so charge slicing does not matter. This concludes our demo on testing cancellation processing.\n\n--- Billing_15_04 ---\nPrevious demonstration, we cancelled the personal auto policy, for Gail Lohmann. Let's assume the cancellation was made in error, so we need to immediately reinstate the policy. We can do this as super user, using another run command in our debug tool set. Here's Gail Lohmann's policy. The cancellation status is cancelled. I'll go to the quick jump box, and issue a run command to reinstate the policy for the same amount as the cancellation. The command is run policy. The command is run policy. This followed by the amount of the reinstatement. The amount is $540 in this case. I press return to execute the reinstatement command. BillingCenter tells me that the policy has been reinstated. We can also see the cancellation status is now open. Let's go to the charges for the policy. The run command created two new charges, reinstatement fee, and a premium charge for the reinstated policy. The $100 reinstatement fee amount is specified on the general tab of the delinquency plan. I click the premium charge for the reinstatement. Here we see the reinstatement. Here we see the reinstated invoice items, which are the result of slicing the charge according to the payment plan. This concludes our brief demonstration on testing policy reinstatement using a debug command. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy so so       so                  so                                                                            \n\n--- Billing_16_01 ---\nThis demonstration shows how to process a manual disbursement in BillingCenter. Here's the Snyder & Associates account, which has a commercial package policy. The customer has sent a payment for $11,000. The money was already allocated to fully pay the policy. But the amount of the payment was greater than the amount billed, leaving $1,902 remaining in the unapplied fund for the policy. BillingCenter will automatically disburse the money in the next few days. However, the policyholder has requested that the payment will be paid for the policy. BillingCenter has requested a refund for the remaining money as soon as possible. I'm going to create a manual disbursement right now so there's no delay. I click the Actions menu button. And I select Disbursement from the New Transaction submenu. This opens the account disbursement wizard. First, I need to select the unapplied fund that holds the money I plan to disburse. I select the designated unapplied fund for the policy. Next, I enter the amount of the disbursement. I type $1902 in the amount field. I'll make the payment date the same as the current billing system date. Now I need to select a reason for the disbursement. I select Overpayment. The Pay Info fields on the screen are correct as is. There are no changes needed. I click Next. Step 2 is the disbursement confirmation step. I visually verify the disbursement amount and due date before clicking Finish. Now, let's look at the disbursement we just created in the Disbursements screen. I click the Disbursements link in the sidebar. The new disbursement is already selected. I immediately notice the disbursement has a status of Approved. It was automatically approved by the system. At this point, the disbursement is ready to be sent, but it has not been sent yet. It is waiting for the disbursement batch process to run. While we are on the disbursements screen, let's see what actions are available for the disbursement. I'll click Edit to go into Edit Mode. The Reject button is available. We know the disbursement was automatically approved by the system. However, if a mistake had been made, I can reject the disbursement and create a new one later if required. Notice there's a second Reject button. This button does more than simply change the status of the disbursement to Rejected. It also causes Billing Center to create a trouble ticket with a hold on automatic disbursements. I would click this button if there were a problem with the account such that no disbursements should be issued until the problem is resolved. The hold will not be released until the trouble ticket is closed. But no changes are needed at this time, so I click Cancel. Normally, an approved disbursement is not sent until the disbursement batch process runs at its scheduled time. For the purpose of this demo, I'll switch to SuperUser to manually run the disbursement batch process so that we can see the results. I'll look for the disbursement batch process and click Run. On the disbursements screen, we can see the results. The batch process has set the Date Issued field to Today's date and changed the status to Sent. Also, the payment status is now Draft, indicating a request for payment has been sent to a third-party payment system. Let's return to Edit Mode to learn what actions we can perform on a sent disbursement. Both Reject buttons are disabled. A sent disbursement cannot be rejected. However, the Void button is now available. This button allows me to void a disbursement after it has been sent. If the customer does not receive the money for some reason such as a bank error or the wrong payee address, I can void the disbursement and create a new one. Voiding is not necessary here, so I simply click Cancel. Now, I'll go back to the account summary. Here I see Total Unapplied is now empty. The overpayment has been fully disbursed to the customer. This concludes our demonstration on manual disbursements. This concludes our demonstration on manual disbursements. Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films of Films Thank you.\n\n--- Billing_16_02 ---\nIn this demonstration, I'll show how BillingCenter processes automatic disbursements. We will continue to use the Snyder & Associates account that we used in the previous demo. The financials pie chart is green, indicating the policy is already paid in full. Let's suppose there is a midterm policy change that results in a reduction in premium. The excess money from the reduction in premium will be automatically dispersed to the policyholder. First, I'll switch to Superuser to advance the clock by a month. I click the Internal Tools tab. Now I click Testing System Clock in the sidebar. I click the Add Month button to advance the clock. The clock has been successfully changed. Let's return to BillingCenter. Now, let's go to the policy. From here, I click the Actions menu button to open the Policy Change Wizard. I select Change Policy from the menu. The effective date looks fine and no special handling is required. I'll move to Step 2. I click Add to create a policy change billing instruction. The premium reduction is for $200. So I type negative $200 in the Amount field. I click Finish. The total field shows the negative amount in red. I click Finish again to complete the action. On the policy summary, we can see the policy has $200 in designated unapplied. Let's see what happens when the automatic disbursement batch process runs. I'll switch to Superuser to run the batch process. I click the Server Tools tab. I can see automatic disbursement in the list of batch processes. I click Run. Let's return to the Jeff Park browser to view the result. First, I click a link in the sidebar to refresh the browser. I click the Summary link to return to the policy summary. I can see the $200 amount remains in designated unapplied, so it has not been disbursed yet. Let's look at the disbursement. Disbursements are listed on the Account tab, so I click the Account link on the Info Bar. Now I click the Disbursements link. The $200 disbursement is listed, and has an approved status. But there is no entry for date paid. This means the disbursement has not been issued yet. In the Details area, I notice the date due is 2 days from now. The billing plan associated with the account controls various aspects of disbursement handling such as the number of days between the disbursement date and the due date. We'll discuss disbursement options later in the lesson. Meanwhile, I'll switch to Superuser to create the disbursement. I'll go to Internal Tools to advance the clock to the due date of the disbursement. I select Testing System Clock from the menu. I'll add 2 days to the testing system clock. The due date for the disbursement is September 6. To complete the change, I click Change Date. Now I'll run a batch process to send the disbursement. Here's the disbursement batch process at the bottom of the screen. I click Run. Let's take a look at the Account Summary screen. I notice Total Unapplied is now empty. The disbursement has been issued to the policyholder. This concludes our demonstration on automatic disbursements.\n\n--- Billing_16_03 ---\nIn this demonstration, we'll see how BillingCenter processes automatic disbursements that require approval. Here's the Snyder and Associates account from the previous demonstration. First, let's look at the billing plan fields that control automatic disbursement behavior. I'll go to the account details to find the billing plan for the account. Here is the link to the billing plan, BP01. I'll click the link. In the automatic disbursements area of the billing plan, we see disbursements over $500 require approval. Also, approval required is set to yes. These two options direct BillingCenter to create an approval activity for disbursement amounts over $500. Notice the days until payment created setting. This is the reason the disbursement in the previous demo was issued two days after the date the disbursement was created. Let's return to the account. The policy number is listed at the account. The policy number is listed at the bottom of the account details screen. I'll go to the policy summary so that I can simulate the policy change billing instruction. I click the Actions menu button. And select Change Policy from the menu. Let's go right to step 2. I click Add, to add a premium charge. Next, I click in the amount field. The amount of the premium reduction is $700, so I type in negative 700. I click Finish. The total field displays the amount in red. Looks good. So I click Finish a second time. Next, I click the policy summary. The policy summary shows $700 in designated unapplied. Now, I'll return to the account. I click the Disbursements link in the sidebar. The disbursements from the previous two demos are listed here. Let's switch to Super User to create the automatic disbursement. First, I'll advance the testing system clock by 2 days. The due date for the disbursements. The due date for the disbursement is September 8. I click Change Date. Now, I go to Server Tools to run the automatic disbursement batch process. I see Automatic disbursement in the list of batch processes. I click Run. Let's return to the Jeff Park browser to see the result. Here's the new disbursement. The disbursement has a status of awaiting approval. As we saw earlier, the billing plan has the approval required threshold setting of $500, so any disbursement greater than that amount will require an approval. There are three ways to approve disbursements. The first is to click Edit and then click Approve. I'll click Edit. The Approve button is enabled. Of course, the approval will be successful only if Jeff Park is authorized to approve a disbursement of $700. Instead of manually approving the disbursement, I'll click Cancel so I can show you the two other ways to approve the disbursement. I click the arrow icon on the Desktop tab. And I select Disbursements. The Disbursements screen by default shows all open disbursements from the past seven days. I'll click the Disbursement Reason link. On this screen, I don't need to go into Edit mode to approve or reject the disbursement. The buttons are already enabled. However, instead of approving the disbursement here, let's look at the third method. I click Cancel. To show the third approval method, I need to search for the Approval Activity. I click the arrow icon on the Search tab. And I select Activities from the list. On the Search Activities screen, I can select Approval as the activity pattern. And so I select Approval. I know the activity is assigned to Jeff Park. I click Select User to find the Jeff Park user. I type Jeff in the First Name field. I click Search to find the Jeff Park user. And now I click Select. I click Search to find all Approval activities assigned to Jeff Park. Here is the Approval activity for the $700 disbursement to Snyder & Associates. I click the Subject link. After a quick review of the activity details, I click Approve. Let's revisit the disbursement. To do this, I first go to the Account. I select Snyder & Associates from the list. Now I click the Disbursements link in the sidebar. On the Disbursements list, I can see the status of the disbursement is approved. From this point on, the disbursement process is the same for all approved disbursements, so there is no need to demonstrate that part of the process again. This concludes our demonstration of automatic disbursements that require approval. Filogy of the Disbursements  Filogy of the Disbursements  Filogy of the Disbursements     Filogy of the Disbursements                                          \n\n--- Billing_17_01 ---\nIn this demonstration, we'll add a third policy to the Adele Chi Sage's account. You are already familiar with this account from the examples in the lesson on account level billing. The purpose of the demonstration is to illustrate how the billing settings on an account and the periodicity of a policy together determine the invoice stream that is used in account level billing. Let's take a look at the billing information on the account details screen. This account uses account level billing, which means that policies paid by this account can share invoices. Under invoices. Under invoices. There are various settings for fixing invoice anchor dates. Because the policies paid by this account are invoiced monthly, the setting we're interested in is monthly policies, day of month, which is the fifth. BillingCenter uses this setting to assign the anchor date to the invoice stream. Now let's visit the invoice stream. As we know, the periodicity of the stream is monthly. Notice the anchor date for this monthly invoice stream. The invoice stream label default day of month is 5, as we expected. And, because this is not policy level billing, there is no overriding invoice day. Now let's look at the invoices to see how the invoice stream anchor date impacted the invoice dates. On the invoices screen, we see all the invoices have the same bill date, the fifth of the month. This is because the invoice stream has an anchor date of the fifth. Let's add a third policy. I clicked the actions menu button. And I select add policy to open the policy issuance wizard. First, I type in the policy number. This is a commercial auto policy. So I select business auto from the list of products. I click in the payment plan field. And I select PPO5, which is a twice per month plan. I click next, to go to step 2. I'll add the premium charge first. I click add. The charge amount is $12,000. I type in the amount. Next, I click add, to add a taxes charge. I click in the type field. And I select taxes as the charge type. The tax amount is $1030. I type in the amount. Now I click finish. Billing center calculates the total. I click finish again to complete the billing instruction. Let's first look at the invoice streams. The question we want answered is, will the new policy use the same invoice stream as the other two policies? The answer is, no, because a payment interval of twice per month requires a different periodicity from a monthly interval. So a second invoice stream, twice per month, has been added to the account. Let's look at it. Notice there are two anchor dates. These dates were set using the invoicing dates settings on the account details screen. Let's take another look at the account details. Notice the two values for twice per month policies. The two dates for twice per month policies are in contrast to the single anchor date for every other week policies. Every other week policies need only a single anchor date to use as a starting point for calculating invoice dates. Now let's revisit the invoices screen. On the invoices screen, we see lots more invoices. Let's filter on invoice stream to view only the twice per month invoices. I click the invoice stream field. And I select twice per month. The bill dates reflect the two anchor days from the invoice stream, the first and the 15th. We've seen that multiple policies can share the same invoices. However, the policies must have compatible payment intervals. A policy that is billed twice per month cannot be billed on monthly invoices. This concludes our demonstration on account level billing and invoice streams. This concludes our demonstration on the !\n\n--- Billing_18_01 ---\nIn this demonstration, I am going to add a general liability policy to the minor fleet management group. The premium will be paid by the management group, but the tax will be paid by the headquarters. Here's the minor fleet management group account. Let's create the policy. I click the Actions menu button. And I select Add Policy. First, I type in the policy number. Next, I click in the product field. Next, I click in the product field. I select General Liability from the list. Next, I click in the payment plan field. And I select PP12. Let's go to step 2. I'll add the premium charge first. I click Add. The premium charge is $16,200. I type in the amount. Next, I click Add. Next, I click Add. To add the taxes charge. I click in the type field for the charge. And I select taxes from the list of charge types. The taxes charge is for $1,200. Next, I type in the amount. I type in the amount. To change the payer for the tax. I'll click the search icon. I type M-I-N for the account name. Now I click Search. Here is Minor Fleet Headquarters in the search results. I select it. I click Finish. Let's go to the charges screen for the account. We can see the default payer for each of the two charges. The taxes charge is being paid by Demo 0610, which is the headquarters account, whereas the premium charge is being paid by Demo 0020, which is the policyholder. The taxes charge is being paid by Demo 0610. The taxes charge is being paid by Demo 0610. The charges screen allows me to reassign the payer of a charge, or even an individual invoice item for a charge. Suppose I want to assign a different payer to this invoice item. I simply click the checkbox next to the invoice item. And I click the arrow icon on the Assign Payer button. I can choose between an account payer and a producer payer. I choose Assign to Account. This screen lets me select a new payer and invoice stream, if the payer has multiple invoice streams. I can also decide how to handle invoice items that have been fully or partially paid. No change is needed, so I'll click Cancel to return to the charges screen. The charges screen has a filter for restricting the charges shown to those owned or paid by the account. First, I select Only Own & Pay. Selecting Only Own & Pay shows just the premium charge, because it is paid by the policy owner. Next, I select Only Owned. Only Owned shows all charges that are owned by the account, regardless of the payer. In this case, we see both the premium and the taxes charges. Let's see what the Only Payer filter does. Selecting Only Payer filters out the taxes charge because the Miner Fleet Management group is not the payer of the invoice item for the taxes charge. This concludes our demo on designating an alternate payer. Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Fil                           \n\n--- Billing_18_02 ---\nThis demonstration shows how to create a list bill account. Then it shows how to designate the list bill account as the alternate payer of a policy. In a production environment, the creation of list bill accounts is tightly controlled. A typical scenario is that a marketing or underwriting or finance group has thoroughly vetted the new list bill payer, before sending a request to the authorized billing person, who sets up the account. To create an account for this list bill demo, I first click the account tab. I click the actions menu button. Notice the actions menu shows just one option, new account. I select new account. I'll start by selecting the type of account. I select list bill, from the list of account types. Then I'll scroll up to show you the extra fields that are available only for the account. List bill accounts. Most accounts do not have payment plans or invoice streams associated with them. However, when I selected List bill as the account type, the user interface automatically displayed these fields for adding payment plans and invoice streams. Let's go back to the top, to fill in the required fields for the new account. For the account name, I'll enter Permapal. I type in Permapal Billing plan is the next required field. I click in the field And I select BP01 from the list of billing plans. Next is the delinquency plan field I select DP01 from the list of delinquency plans. Next, let's look at the invoicing dates fields For twice per month policies, there are two days of the month, 1st and 15th. This payment interval is typically used for synchronizing invoices with a company's payroll. Another required field is send invoices by I'll select email An account must have a contact. Let's scroll up so we can create the contact. I click Add to add the contact. And I select Add New Company I type in the company name, which is the same as the account name The address is 1 Elm Street I fill in the rest of the address. The city is Kingston And the state is Alaska Every account must have a primary payer. So I click Yes for primary payer Now I click OK Every list bill payer must have at least one payment plan. However, after the list bill account is created, I will be allowed to add more payment plans to it. I scroll up to the payment plan fields. And I click Add And I click Add Permapal needs only one payment plan with a twice per month payment interval. This is because Permapal matches the employer's payroll, which is paid on the 1st and 15th of every month. I'll add PP05, which is a twice per month plan. Finally, the list bill account needs at least one invoice stream. I click Add I click Add The default invoice stream periodicity is monthly. However, Permapal needs a twice per month invoice stream to match the payment plan. I select twice per month. I click OK to save the new invoice stream. And then I click Create account to save the new list bill account. On the account summary, notice there are no financials fields. As the message says, financials are available at the owner account level. Let's go to the account details screen. The supported payment plans link takes me to the payment plan associated with this list bill account. I click the link. PP05, which has a payment interval of twice per month, is the only associated payment plan. Let's go back to account details. I click the Actions menu button to view the actions that are available to a list bill account. I notice that the Actions menu does not have a menu item for adding a policy. This is because a list bill account is never a policyholder. It is only the payer of other policyholders' policies. Of course, in a production environment, no policies are created directly in Billing Center for any account. The purpose of a list bill payer is to pay policies. The purpose of a list bill payer is to pay policies. Adding Permapal as the designated payer of a list bill policy is our next topic. I click the arrow icon on the Account tab. And I select the Jeff Holmquist account. This account has a personal auto policy. Instead of paying for the policy directly, Jeff has arranged for his employer, Permapal, to deduct the payments from his paycheck. Initially, the policy was not created as a list bill policy. As we see, the billing method is Direct Bill, not List Bill. Let's see how to change the policy to List Bill with Permapal as the list bill payer. I click the details link in the sidebar. I scroll up to the billing method field. I notice the billing method field has a button that allows me to change the billing method, without going into Edit Mode. I simply click the arrow button on the billing method field. I select Change to List Bill. Here, I need to fill in the list bill payer, the payment plan, and the invoice stream fields. I can search for the payer. I'll search for accounts with names that begin with a P. Now I click Search. Permapal is the first account in the list. I select it. Permapal has only one associated payment plan and invoice stream, so filling in these fields is easy. I click Next. I click Next. On the policy details screen, we can see immediately that the billing method field is now List Bill. Let's go back to the Jeff Holmquist account. How many invoices do you think Jeff will have? Let's see. I click the Invoices link in the sidebar. The answer is, None. All the invoices are now on Permapal's invoice stream. However, Jeff does have charges. Let's take a look. We can see the invoice items for the premium charge. Permapal's account number is listed as the payer for each invoice item. I select the Taxes charge. The invoice item for the taxes charge is listed with Permapal as the payer. Now let's see Permapal's invoices and charges. I click one of the payer links. We'll look at the invoices first. The invoices screen shows all the invoices for Jeff's policy. Now we'll look at the charges. The charges screen shows both charges for Jeff's policy with the invoice items listed. Let's filter on Only, Owned. As we expected, the charges disappear. Permapal does not own any charges. This time, I select the Only Payer filter. Filtering on Only Payer causes both charges to be displayed with their invoice items. In a production system, a list bill payer is responsible for paying invoices for many policies owned by several different accounts. Instead of adding more policies to the list bill payer in this demo, I'll leave it to you to do during the lab. This concludes our demonstration of creating and testing a list bill payer. Filtering on Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering Filtering                                                                          \n\n--- Billing_19_01 ---\nThis demonstration shows where to find security information in the BillingCenter user interface about users, roles, permissions, authority limits, groups, and security zones. In BillingCenter, security information is located on the Administration tab. Currently, I'm logged in as SuperUser, so I can see all the security details. We're interested in the entries listed under Users and Security in the sidebar. Let's start with Users and search for Jeff Park, whose username is jpark. I click Search. The results show a summary of Jeff's security information. We can see he has three roles and he belongs to the Operations group. I'll click Jeff's display name to see his details. Jeff Park security details are displayed on three tabs. Basics shows general information. Notice Jeff's password is masked. Jeff's user roles are listed at the bottom of the page. Let's look at Jeff's authority limits. At the top, we see Jeff's authority limit profile is that of SuperUser. So this list of authority limits are those belonging to the SuperUser authority limit profile. As we would expect of a Billing and Finance Manager, Jeff has consistently high authority limits, which means he can approve several types of transactions up to $1 million. I'll click the Profile tab next. The Profile tab provides user details such as address, phone numbers, and email. Let's return to the Basics tab to examine one of Jeff's roles. I'll click Finance Manager. A Finance Manager has five pages of permissions. Page 1 lists permissions to approve, assign, create, delete, and edit several entities. After scrolling down, I see the remainder of permissions on this page. Let's look at page 2. Page 2 lists more added permissions. A Finance Manager also has permissions to own, reassign, and search for entities. Earlier we saw that Jeff's authority limit profile is SuperUser. I'll click the authority limit profile link in the sidebar to see what other authority limit profiles are defined in our sample data. Here is the list of authority limit profiles. We have already seen the SuperUser profile. Let's take a look at the low authority limit profile. In contrast to SuperUser, someone with a low authority limit profile requires approval for transactions over $100. Let's return to the list of authority limit profiles. Now let's look at TLTest, which is a set of low limits for the purpose of load testing. The first thing I notice is that the TLTest profile in our sample data has only a handful of authority limits. An authority limit profile contains only those authority limits that are needed for a set of users. We have looked at a user, his roles, and authority limit profile. Now let's visit groups. Here we see the groups, their supervisor and their parent group. Jeff Park is the supervisor of the operations group, whose parent group is headquarters. You can see a three-level group hierarchy, commercial lines and personal lines have central billing as a parent, which in turn has headquarters as its parent. Group supervisors play a significant role during the tiered approval process, where each supervisor has greater approval authority than the supervisor of a group lower in the hierarchy. To find out who belongs to a group, simply click the group name. Let's look at personal lines. Here we see the personal lines group has three members. Its parent is central billing and it is associated with the personal lines zone security zone. Notice, a group can be associated with a maximum of one security zone. However, a user can belong to more than one group. In this way, the user can access entities that are in different security zones. I click the link to the personal lines zone. I'll click the security zones link to see a list of security zones in this system. As you can see, a security zone has a name and description. In your lab, you will have the opportunity to enroll entities in a security zone to see how security zones restrict access. This concludes our demonstration on viewing security information in the Billing Center user interface. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy \n\n--- Billing_19_02 ---\nIn this short demonstration, we take a look at the Security Dictionary. The Security Dictionary describes security permissions and roles in BillingCenter, and the relationships among them. The Security Dictionary is generated initially when BillingCenter is installed. The dictionary can be regenerated at any time to reflect the current BillingCenter configuration. In the top left, we see the four types of information contained in the dictionary. Below the summary link, you see the list of application permission keys. Application permission keys are sets of permissions that BillingCenter groups together for performance reasons. I'll start by clicking the summary link. The right-hand pane shows permissions grouped by entity. It also shows the permission settings at the time the dictionary was generated. I can select a permission to view its description, permission name, and PCF references to the permission. For example, I'll click Account Close. I see the name of the permission is ACCT Close, and there are two PCFs where the permission is referenced. Next, let's click the Pages filter. The Pages section lists each PCF screen page in the user interface and the permissions needed to view or edit that page, if any. For example, I'll click Account Detail Charges. Here we see that a user needs two permissions to visit this page. Permission to view the Account tab and, permission to view Account Charges. I'll scroll up to Accounts. I click the Accounts link. The Account tab view permission is required to view and edit accounts. Without this permission, a user would never see the Accounts tab. Let's scroll back to the top of the page. Next, we'll look at System Permissions. I'll click the System Permissions filter. The System Permissions section of the Security Dictionary lists each permission, alphabetically by internal code. We just looked at the permissions for visiting Account Detail Charges. Now let's take a look at the permission that is involved. This is where we can see the roles that contain this permission, the application permission keys that contain it, and the pages and user interface elements that reference it. Let's see what permissions the Billing Manager role contains. All of the permissions for a Billing Manager are listed here. The final filter is Roles. I'll click the link. This time, let's look at the Billing Clerical role. Like the Billing Underscore Manager role, Billing Underscore Clerical has several permissions. You can see the Security Dictionary contains a lot of useful information about roles and permissions. Keep in mind that the Security Dictionary is a series of static HTML pages. If changes are made to the permissions in a given role, the Security Dictionary must be regenerated to reflect those changes. Users, groups, and security zones are not included in the Security Dictionary. They are part of the data model, which is described in another dictionary, the Data Dictionary. The actual users, groups, and security zones are simply data that is stored in the Billing Center database. This concludes our demonstration on the Security Dictionary.",
  "generated_at": "2026-02-13T12:10:21.817626"
}