{
  "chapter": "ch09",
  "chapter_title": "ClaimCenter Configuration",
  "domain": "claims configuration",
  "video_count": 36,
  "total_duration_seconds": 11634.19,
  "total_duration_formatted": "03:13:54.190",
  "total_words": 22132,
  "avg_confidence": 0.9322,
  "videos": [
    {
      "filename": "CC_01_01.mp4",
      "stem": "CC_01_01",
      "duration": "00:05:25.660",
      "words": 645,
      "confidence": 0.9353
    },
    {
      "filename": "CC_01_02.mp4",
      "stem": "CC_01_02",
      "duration": "00:03:29.980",
      "words": 428,
      "confidence": 0.9279
    },
    {
      "filename": "CC_02_01.mp4",
      "stem": "CC_02_01",
      "duration": "00:05:51.540",
      "words": 859,
      "confidence": 0.9599
    },
    {
      "filename": "CC_02_02.mp4",
      "stem": "CC_02_02",
      "duration": "00:07:33.260",
      "words": 773,
      "confidence": 0.9267
    },
    {
      "filename": "CC_03_01.mp4",
      "stem": "CC_03_01",
      "duration": "00:05:36.920",
      "words": 841,
      "confidence": 0.9556
    },
    {
      "filename": "CC_03_02.mp4",
      "stem": "CC_03_02",
      "duration": "00:02:55.940",
      "words": 499,
      "confidence": 0.947
    },
    {
      "filename": "CC_03_03.mp4",
      "stem": "CC_03_03",
      "duration": "00:16:10.520",
      "words": 1559,
      "confidence": 0.929
    },
    {
      "filename": "CC_04_01.mp4",
      "stem": "CC_04_01",
      "duration": "00:13:00.760",
      "words": 360,
      "confidence": 0.9323
    },
    {
      "filename": "CC_05_01.mp4",
      "stem": "CC_05_01",
      "duration": "00:05:18.400",
      "words": 632,
      "confidence": 0.9706
    },
    {
      "filename": "CC_05_02.mp4",
      "stem": "CC_05_02",
      "duration": "00:10:52.340",
      "words": 1037,
      "confidence": 0.8592
    },
    {
      "filename": "CC_06_01.mp4",
      "stem": "CC_06_01",
      "duration": "00:08:25.220",
      "words": 680,
      "confidence": 0.9377
    },
    {
      "filename": "CC_07_01.mp4",
      "stem": "CC_07_01",
      "duration": "00:06:05.260",
      "words": 579,
      "confidence": 0.8792
    },
    {
      "filename": "CC_07_02.mp4",
      "stem": "CC_07_02",
      "duration": "00:04:13.300",
      "words": 310,
      "confidence": 0.9406
    },
    {
      "filename": "CC_08_01.mp4",
      "stem": "CC_08_01",
      "duration": "00:05:11.340",
      "words": 708,
      "confidence": 0.8946
    },
    {
      "filename": "CC_08_02.mp4",
      "stem": "CC_08_02",
      "duration": "00:04:00.870",
      "words": 386,
      "confidence": 0.9347
    },
    {
      "filename": "CC_09_01.mp4",
      "stem": "CC_09_01",
      "duration": "00:02:09.480",
      "words": 299,
      "confidence": 0.9639
    },
    {
      "filename": "CC_09_02.mp4",
      "stem": "CC_09_02",
      "duration": "00:09:02.820",
      "words": 852,
      "confidence": 0.9292
    },
    {
      "filename": "CC_09_03.mp4",
      "stem": "CC_09_03",
      "duration": "00:03:01.360",
      "words": 704,
      "confidence": 0.9737
    },
    {
      "filename": "CC_10_01.mp4",
      "stem": "CC_10_01",
      "duration": "00:03:30.120",
      "words": 605,
      "confidence": 0.9131
    },
    {
      "filename": "CC_10_02.mp4",
      "stem": "CC_10_02",
      "duration": "00:03:53.080",
      "words": 434,
      "confidence": 0.9329
    },
    {
      "filename": "CC_10_03.mp4",
      "stem": "CC_10_03",
      "duration": "00:05:35.900",
      "words": 721,
      "confidence": 0.9479
    },
    {
      "filename": "CC_11_01.mp4",
      "stem": "CC_11_01",
      "duration": "00:04:14.620",
      "words": 496,
      "confidence": 0.9473
    },
    {
      "filename": "CC_12_01.mp4",
      "stem": "CC_12_01",
      "duration": "00:02:37.140",
      "words": 503,
      "confidence": 0.9492
    },
    {
      "filename": "CC_12_02.mp4",
      "stem": "CC_12_02",
      "duration": "00:06:56.840",
      "words": 672,
      "confidence": 0.9069
    },
    {
      "filename": "CC_12_03.mp4",
      "stem": "CC_12_03",
      "duration": "00:05:24.020",
      "words": 654,
      "confidence": 0.9596
    },
    {
      "filename": "CC_13_01.mp4",
      "stem": "CC_13_01",
      "duration": "00:04:04.620",
      "words": 941,
      "confidence": 0.9505
    },
    {
      "filename": "CC_13_02.mp4",
      "stem": "CC_13_02",
      "duration": "00:02:47.660",
      "words": 484,
      "confidence": 0.9194
    },
    {
      "filename": "CC_13_03.mp4",
      "stem": "CC_13_03",
      "duration": "00:03:15.500",
      "words": 663,
      "confidence": 0.9307
    },
    {
      "filename": "CC_14_01.mp4",
      "stem": "CC_14_01",
      "duration": "00:02:26.360",
      "words": 295,
      "confidence": 0.9218
    },
    {
      "filename": "CC_14_02.mp4",
      "stem": "CC_14_02",
      "duration": "00:02:36.660",
      "words": 246,
      "confidence": 0.961
    },
    {
      "filename": "CC_15_01.mp4",
      "stem": "CC_15_01",
      "duration": "00:05:19.040",
      "words": 626,
      "confidence": 0.9036
    },
    {
      "filename": "CC_15_02.mp4",
      "stem": "CC_15_02",
      "duration": "00:03:15.820",
      "words": 463,
      "confidence": 0.9163
    },
    {
      "filename": "CC_15_03.mp4",
      "stem": "CC_15_03",
      "duration": "00:04:23.540",
      "words": 362,
      "confidence": 0.927
    },
    {
      "filename": "CC_16_01.mp4",
      "stem": "CC_16_01",
      "duration": "00:05:10.540",
      "words": 716,
      "confidence": 0.9438
    },
    {
      "filename": "CC_17_01.mp4",
      "stem": "CC_17_01",
      "duration": "00:05:48.040",
      "words": 603,
      "confidence": 0.963
    },
    {
      "filename": "CC_17_02.mp4",
      "stem": "CC_17_02",
      "duration": "00:04:09.720",
      "words": 497,
      "confidence": 0.9183
    }
  ],
  "full_text": "--- CC_01_01 ---\nSucceed Insurance has specified that the persons involved section of a claim should have a page listing the officials associated with the claim. Information should include the official's name, title, and the number of any filed report. My first step will be to create a page called Claim Officials. In this demo, I shall create the page. I will add it to the UI in a subsequent demo. So, from the Configuration node, I expand Config. Config. Page configuration. Page configuration. Claim. Claim.  I will put the Claim Officials page in the parties involved node, so I right-click the node. And select New. PCF file. The file type of the PCF file will be Page. I will use a suffix of underscore SI for Succeed Insurance, so the full name of the page is Claim Officials underscore SI. I click OK to create the page. The page appears in red, because it has not yet been configured. A list of errors appears below. To begin configuring the page, I click its name. A title is required. I will use a display key, which I have created prior to this demonstration. Next, I create a variable to hold the page. I will hold the claim to which the officials are related. In the Variables tab, I click this button to create a new variable. The variable's name is Claim, with a small c. Its entity type is Claim, with a capital C. The page requires a panel ref to hold data. I click the panel ref icon. And then click in the page to drop a panel ref there. Note that when I add the panel ref, a screen is automatically created to contain it. The panel ref now needs a list view to display the list of officials. There is a list view in the Lost Details node that might serve the purpose. I double-click the editable officials list view to open it. This list view holds the data that is required, so I can use it. I return to the Claim Officials page. I click the panel ref to open its properties. In the definition property of the panel ref I enter the name of the list view, passing it the claim variable. I click the panel ref to open it. Users should be able to edit this list. I select the page. And set its can edit property. And its can visit property both to true. Next, I select the screen. And set its editable property to true. Then, I do the same for the panel ref. From the tool box, I select the edit buttons widget. And drop it into the screen. It is important that the edit buttons go onto the screen, not the page or the panel ref. The edit buttons do not require configuration at this time. Then I select an iterator buttons widget. And drop it onto the panel ref. The iterator buttons require an iterator, so I select them to open their properties. In the iterator property, I type the name of the list view, twice, separated by a period. Finally, I need to provide the page with an entry point, so that the user interface will be able to navigate to it. In the entry points tab, I create a new entry point. The entry point's name must match the name of the page. It needs a parameter to pass the claim to the page from the calling page. To see the layout of the page I have created, I step off it. And then back onto it. The page still has an error, because I haven't added it to a location group yet. I will not be able to see my work in the user interface until I've done so. That is the subject of the next demonstration. This concludes the configuring page components demonstration.\n\n--- CC_01_02 ---\nIn the previous demonstration, I created a page showing a list of officials. Now I need to add it to the UI. Note the red outline, indicating that this page has not yet been added to a location group. The page should appear on the Claim tab, so I navigate to the Claim Location group. The requirement is that it should appear under Parties Involved, so I double-click the Parties Involved Location group. Note that only two widget types appear in the toolbox. I click Location Ref. and drop it at the bottom of the Location group, below Users. The Location Ref appears in red, because its location property has not been configured. Similarly, it is labeled Null because its label property has not been configured. I click the Location Ref to open its properties. The value of the Location property is the one entry point, or signature, I created for the Claim Officials page. For the Label property, I will use the same Display Key I used for the Claim Officials page. If I now return to the Claim Officials page, I see that the red outline is gone, indicating that the page is fully configured. I also click the Location Ref to open its properties. I also see that the page displays a tab bar, and Actions menu, and a sidebar, indicating that the page is associated with a location group. Now I can test my configurations in the user interface. I log in as Andy Applegate. I'll navigate to the Ray Newton claim. In the sidebar, I expand the Parties Involved group. There is a link for the Claim Officials page, as expected. The page appears correctly as I configured it. There is an empty list, where I can add and delete officials. If I click the Edit button, the Iterator buttons appear. The Add button is available, so I click it. For the type of the official, I select Coroner. I give the Coroner a name. And enter the number of the Coroner's report. Now I'll add a Police Officer and a Police Report. If I now check the Select box for the Coroner, the Remove button becomes available. If I click it, the record is correctly removed. Clicking Update saves my work. If I now navigate to the Lost Details page, the Officials list displays the Police Officer I created. Though there are further tests I can and should perform in a real implementation, they are repetitive, and would be distractions from the main topic. This ends the Configuring Location Group Components demonstration.\n\n--- CC_02_01 ---\nThe ClaimCenter line of business model consists of six specialized type lists. The highest level of these type lists is loss type. The loss type ties together policies, coverages, and claims that deal with similar losses. In the base application, there are five loss types, auto, general liability, property, travel, and workers' compensation. Next is the LOB code, or line of business code, type list. This type list is more granular than loss type, and is mostly used for reporting purposes. It has a many to one relationship to loss type. That is, many LOB codes may refer to the same loss type. For example, the commercial property line and the homeowner's line both refer to the property loss type. The policy type type list refers to the same loss type. The coverage type type type list of specific products offered by an insurer. This has a many-to-many relationship to LOB code. That is, one policy type may refer to one or more LOB codes, and any given LOB code may refer back to one or more policy types. For example, the commercial package policy type. And the commercial property policy type both refer to the commercial property line of business. The commercial package policy type also refers to other lines of business. The coverage type type list. specifies something that a policy may indemnify. Again, this is in a many-to-many relationship with policy type. I'm going to skip to the sixth type list, exposure type, for a moment. Recall that an exposure is a pairing of a coverage and a claimant, which tracks potential payments for a claim. The exposure type in the LOB model determines the information to gather about each exposure. The coverage subtype is essentially a mapping between one coverage type and one exposure type. That is, it says this type of coverage can cover this type of exposure. The mapping need not be unique. The same coverage type and exposure type can be paired by more than one coverage subtype to handle different circumstances. Now, let's take a look at how the type lists of the line of business model work together in the data dictionary. Let's navigate down the list of type lists. To coverage type, which is a fairly typical example. Scrolling down, we can see a rather large collection of type codes. If we navigate to a typical type code, we see that each type code has a set of categories associated with it. These refer downward in the line of business model to the coverage subtype, and also upward to the policy type. Knowing whether a given category item refers upward or downward depends on familiarity with the line of business model. There is also a category for source system, the system from which the data about coverage types comes. This is typically a policy administration system. This appears on all the LOB types except loss type and exposure type. This is because loss type and exposure type are unique to claim center, while the other components of the LOB model are typically populated from an insurer's PAS, such as policy center. You can easily navigate from one level of the hierarchy to another by clicking on these categories. I'll navigate down to the coverage subtype, then back up to the coverage type, from there to a policy type. Commercial package has a lot of coverage types, but we'll continue on up to one of its associated LOB codes, and on up to a loss type. Now let's see how these lists are configured in Studio. If I expand a typical coverage type node, this one is accounts receivable for off-premises property. I see that it has three nodes beneath it, children, parents, and other categories. Expanding them. I see that these are the same categories I saw in the data dictionary. I'm currently looking at this in the line of business tab. If I switch to the type list tab, and expand a typical node. It just lists related type lists, without any division between the various types of category. Looking at the incoming categories tab, and expanding a node. I see that coverage subtype and policy type are not the only type lists that refer to coverage type. Cove term pattern, cost category, and line category all refer to this entry. While in the outgoing categories tab, we see that coverage subtypes, and policy types are visible here, but no others, because coverage type does not refer out or to any other type lists. Except, of course, for source system. This is not true for all line of business type lists. Policy type, for example, refers not only to lob code, coverage type, and source system, but to policy tab, but to policy tab, and internal policy type. Looking at loss type, it only has a children node, no parents or other categories nodes. Similarly, in the exposure type type code, there are parents and other categories nodes, but no children node. The other category here is an incident. An incident type is required for all exposure types. This concludes the exploring line of business type lists demonstration.\n\n--- CC_02_02 ---\nSucceed Insurance wants to capture additional information for electronics damage and theft. To this end, they have chosen to create a new exposure type, electronics, on the LOB model. As a result of this, electronics damage will no longer be associated with the vehicle damage exposure type. At first, this exposure type will be used for the existing AV and data equipment coverage on commercial auto. It may later be added to coverages on personal auto and homeowners policy types. First, I determine what I need to create. Looking at the commercial auto policy type. I see that there is an associated coverage type for audio visual and data equipment. I'll navigate to that coverage type. And look at its children. There is a coverage subtype that maps to the vehicle damage exposure type. This is not what is needed. So I navigate to the coverage type. coverage subtype. And I retire it. Note that I retire the coverage subtype, rather than the child exposure type. This is because the coverage subtype is a unique pairing of coverage type and exposure type. The exposure type, on the other hand, may be used by other coverage types, by another coverage subtypes. The requirement calls for a new electronics exposure type, so I navigate to the exposure type type list. Here I create a new exposure type. The value of the code property is electronics, with a small e. I append the underscore si suffix to mark this as a succeed insurance extension. The display name is electronics, with a capital E. The value of the code property. And the description is electronics damage or theft. An incident type is required. I select mobile property incident. For the exposure to be available to GOSU code, I must recompile the exposure type list now. Now I must map the coverage type to the exposure type with an appropriate coverage subtype. Returning to the coverage type. I create a new child node. I give it the code BAElectronics, with the si underscore suffix. The name is BAElectronics Theft or Damage. The new coverage subtype appears in red, indicating that there is an error in its configuration. A description of the error appears below, telling us that the coverage subtype needs to be connected to an exposure type. So I will connect the coverage subtype to an exposure. I have already created the electronics exposure type, so there is no need to create a new type code. I click select type code. And select the electronics exposure type. This removes the error. Now I have to configure the helper object called exposure UI. I expand the GSRC node. And the libraries node. And open exposure UI. I need to add the electronics exposure type to this block of logic, which creates a new incident when the exposure is created. This logic is triggered when the exposure type is one of a list of exposure types. So I select one of them and copy it. Then I place the cursor at the beginning of the line in the block of exposures. And paste the line I copied. Now I simply change the exposure type to TC underscore electronics underscore SI. And paste the line in the block of the UI. And paste the line in the block of the UI. At this point it is a good idea to explicitly save my work. I need to display the details of the incident type. I drill down on page configuration. PCF. Claim. And new exposure. Exposure. I look at the existing general damage mode of the new exposure detail view. It contains the data needed for the electronics exposure. So I copy it. And paste a copy into the same node. I type the name of the mode, electronics underscore SI. And save the new PCF file. Once again, I'll save my work. Now I start the server in debug mode. When it is started, I navigate to Claim Center to test my configurations. I log in as Andy Applegate. I will search for a commercial auto claim. I'm searching for an insured company named Bison Trucking. One claim appears, so I select it. Now I'll use the Actions menu to see if I can create a new exposure for the electronics coverage type. The BA Electronics Theft or Damage Coverage subtype is available. It appears under A because the parent coverage name begins with A. This coverage subtype is its only child, so it gets promoted and appears under A. I create the exposure, and the new exposure electronics screen appears. This ends the configuring lines of business demonstration.\n\n--- CC_03_01 ---\nIn this demo, I'll review claim intake from a user's perspective, and at the same time take a look at it from behind the scenes in Studio's PCF files. I'm logged on as Darlene Olson, an adjuster. I receive a call from Jennifer Albee at Lennar Construction, reporting that a worker has been injured, so I start a new claim. Notice, by the way, that the title says that this is step 1. I search for the Lennar Construction policy. There is only one policy matching this search, so it is automatically selected. Because it is a worker's compensation policy, the header changes, indicating that this is step 1 of 4. I'll type CTRL-SHIFT-I to view the details of the PCF behind this step. The screen I am viewing is part of the new claim wizard, also called the FNAL wizard. The screen is the FNAL wizard underscore find policy screen. Note that the naming can be used as part of the new claim wizard, also called the FNAL wizard. The convention for the screens in a wizard is wizard name underscore screen name. Let's look at this in Studio. Looking at this screen, I notice some fields called shared section modes, which I'll explain in the next demo. But what I want to show you right now, is that, if I select search in this field, I now see the fields I saw in the UI. Speaking of the UI, Ms. Albee tells me that the injury occurred at the beginning of today's morning shift, at 8am. Moving on to the next page of the new claim wizard. The injury occurred at the company's headquarters. Ms. Albee is the supervisor of the injured employee, 1 Edward Teach. I add Mr. Teach. I add Mr. Teach as the injured employee. Ms. Albee has also provided me with a total of statements, Mr.Teach's social security number. I'll type Alt Shift I again. I'm still viewing the FNUL wizard, and now the screen is the basic info screen. At this point, I want to show you the structure of the wizard itself. I open FNULwizard.pcf. Structurally, a wizard is simply a list of steps. A wizard has some interesting properties. The first is menu actions. You may recall from location groups that this defines the actions menu that will appear. It also has the standard claim info bar and tab bar. The cancel warning property specifies the text of a pop-up message that appears if you cancel the claim before finishing the wizard. This message should be stored as a display key. The wizard goes through the steps in order. You can create step sets that group steps, so that you can make them available or unavailable together. The full wizard step set is the main body of the FNUL wizard. Note that its visibility property is true only if the old wizard step property is false, which is the default. This exists for backwards compatibility. Within the step set, the individual steps have their own visible and available conditions. The only step for which these do not simply default to true is the services step, which does not make sense for some policy types. The services step determines its availability by a property coded in the wizard. The code for a servicer's step available checks against a list of lost types for which a services step makes sense. In the base configuration, these include auto and property. Each step in the wizard has a screen property. This identifies the signature of a screen which will be displayed when the wizard reaches that step. Each step also has a title property, which references a display key. Note that this display key takes variables that reference the current step number and the total number of steps for the wizard. Finally, let's look at two special types of step. The first is the quick claim step. A quick claim step bypasses the normal set of steps and inputs the essential information on one screen. The quick claim step has a property called condition, which determines whether it is available. For example, the quick claim auto step is available only if the loss type is auto. The decision to use the quick claim step is made by the user in the first step of the wizard. Some steps are independent of the wizard's built-in sequencing. They are available from anywhere in the wizard, except for the first step, where the policy is found. Independent steps have their independent property set to true. Independent steps are usually grouped in a special step set called an independent wizard step set, which appears at the end of the wizard steps. Grouping in this manner is a recommended standard, but not required. Any step marked as independent will be an independent step. The independent steps for the FNAL wizard include parties involved, policy, documents, and notes. This concludes our tour of wizard structure, so I'll cancel the claim now. This ends the wizard structure demonstration.                  DEMONSTRATION  DEMONSTRATION           DEMONSTRATION Thank you.\n\n--- CC_03_02 ---\nIn the previous demo, I promised to explain shared section mode fields. I start a new claim. Note the radio buttons labeled Find Policy and Create Unverified Policy. These are two different modes of this screen. The default mode is Find Policy. If I select the Create Unverified Policy button, the screen changes, allowing me to enter information about an unverified policy. If I click the Find Policy radio button, the screen returns to the default mode, Find. Let's look at how this works in Studio. We are looking at the FNUL wizard. The screen I was just looking at was the Find Policy screen. I'll double-click to open it. Recall that the main panel ref with this view includes a shared section mode field. If I click it, I have a choice between Create and Search modes. Create is the default, but if I click Search, the Search mode, which is the default in the UI, appears. Let's look at the definition of the panel ref. The definition of the panel ref is a panel set, the FNUL wizard Find Policy panel set. If I scroll down to take a look at that file, I see that there are actually two, one with the suffix, Create, and one with the suffix, Search. These suffixes define the possible modes of FNUL wizard Find Policy panel set. Logic on the panel ref determines which mode is displayed. The panel ref has a mode property. Depending on the value of page mode, a Boolean variable of the wizard, the value of this property will be either Search or Create. The value of the mode property must match the mode suffix of one of the PCF files that match the panel ref's def property. Let's look at a slightly more complicated example. If I return to the FNUL wizard, and look at its Lost Details step. I note that the step itself has a mode property. The mode property must return a text value, in this case, the claims lost type. This is determined by GOSA code that would simply be a distraction at this point. If I look at the screen property of the step, I see that it refers to FNUL wizard underscore new lost details screen. If I look at FNUL wizard underscore new lost details screen, I see that it has five modes. Four of them match the type codes for lost type, GL for general liability, PR for property, TRAV for travel insurance, and DUB-C for workers compensation. The fifth mode is default. The default screen is displayed if the mode property does not match any of the other modes, in this case, any lost type, such as auto, other than the four specified modes. Having a default mode ensures that no possible value of the mode property will go unmatched and cause a runtime error. Wizard step sets also have a mode property. However, that property is seldom used. This ends the modal PCF basics demonstration.\n\n--- CC_03_03 ---\nAt Succeed Insurance, there is a concern that the loss details step of the FNEL wizard for automobile claims is too long and may be an inconvenience for users. I'll start a simple auto claim to show you. We can see that the screen does not fit easily on most monitors. To mitigate this, it has been decided to move the At The Scene section to a separate screen. Fortunately for this demo, the At The Scene section appears only in the default mode of the Loss Details screen, that is, for auto losses. So I will have to make sure that the At The Scene screen appears only for auto claims. First, I need a pair of display keys for the screen I'm creating. One for the screen label, and one for the screen title. I'll give them the SI, for Succeed Insurance, prefix. The label simply names the screen. The title appears at the top of the wizard step and shows the step number and the total number of steps. The next thing I need, is a screen that contains just the At The Scene section. The easiest way to do this, is to copy the default mode of the Loss Details step. Paste a new copy. And give it a new name, making sure to remove the default mode from the name. The next thing I need, is to copy the Loss Details screen. Now I'll remove everything except the toolbar in the At The Scene panel. Now I'll open the default mode of the Loss Details step. And remove the At The Scene panel. Now in the Fnull wizard itself. I need a new step after the Loss Details step. I'll copy the existing Loss Details step as a sort of template, and modify it. I'll paste the copy. Directly below the original. In the Screen property, I'll replace the Loss Details screen with the At The Scene screen. For the title and label properties, I will use the display keys I created earlier. Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Every step in a wizard needs a unique ID property. Now I will clear a few properties of the Lost Details step that the much simpler at the scene step does not need. The at the scene step should be available and visible only for auto claims. Now I can test my work in the user interface. First I will press Alt Shift L to refresh the PCF files. To test the changes I have made to the wizard, I create a new claim. In the Policy Number field, I enter a known personal auto policy. In the Date field I select today's date. When I click Search, because the search returns a single policy, it is automatically selected, and its details displayed. And the at the scene step is visible, though I cannot navigate to it yet. Moving on to the next step. I'll quickly select a reporter. In the next step, I'll enter a description. And select a lost cause. And a location.  Now I can navigate to the at the scene step by clicking Next. The step looks right so this part of the test is successful. I don't need to go any further with this claim. So I'll cancel it and continue testing. To verify that the step only appears for auto claims, I will begin to create a workers' compensation claim. I enter the policy number of a known workers' compensation policy. And select today's date. Now when I click Search, The at the scene step is not visible, which is as it should be. So I'll cancel the claim. In a real implementation, I would test against other policy types, including commercial auto, where the step should appear, and any other policy types offered by the insurer, where the step should not appear. But for the purpose of this demonstration, we are done. This concludes the configuring the FNEL wizard demonstration. At Succeed Insurance, there is a concern that the lost details step of the FNEL wizard for automobile claims is too long and may be an inconvenience for users. I'll start a simple auto claim to show you. So, so              so so so       so    so  so so            so  so      so     so   so   so    so       Thank you. We can see that the screen does not fit easily on most monitors. To mitigate this, it has been decided to move the At the Scene section to a separate screen. Fortunately for this demo, the At the Scene section appears only in the default mode of the Lost Details screen, that is, for auto-losses. So I will have to make sure that the At the Scene screen appears only for auto-claims. First, I need a pair of display keys for the screen I'm creating. One for the screen label, and one for the screen title. I'll give them the SI prefix. The label simply names the screen. The title appears at the top of the wizard step and shows the step number and the total number of steps. The next thing I need... ...is a screen that contains just the At the Scene section. The easiest way to do this... ...is to copy the default mode of the Lost Details step. Paste a new copy... ...and give it a new name, making sure to remove the default mode from the name. ...and remove the At the Scene panel. Now I'll remove everything except the toolbar in the At the Scene panel. Now I'll open the default mode of the Lost Details step. ...and remove the At the Scene panel. Now in the Fnull wizard itself. I need a new step after the Lost Details step. I'll copy the existing Lost Details step as a sort of template, and modify it. I'll paste the copy... ...directly below the original. In the Screen property, I'll replace the Lost Details screen with the At the Scene screen. For the Title and Label properties, I will use the display keys I created earlier. ...I'll be happy to see you next time!                 Every step in a wizard needs a unique ID property. Now I will clear a few properties of the Lost Details step that the much simpler at the scene step does not need. The at the scene step should be available and visible only for auto claims. Now I can test my work in the user interface. First I will press Alt Shift L to refresh the PCF files. To test the changes I have made to the wizard, I create a new claim. In the policy number field, I enter a known personal auto policy. In the date field I select today's date. When I click search, because the search returns a single policy, it is automatically selected, and its details displayed. And the at the scene step is visible, though I cannot navigate to it yet. Moving on to the next step. I'll quickly select a reporter. In the next step. I'll enter a description. I'll click the location. I'll click the location. I'll click the location. And select a lost cause. And a location. Now I can navigate to the at the scene step by clicking next. The step looks right so this part of the test is successful. I don't need to go any further with this claim. So I'll cancel it and continue testing. To verify that the step only appears for auto claims, I will begin to create a workers' compensation claim. I enter the policy number of a known workers' compensation policy. And select today's date. Now when I click search. The at the scene step is not visible, which is as it should be. So I'll cancel the claim. In a real implementation, I would test against other policy types, including commercial auto, where the step should appear. And any other policy types offered by the insurer, where the step should not appear. But for the purpose of this demonstration, we are done. This concludes the configuring the FNEL wizard demonstration.\n\n--- CC_04_01 ---\nSucceed Insurance has specified that, if at least a third of the persons in the work group are on vacation, which should not happen very often, then that group will not be assigned any new claims. This rule should not apply to groups with less than three persons. In Studio, I navigate to the rule sets. The appropriate triggering event is exception. Exception rules target claims, activities, users, and groups that need some type of special attention. Activity exception rules run automatically when an activity is escalated. Let's look at a typical activity exception rule. For example, this rule becomes active when the priority of an escalated activity is high. When this happens, it sets a flag on the activity. Conversely, claim, group, and user exception rules operate on a schedule. When they run, they scan for conditions that may apply to any given claim, group, or user. For example, if there is an open claim, where the claims assign user does not have any open activities assigned to them. Then this rule will create an activity for the user to review the claim. I need to automatically create an activity based on the vacation status of the users in a group, so I will create a group exception rule. In the default configuration, these rules are checked daily at 4 am. There are no group exception rules in the default configuration. I will create a new one.  I will leave the default condition of true, so that every group will be checked every night. The group is already available as a parameter. The first thing I need is the number of users on vacation. I will derive it from the properties of the group. I will need to compare that number to one third the number of users in the group. I will also check to make sure that there are at least three members in the group. Bye! Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you.\n\n--- CC_05_01 ---\nIn this demonstration, I will show how to assign an object using automated assignment, and how to assign an object explicitly to a specific user. Darlene Olson, an adjuster in a workers' compensation group at Succeed Insurance, receives a call from Jennifer Albee. Note that there are no activities in Darlene's activities list. She's reporting an injury accident on behalf of Georgetown Roofing. The accident took place today at about 8.30 a.m. Ms. Albee is a manager in Georgetown's Human Resources Department. The injured worker is named Joe Thornsby. Ms. Albee has also provided Mr. Thornsby's Social Security Number. Mr. Thornsby was clearing out the roof gutters at Georgetown's premises when he fell off a ladder. He had begun work at 6 this morning. Mr. Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil accident took place at Georgetown Roofing's main office. Mr. Thornsby appears to have a broken tibia. Darlene quickly enters what is known about the injury at this time. Mr. Thornsby's leg required medical attention. An EMT crew evaluated him, splinted his leg, and took him to hospital for x-rays. It is expected that he will miss some work time, though the actual time is not yet known. In the lost time tab, Darlene enters details. Mr. Thornsby earns $16.25 per hour, 8 hours a day, 5 days a week, equal to $660 per week. That is all the information Ms. Albee provides to Darlene at this time, so she will go ahead and complete the entry of the claim. Darlene uses automated assignment to assign the claim. She could also use search to assign the claim to a specific person. The claim has been assigned to a group, Comp, Team B, and to a user, Candice Payne. Darlene can now view the claim. Although the claim has been assigned to another adjuster, Darlene is going to go ahead and make the initial contact with the medical provider. Looking at the work plan for the claim, she finds the activity to contact the provider and clicks its checkbox. Darlene is going to assign the activity to herself. Rather than using automated assignment, which would assign the activity back to Candice Payne, she selects her own name from the list of eligible users and clicks Assign. When Darlene returns to the activities list on her desktop, we see that Darlene has one activity, though it is not due today. But if she looks at a week, the activity now appears. This concludes the assigning entities in the user interface demonstration.\n\n--- CC_05_02 ---\nSucceed Insurance has two requirements that will require assignment by rules. The first requirement is that claims with a lost location in Quebec should be assigned to a French speaking agent. The best way to accomplish this is by using user attributes. Before I can use a rule to assign a claim to a French speaker, I need to create a French speaking attribute and associate it with the user. On the attribute administration page, I add an attribute. I'll name the attribute French. Give it a description. And mark it as type language. Our French language speaker is Heidi Johnson. On Heidi's attributes tab. On Heidi's attributes tab. I'll add the French attribute to her attributes list. I'll add the French attribute to her attributes list. I'll log out a super user. Then I will be ready to create the assignment rule that completes the implementation of this requirement. Since it assigns a claim to a specific user, this will be a default group claim assignment rule. So I will create a new rule.  So I will create a new rule.  So I will create a new rule. purposes, I need it to fire before the built-in rules. For the condition, I want this rule to fire if the claim's lost location is in Quebec. The rule action is a bit more complex. To assign by attributes, I need a list of criteria. This is implemented as an entity called attribute-based assignment criteria, which I will create as a variable here. Each criterion is implemented as an attribute criteria element. I will create one and call it French speaker. I need to set its values based on what I created in the administrative data. The type of the attribute is language. I need to set its values based on what I created in the administrative data. The type of the attribute is language. I put French in the name field. I need to set its values based on what I created in the assigned group. Now I can add the criteria element to the attribute criteria. If a French speaker is found in the assigned group, the rule will assign the claim to that user. If you need to excel within the triangles, you need to excel within the triangles.  If you need to excel within the triangles, you need to excel within the triangles. If you need to excel within the triangles, you need to excel within the triangles. If you need to excel within triangles, you need to excel within triangles. If you need to excel within triangles, you need to excel within triangles. If you need to excel within triangles, you need to excel within triangles triangles. If you need to excel within triangles triangles, you need to excel within triangles triangles triangles,    and exit the rule set. If no French speaker is found, the rule will assign the claim to the group's supervisor. The rule is complete. To test it, I restart the Claim Center server. When the server is started, I log in as Andy Applegate. Now I'll navigate to one of my claims. And change the lost location to the province of Quebec, in Canada. I'll also have to change the city. From the Actions menu, I'll reassign the claim. Heidi Johnson, the French speaker, has been correctly assigned. Not all rule-based assignments are performed in the assignment rules. The work plan rules create and assign activities when a claim, exposure, or matter is created. The second requirement involves workers' compensation claims. When an agent creates a workers' comp claim, the Claim Center-based configuration creates three three-point contact activities, which are assigned to the claim owner. Succeed Insurance wants the activity for contacting the medical provider to be assigned to the claim creator, so that the preliminary medical details can be completed as quickly as possible. So I'll change the assignment to the assigned user, to the claims creating user. To test my work, I'll restart the server. When the server is fully started, I log in as Andy Applegate. Here, I create a new worker's compensation claim. I will search for the insured company, Hard Hat Construction, and select Today as the law state. When I click Search, Claim Center returns a single relevant policy, so I click Next to continue. The reporter is a new person. I'll input their name and social security number. In this case, the injured worker reported their own injury. I'll quickly enter some minimal details about the accident. the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident of the incident I will use automatic assignment. Since Andy Applegate is in an auto group, he will not be assigned to a workers compensation claim. The claim is assigned to Darlene Olson, an adjuster in a comp group. However, when I view the claims work plan, I see that the claim has been assigned to Andy Applegate, the claim creator. This concludes the assignment methods demonstration.\n\n--- CC_06_01 ---\nIn this demonstration, I have two requirements. The first is to ensure that an auto claim cannot be saved at the new loss level without a value entered in the fault rating field. First, I will create a new display key. The display key informs the user that fault rating must be specified. Theountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountount I'll put my demo rule at the top of the list, so it will fire first. The rule will use the display key I created, so I need to import the display key module. This rule only applies to auto claims, where the fault rating is not set by the user. I will use the claim reject method, throwing an error at the new loss level. The display key I created will be displayed for the error. There is no warning level for this rule. The second requirement is that a null weather field on an auto claim should result in a warning, and should prevent the claim from being paid out. Also, in these cases, the weather field should be highlighted. I will need two display keys for this requirement. The first display key is for the warning. And the second one is for the error message. Now, I will create another claim validation rule. As before, I need access to display keys. Once again the rule applies to auto claims. But in this case, it's the weather field we're testing for now. This time I will use the reject field method, so the specific field will be highlighted as per the requirement. The error level is TC underscore payment. The error level is TC underscore payment. The error level is TC underscore new loss. Now, to test the rules, I will start the Claim Center server. Then, in Claim Center, I log in as Andy Applegate. Now, I'll create a new auto claim. I'll search for an insured party named Xu. With today is the lost date. I'll quickly enter the most basic information. Filogy of the ! Filogy of the Filogy of the Filogy of the                Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the    Filogy of the Filogy of the   Filogy of the Filogy of Filogy of Filogy of Filogy of As Andy, I'll assign the claim to myself. And look what happens when I attempt to save the claim. I get the error for the fault rating, and the warning for the weather. Note that the weather field is highlighted in red. So I'll fix the fault rating, which is causing the error. This time, when I click finish, the claim is saved. So I will navigate to the claim. And on its status screen, I see that the claim cannot be validated past the Send to External System validation level. In the Actions menu, I validate the claim. At the ability to pay validation level, to see where the problem is, I see the error message about the weather field. When I click the error, Claim Center automatically navigates me to the Lost Details screen, where the weather field is located. I'll clear the error message. And edit the claim. So I can set the weather field. Then, when I save the claim, and return to the Status page, the claim is now at the ability to pay validation level. This concludes the Creating and Verifying Validation Rules demonstration. Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Filogy Fil administration.\n\n--- CC_07_01 ---\nSucceed Insurance has determined that there is a higher incidence of problems with claims from the assigned risk pool. For this reason, Succeed wants to flag all such claims. To accomplish this, I will create a claim pre-setup rule that flags these claims. I'll give the rule a descriptive name. To accomplish this, I will create a claim. The rule will create text, so the best practice is to use a display key. The rules should be triggered by Auto-Claims.  The rules should be triggered by Auto-Claims. Where the policyholder comes from the Assigned-Risk Pool. Assigned-Risk is a Boolean property on policy. The rule must set the claim's flag type key to is underscore flagged. It is also best practice to indicate the reason for the flag. There is an existing display key that will do the job. Now I will save my work. And start the claim center server to test the rule. When the server is fully started, I log on to claim center as Andy Applegate. I'll create a new auto claim. I will make it an unverified policy so I can set the terms myself. I'll give it a policy number that matches Succeed Insurance's standard format. The type of policy is personal auto. I'll set the loss date to today. I'll set the policy number.  Before I set any other terms, I will make this an assigned risk policy. I need to create a policy holder. I'll give the policy holder a name. I'll give the policy number. I'll give the policy an effective date at the beginning of last month. I'll give the policy number one of those dates. I'll give the policy number one of those dates. I'll give the policy number one of those dates.  I'll give the policy number one of those dates. I'll give the policy number one of those dates. I'll give the policy number one of those dates. I'll give the policy number one of those dates. I'll give the policy number one of those dates. I'll give the policy number one of those dates. I'll give the policy number one of those dates. I'll give the policy number one of those dates. I'll give the policy number one of those dates. I'll give the policy number one of those dates.  So I'll give the policy number one of those dates.     Now I will add a vehicle. I will give the vehicle a make and model and provide a model year. Now I'll add a coverage so there's something for the policy to do. The natural choice for a single coverage is collision. I'll give an exposure limit of $50,000 and the same for the incident limit. Now I'll save the vehicle and proceed with creating the claim. The policyholder is the reporter and their only vehicle is involved. I'll add a quick description of the accident. I'll add a loss cause and select a loss cause that matches the description. I'll provide an address where the accident happened. I'll set the fault rating. And the weather. That's all the required info, so I'll quickly finish out the claim. As Andy Applegate, I'll assign the claim to myself. And I save the claim. If I now view the claim, I see that it is flagged. Hovering over the flag I can see that the reason for the flag is that the policy is assigned risk. This concludes the pre-setup rules demonstration. This concludes the pre-setup rules demonstration.\n\n--- CC_07_02 ---\nSucceed Insurance has an optional foreign coverage for auto claims. When a claim takes place in a foreign country and the policy does not have this coverage, things can get complicated, so they want every such claim segmented as high complexity, even if it's just glass breakage. I will create a claim segmentation rule to implement this requirement. The rule will go under the Auto Parent rule, which filters for claims where the loss causes auto. I will give the rule a name reflecting its functionality. I will ensure that this rule is the first to execute in the Auto Group. There are two conditions for this rule to fire. The first condition is that the claim being segmented occurs outside the US. The first condition is that the claim being segmented occurs outside the US. The second is that the policy does not include the foreign coverage option. The action of this rule is simple, it segments the claim as high complexity Auto. When this rule is done, we don't want any further segmentation rules to run on this claim. To test the rule, I'll reload the changed class. Now I'll log into Claim Center as Andy Applegate. I'll quickly create a new Auto Claim. I'll quickly create a new Auto Claim. I'll use Robert Farley's policy. Now, if I look at the policy. I see that the policy does not have the foreign coverage option selected. Returning to the claim, I'll keep things as simple as possible. I'll keep things as simple as possible. I'll place the accident in Canada.   And that's all the information I really need to test this rule. I'll assign the claim to myself. Now I can view the new claim. Looking at its status page, I see that the claim is segmented properly as auto, high complexity. This concludes the segmentation rules demonstration.\n\n--- CC_08_01 ---\nIn some circumstances, a legal matter becomes a hearing before an administrative law judge, or ALJ. The ALJ role must be added to ClaimCenter, and to matters. There can only be one ALJ for a given matter. I begin by adding the role to the Contact Role Type List, which specifies the possible roles for a contact. I add a new type code. I give it a short code, using the suffix underscore SI, for succeed insurance. Both the name and description properties will be Administrative Law Judge. I add a new type code. The contact role category type list categorizes contact types for filtering purposes. Administrative Law Judge should be categorized under litigation. The litigation type code is already selected, so I click Next. The Contact Role Category Type List is selected, but I need the Contact Role Type List, so I click the up key. In the Category List, I select ALJ underscore SI. And click Finish. Entity role constraints define what kind of contacts can have what kind of roles. To configure entity role constraints for the ALJ, I navigate to the Entity role constraints config.xml file. I type left bracket, C and select Contact Role Type Constraint. When I select Contact Role Type Cone Tron, two properties appear. For the Contact Role Code property, I enter ALJ underscore SI. And for the Contact Subtype property, I enter Adjudicator, remembering to close the tag with a backslash. Now I have to add the code to the Matter entity, so I scroll down to find it. Again, I will preserve alphabetical order by placing the ALJ at the top. I add a new Role Ref tag, using ALJ underscore SI as the code. Now I type left bracket R and select Role Constraint. For the Constraint Type, I enter Exclusive, indicating that only one contact may have this role. I end the tag with a backslash. To test my work, I start the Claim Center server in debug mode. When the server is started, I log into Claim Center as Andy Applegate. I navigate to a claim. And on its litigation page, I see that there is an existing matter. Now I navigate to the contacts list. I will create a new contact as an adjudicator. I want to assign a new contact the role of Administrative Law Judge. But I can't. The Administrative Law Judge role does not appear on this list. This is because I am trying to relate it to the claim, and the ALJ role can only be related to a matter. If I change the Related to field so that the role will be related to the matter. The Administrative Law Judge role is available. I select it. I fill in the one required field, the last name. And click Update. Now I'll try adding another ALJ. Once again, I will give the new contact the Administrative Law Judge role, related to the matter. A last name is required. Now, when I click Update. An error message indicates that there can only be one ALJ associated with a given matter. This is because of the exclusive constraint I placed on ALJ. I will be able to add a new contact. So I'll just cancel the new contact. This concludes the Adding a Claim Contact role demonstration. Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of Filogy of the Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of \n\n--- CC_08_02 ---\nSucceed Insurance requires that any administrative law judge, or ALJ, associated with the matter should be displayed in the Hearing Details section of the Matter screen. This means that I need to add a Claim Contact widget to an existing view. The first step is to navigate to the matter I used in the last demonstration. Here is where to place the ALJ widget, at the bottom of the Hearing Details section. Now I'll type Alt Shift I to view the details of this page. The view I need to edit is the Matter Details detail view. Now I'll close this info page. So in Claim Center Studio, I navigate to the Matter Details DV. I'll add a Claim Contact Input widget. And place it at the bottom of the Hearing Details section. The widget must have a locally unique ID. The widget should be associated with the claim associated with the current matter. The widget should be associated with the claim associated with the current matter. Users should be able to edit the ALJ from this page. To avoid conflicts with existing matters, the ALJ field will not be required. I need a display key for the widget's label. Now I'll add the display key to the widget's label property. The value to be displayed in the widget is the ALJ associated with the matter. The range of possible values from which the ALJ can be chosen is the virtual list of all the adjudicators associated with the claim. The value type must be changed to the adjudicator. And the value type must be changed to adjudicator. Now I'll save my work so that I can test it in the user interface. Here I am logged in as Andy Applegate, and I have already reloaded the PCF files. I navigate to the parties involved page. Here I'll delete the existing administrative law judge. Now I'll navigate to the litigation page. Now I'll navigate to the litigation page. I'll edit the existing matter. There are no adjudicators available to fill the ALJ role. So I will create a new one. When I save the adjudicator. And the matter. The new ALJ is visible. The new ALJ should also appear on the parties involved list. And she does. This concludes the adding a claim contact widget demonstration.\n\n--- CC_09_01 ---\nLet's examine the life cycle of a check set with one check. First, I'll log into ClaimCenter as Andy Applegate. Now I navigate to a claim which is at the ability to pay validation level. If I look at the financials, I can see that $2,500 has been set aside for auto body work related to Exposure 1. The car is being worked on by Frank's Car Repair. When the work is done, I receive an invoice for $1,900. I must issue a check for this amount. I select the primary payee, Frank's Car Repair, and the rest of the payee information screen is filled automatically. The car that Frank is working on is the car in Exposure 1, so I select the appropriate reserve line. The work on the car is finished, so I mark the payment type final. For the category, I select Other. The amount for the check is $1,900. The work was completed today. I enter Fred's invoice number. And link the invoice document to the check. Now the check is in awaiting submission status. It's waiting to be sent to an external check system to issue the check. If I click the check amount, I see the check details, and note that I can still edit or delete the check. If I click edit, it will return me to the check wizard. Now I'll return to the check screen. If I look at a check that has actually been issued, I see that it has an associated check number. If I look at the details of this issued check, I see that it can no longer be edited or deleted. This concludes the transaction lifecycle demo. Now, let's look at how these statuses and others work together in the full lifecycle of a transaction.\n\n--- CC_09_02 ---\nAt Succeed Insurance, sometimes a payment submitted by an adjuster exceeds the limit imposed by the policy for that exposure type. There are often good reasons for this, but when it occurs, the group's supervisor must investigate and verify that the payment issued is reasonable and appropriate. A rule must be created to implement this requirement. To save time, I have already created such a rule. It is a transaction set pre-update rule. This is the rule, Exposure Payments Beyond Limit. The condition for this rule ensures that the rule fires only when a check set is submitted, not a reserve or recovery transaction set. To meet this requirement I use a financials calculations engine that obtains total payments. The rule looks at each exposure in the transaction set. For each exposure, it determines whether the amount being paid for the exposure is greater than the limit for that exposure. If it is, the rule creates an exposure limit exceeded activity. It then assigns that activity to the supervisor of the group assigned. It is a validating rule. There is a validating rule. There is a validating rule that would interfere with the function of my new rule. It rejects transaction sets that would bring the total payments for an exposure above the exposure's limit. This would mean that my pre-update rule would never fire. I will simply disable the rule for the purposes of this demonstration. Now I will start the Claim Center Server. In debug mode. When the server is ready, I will start the Claim Center Server. In debug mode. I will start the Claim Center Server. In debug mode. I log in as Andy Applegate. Now I will start a new claim to test the rule. I'll use today's date. I need a policy with a good set of exposure limits. Most of the time I will start the Claim Center Server. In debug mode. Most homeowners policies meet this requirement. I'll use the Kandarian policy. Let's look at the policy details. There is one location on the policy. Looking at the coverages for that location. I note a personal property coverage, with an exposure limit of $50,000 and an incident limit of $75,000. Now I'll return to the main sequence. the wizard. For the reporter, I'll select the main insured party. Mr. Darien informs us that his house has been vandalized. An intruder spray-painted his living room walls, including a Dali painting. The loss causes malicious mischief and vandalism. Damage has been done to the dwelling. Particularly, rude words, spray painted on the wall of the living room. Mr. Darien has already gotten estimates for repairs to the damage. There is also damage to personal property in the form of the painting. The painting will require extensive restoration. This is related to the property contents incident. I will add one service. For purposes of this claim, the painting counts as furniture. We definitely want the painting restored. The work will be done by Stan's Restoral Service, the best in the Chicago area. I will add Stan's Restoral Service as a company vendor. Theountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountount This completes the service request. The base configuration of Claim Center does not automatically create exposures for homeowners' policies, so I will create one for the painting. The claimant for the exposure is Kentarian. I'll assign the claim to myself. Now the claim is complete. I'll visit the claim and add a reserve. There is only one exposure. This reserve is for claim cost. Its purpose is to pay for the restoral of the painting. Stan's Restoral has given us an estimate of $60,000. Recall that the limit for personal property exposures is $50,000. A reserve this big will obviously require high-level approval. So I will log out as Andy Applegate. And log in as the supervisor. I'll search for the claim I just created. Looking at the work plan for the claim, I see that there is an activity to approve the reserve. By logging in as the supervisor I'm skipping several levels to the level that would ultimately approve the reserve of this size. This seems like a reasonable estimate for such a delicate restoral job. Though it exceeds the exposure limit, it is within the incident limit, so I approve it. Now I'll log back in as Andy Applegate and create the check that will test the rule. First, I must return to the claim I created. Now I create a new check. The check will go to Stan's Restoral Service. This is the only payment that will be made on this reserve. So, it is a final payment. The payment is in the amount of $60,000. I will log in as Andy Applegate. Like the reserve, the check requires approval at the supervisory level. So I log out as Andy Applegate. And, once again, log in as the supervisor. I navigate to the claims work plan. There is an activity to approve the check. I simply approve it. And the activity created by the rule is present. The rule is working properly. This concludes the transaction set pre-update rules demonstration.\n\n--- CC_09_03 ---\nSucceed Insurance issues payments through Franklin Square National Bank. Succeed's agreement with the bank specifies that once a check has been issued a check number, it cannot be voided. At this point Succeed Insurance would have to issue a stop payment on the check. To implement this, I have created a validation rule. This is the rule, Prevent Voiding of Issued Checks. The rule only applies to check sets, so I set the condition to make this distinction. The rule must examine each check individually, because if there are any checks in the check set that meet the criteria, then the whole check set will be rejected. There are three criteria a check must meet to cause the rejection of the check set. The first is that the status property of the check has changed. The second criterion is that the new status must be Pending Void. Recall the ClaimCenter does not void checks, that is done by a request to the external check processing system, which then reports back to ClaimCenter that the check has been voided. And the third criterion is that the check must have a check number. These three criteria, taken together, mean that the user is attempting to void a check that has had a check number assigned to it. If the transaction set is to be rejected, then I want ClaimCenter to highlight the fact that the check has a check number. The check number is a property of the check associated with the transaction set, so a check number is a subfield. So I use the Reject Subfield method. The check set will be voided based on the check and its check number field. The transaction set will be voided regardless of the claims validation level, though if there is a check it should be at ready to pay, so I set the validation level to new loss. Then the error message will include the check number. And it will suggest issuing a stop payment on the check instead. Since there's no point in having both an error and a warning, the last two parameters of the Reject Subfield method are both null. To test the rule I log in. I navigate to a claim with a check already on it. The check already has a check number. I click it to navigate to the check. I attempt to void the check. I attempt to void the check. ClaimCenter asks whether I really want to void the check. This is standard behavior in the base configuration. When I click OK, I get the expected error message, telling me that I cannot void the check and must instead stop it. I'll clear the error. Now I'll try to stop the check. When I click OK on the standard message, I see that the check is in pending stop status. This concludes the transaction set validation rules demonstration. The transaction plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan plan                                                                          \n\n--- CC_10_01 ---\nAs Andy Applegate, I need to create three payments on the Karen Egertsen claim. Looking at the financials for the claim, I can see that several reserves have been created, and a few payments have already been made. The first payment I need to make is for auto repair. I have an invoice for $2,382.87, and I see that there is a reserve of $2,500. available for this. Navigating to the reserve. I will create a check for the invoice amount. The information about the payee is already provided, since it's associated with the exposure and incident. I select the payment type. I select the payment type. Which is final. And the cost category. Which is other. And enter the amount. $2,382.87. At this point I would typically link the payment to the invoice, but since there is no invoice for this reserve in the database. I'm done with this check, so I click finish. This check does not yet have a check number. This is because the check is awaiting submission to the check processing application. That application will assign a number to the check, and communicate that number back to Claim Center. The check is awaiting submission because I have the authority to approve a check of this amount. If I did not, it would be awaiting approval. Now I'm going to enter another check. This check covers physical therapy associated with Ms. Egertsen's injuries. There is a reserve of $12,000 set aside for medical expenses, of which $9,000 has already been paid. Ms. Egertsen has received a bill for $2,300. So I'll access the reserve. And create a check. Once again, I will just bypass this first screen. I'll make the payment final. Set the category to physical therapy. And enter the amount of $2,300. This check, too, is awaiting submission. Finally, I need to process a payment to a third party. There are $4,700 remaining on this reserve line, and I have been hand a bill for $2,000. The third party is Bob Smith. The third party will be approved for the treatment of the treatment of the treatment of the treatment of the treatment of the treatment of the treatment of the treatment of treatment of treatment of treatment of treatment of treatment of treatment of treatment of treatment of treatment of treatment of treatment treatment of treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment $2,000. The status of this check is pending approval. While I have the authority to approve a check of this size, the total checks for this claim have exceeded my authority, so the check must be approved by my manager. This concludes the transaction approval demonstration.\n\n--- CC_10_02 ---\nI have two requirements that I need to implement. The first requirement is that adjusters should not be able to approve a single payment more than $5,000. I'll navigate to the authority limit page, under administration. And click the adjuster profile. I see that, while the adjuster cannot approve the payment, the amount of total payments greater than $15,000. There is no limit on specific payments. This means that an adjuster can approve a single payment for $15,000. This is not the desired behavior, so I click Edit. I add a new authority limit. The type of the authority limit is payment amount. And the amount is $5,000. I click Update to confirm the change. The second requirement is $5,000. I click Update to confirm the change. The second requirement is $5,000. I click Update to confirm the change. The second requirement is to restrict the change. The requirement is to restrict the authority of one adjuster. Chris Craft is under investigation for possibly issuing false payments. Therefore, we do not want Chris to issue any payments without a supervisor's approval until the investigation is completed. To accomplish this, I will give Chris a custom profile. The current profile is almost correct. The current profile is almost correct. The only change I need to make is to the payment amount, which must be zero. When the investigation is completed, if it turns out that Chris is innocent, I can return and restore the standard adjuster authority limit. Now, to test the work I've done. I'll log in as an adjuster. And navigate to a claim. Looking at the financials for the claim. I can see that Exposure Number 4 has reserves greater than $5,000 that have not been paid out yet. I'll create a payment on that reserve line. The payee is Bo Simpson. This will be a partial payment in the amount of $6,000. When I click Finish. I can see that the status of the payment is pending approval. And when I look at the work plan. I can see to whom the approval activity has been assigned. Now, to test the custom profile that I created. I log in as Chris Craft. I'll navigate to the same claim as before. I'll create a check in the amount of $10. The payee is Bo Simpson. And I'll use the same reserve line as before. This will be a partial payment in the amount of $10 for mileage. I'll quickly finish the check. And I see that even this tiny payment is pending approval. This is the end of the Authority Limits demonstration.\n\n--- CC_10_03 ---\nA supplemental payment is a payment issued against a closed exposure. It is not uncommon for a supplemental payment to occur shortly after an exposure is closed. For example, an injury exposure might issue a payment of $7,000, but, after the exposure is closed, the doctor determines that the initial treatment should be followed by a secondary procedure. In this case, a supplemental payment may be issued against the exposure for the second procedure. At Succeed Insurance, it is highly unusual for a supplemental payment to be issued a year or more after the exposure is closed, but it does happen, particularly for injuries whose long-term impact is not known when the claim is processed. Consequently, Succeed wants to allow supplemental payments against exposures closed for a year or more, but these payment require approval by the group supervisor. This requirement will best be met by a transaction approval rule. None of the existing rules can be easily modified. The rule should be modified to meet this requirement, so I will create a new rule. I give the rule a number and an appropriate name. The rule should only be active for check sets, not reserve sets. The rule should only be active for check sets, not reserve sets. I will set a variable for the maximum number of days after the exposure closes that a supplemental payment can be made without approval. Note that, if we expected this to change a lot, I would probably use a script parameter. It must inspect each payment in the check set. If a transaction is supplemental, the exposure has been closed longer than 364 days. Then approval is required. Now, you might think that I would need to find an exposure that closed more than a year ago to test this rule. But since I used a variable for the number of days, I can test it much more easily. If I set its value to minus 1, then all supplemental payments will require approval. Now I'll restart the server in debug mode. And login is an adjuster. I navigate to a claim. And close in exposure. I'll verify that there are no open activities on the exposure. There are none. Now, I create a supplemental payment against that exposure. The claimant on this exposure is Stan Newton. I select the MedPay reserve line for the exposure I closed. Because this is a closed exposure, the only payment type available is supplement. Stan requires physical therapy for lingering effects of his injuries. Now I'll enter the amount and finish out the payment. I see that the payment, which is well within my authority limits, requires approval. Looking at the claims work plan. The approval activity has been assigned to Sue Smith, my immediate supervisor. This shows that the rule is working. The next step is to change the max up days variable back to 364 so that the rule will function according to the requirement. This ends the transaction approval rules demonstration. The plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan \n\n--- CC_11_01 ---\nSucceed Insurance requires that no reserves or payments can be made against claim cost when a claim is under SIU investigation. Such a claim should be put under financial hold. The first thing to do is to set up the cause for the financial hold. I navigate to the financial hold's enhancement. In the apply financial hold's function, I add a condition to the OR clause. The condition tests whether the claim is under SIU investigation. To save time, I have already added a condition to the OR clause. The condition tests whether the claim is under SIU investigation. I already created the rule I need. In the base configuration, there is a group of transaction set validation rules that deals with financial holds. The parent rule fires if the claim has a financial hold on it, as long as the transaction set type is reserve set or check set, and there are no deleted or cancelled checks. There are child rules that deal with the possible causes of financial holds. In the base configuration, there are three. Claims where coverage is in question. Incident only claims. And claims with unverified policies. I have placed my new rule under those three. The condition activates the rule only if the claim is under SIU investigation. The rule rejects the transaction set with an error if it has any component for claim cost. Otherwise, it rejects the transaction set with a warning. To test the rule I restart the server in debug mode. When the server is ready, I switch to Claim Center in the browser. And I log in as Sue Smith, a claims manager who has the right to set SIU status. Now I navigate to a claim. I look at the status screen. Where I see that the SIU status field for this claim is null. I'll change that. I navigate to the Special Investigation Details screen. Here, I click Edit. I refer the claim to the SIU team. In the Supervisor comment field that appears I indicate that this is a test. Now I save the changes I've made. Returning to the status screen. I verify that the SIU status is set. Now I'll try to create a reserve on the claim. Note that there are already several claim cost reserves on the claim. The new reserve is set to Claim Level from the start, so I'll set the cost type to Claim Cost. For Cost Category I'll simply select Other. And I'll set the amount to $5,000. Now I'll attempt to save the claim. As expected, the error message appears. If I attempt to save in this errored condition, nothing happens. I'll clear the error message. And change the cost type. Now, when I attempt to save. I see the warning message. I'll clear the message. Now when I click Save. The reserve is saved, with the status of Submitting. The rule is working correctly. This concludes the Configuring Financial Holds demonstration. .    \n\n--- CC_12_01 ---\nAs Andy Applegate, an adjuster with Succeed Insurance, I am working on a claim. There are several exposures associated with this claim. I'm going to work on Exposure 3, the third-party vehicle exposure for Bo Simpson. I will set up a service request to have the vehicle fixed. This service is related to the third-party vehicle exposure. Because we definitely want the car fixed, the request type is quote and perform service. The work will be done by Mike's Auto Detailing Shop. And the work will be done on the shop's premises. The service to be performed is Auto Body Repair. When I click Submit, the service request is added, and the application navigates to the services screen. The service request I created is highlighted in the list, and its details appear below. Some time passes and Mike gives me a quote. I add it to the service request. I enter the relevant details of the quote. I enter the relevant details of the quote. Then I update the quote. The status of the quote is waiting for approval. I approve the quote. More time passes, and the vendor completes the work. I record this on the services page. The vendor sends in an invoice, which matches the quote. I add the invoice to the service request. The status of the invoice is now check created. And the status of the check is awaiting submission. This means that the check, which is well within my authority limits, has been approved and is ready for the payment processing system. This has been done by the STIP feature, which will be discussed later in this lesson. This concludes the services and service requests demonstration. The plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan \n\n--- CC_12_02 ---\nSucceed Insurance needs service types for fire and water slash mold restoral, associated with dwellings. Before starting, I want to make one important observation. Here and in the lab, we will do simple configuration by adding a few new services to the base configuration. In an actual implementation, you will probably rip out most or all of the sample service data provided in the base configuration and create completely new custom services. I will need several display keys to meet this requirement. I will save time by pasting them into the display.properties file. Now I will navigate to the VendorServiceTree.xml file, which creates the hierarchy of services and service categories. I am going to add a set of HomeRestoral services to the application at the end of the file. First, I will add a parent service type for HomeRestoral. This will be implemented, like all services, as a specialist service. The public ID will be H-Res, for HomeRestoral. The convention for services is to prefix the public ID with SVC and a colon. It will be active in the application. I will use HomeRestoral as its code. As its description. As its description. As its description. As its description. As its description. As its description. As its description. As its description. As its description. As its description. As its description.      As its description.    As its description.       As its description. As its description. As its description. As its description.   As its description. As its description. As its description.  As its description.  As its description. As its description. This is a top level category and has no parent, but the parent field is required, so I'll enter it as an alt tag. This completes the definition of the parent service, so I'll add a closing tag. To save time, I'll paste the fire and water slash mold services. Now I can save and close this file. For the services to display in the user interface, they must be implemented in the VendorServiceDetails.xml file, which creates the associations between service kinds, or categories, and incidents, and between services and service kinds. Service requests are associated with incident types at the bottom of the file. Services must be associated with incident types to appear in the user interface. In this file, the public IDs are implemented as numbers, so I will use the number 1 greater than the last incident type. The incident type for these services is Dwelling Incident. The service type to associate this incident with is the Home Restoreal type I created. Its public ID is hres. The service type to associate this incident with the service type. And, a closing tag. That ends this association. Now I need to associate the two services with their service kind. The surrounding tag for this association is Specialist Service Compatible Service Request Kind. Again, the public ID number is 1 greater than the last number already in place for service request kinds. The service kind is to quote and perform the service. To complete the association, I enter the tag for the service.  And, once again, a closing tag. To speed things along, I'll paste the water and mold service kind association. I'll save the file. This time, I'll close the editor. Now I'll start the Claim Center server. Now, I'll log in as the system administrator to import the new services. On the Administration page, I click Utilities in the sidebar. The Import Data screen is displayed. I browse to find the service data files I edited. The service tree must be imported first. Since no conflicts are found, I click Finish. The file was successfully imported, so I click Utilities to refresh the Data Import screen. Now I will import the service details file. Now, to test my work, I navigate to a known homeowner's claim. From the Actions menu, I begin to create a new service request. I look at the list of services to add. And here I see the services I added displayed correctly. This concludes the configuring services demonstration.\n\n--- CC_12_03 ---\nI have been given a requirement that automatic approvals should be limited to $1,000 and automatic payments should be limited to $1,500. I can meet this requirement by configuring straight through invoice processing, or STIP. To accomplish this, I need to edit two files. The first is Invoice Auto Approval Helper. And the second is Invoice Auto Payment Helper. Invoice Auto Approval Helper has a useful property called Small Amount Thresholds. The Get Failed to Qualify Reasons function produces a list of reasons why an invoice might not qualify for automatic approval. If none of these apply, the list is empty and the invoice is automatically approved. Get Failed to Qualify Reasons has a clause, in the base configuration, that tests the amount of an invoice against small amount threshold and adds an entry to the list if it exceeds that threshold. So, all I need to do to meet the first part of the requirement, is to change the value of small amount threshold. The Auto Payment Helper does not have this functionality in the base configuration. So I will copy the property from the Invoice Auto Approval Helper. And paste it into the Invoice Auto Payment Helper. And paste it into the Invoice Auto Payment Helper. Small amount threshold uses a package, big decimal, not used in the base configuration of Invoice Auto Payment Helper. I click OK to approve importing the package. I change the US currency value to meet the requirement. I also have to arrange for Invoice Auto Payment Helper to use the property. So I return to the Auto Approval Helper. Copy the clause I need. And paste it into the Auto Payment Helper. I paste it at the bottom of the Get field to qualify reasons function, right before the return statement. Now I see that this clause uses a variable which has not been created in this helper. So I return to the Approval Helper. And copy the line that instantiates the variable. There is more logic associated with this variable, but this one line will suffice for this demonstration. Then I return to the Payment Helper. And I paste the line immediately before the line where the variable is needed. This concludes the configuration. Now I will start the server to test my work. A proper test involves at least 3 services. One below $1,000, which should be automatically approved and paid. One above $1,500, which should require manual approval and manual payment. And one between those two values, which should require manual approval and then be automatically paid. Due to time constraints, I will only demonstrate the last of these. I log in as Andy Applegate. First, I will navigate to a Claims Financials screen. Reserve Line 2 has $4,700 of remaining reserves available, and will be perfect for this test. I also observe that the line is for auto body work. I will create a new service. I relayed the service to the Reserve Line I chose. This will be a quote in Perform Service Request. The service to perform is auto body repair. I'll finish up the required fields. And I submit the service request. After a while, the auto shop provides a quote. The quote totals $1,000. 750 for parts. And 250 for labor. The quote is waiting for approval. So I approve it. The vendor completes the work and sends in an invoice. I'll fill in the invoice details. The parts came in right on target. But the cost of labor was higher than expected. The status of the invoice is waiting for approval. The reason it is waiting for approval is because the amount is too high. That is, it exceeds the $1,000 I set in the approval helper. So I approve the invoice. The check is immediately created. This is because I set the small amount threshold to $1,500 in the payment helper. This concludes the STIP demonstration.\n\n--- CC_13_01 ---\nClaimCenter search is flexible and useful in the base configuration. While you can configure it, most of your day-to-day needs are already met. The most commonly searched for entity is claim. The simple search for claims is quite powerful. For example, if I can only remember a claimant's first name, that will be enough to obtain results. Of course, a search like that would not be very useful if I were looking at the claimant's first name. For example, if I can only search for a common name in a large database. This is where advanced search comes in handy. For example, if I know that the loss date was in April of 2018, I can limit the search to that month. I'll restrict the search to claims whose loss date is in the period beginning April 1st of 2018. And ending on April 30th of the same year. Now when I click search, it only finds one claim in that period with a claimant named Ray. On the other hand, suppose that I don't remember the dates. But I do know that there is about $16,000 in reserves still unpaid. To be safe, I'll bracket that $16,000 from $15,000 to $20,000. Again, a restricted list of claims is displayed, different from the previous one. What if I use both criteria? That is, if I look for a claim from April of 2018, with a claimant named Ray and $15,000 to $20,000 in remaining reserves? I get no results at all. Now, what happens if I repeat the search without Ray in the first name field? The search fails. There are a set of criteria on the left-hand side of the search, which constitute the required criteria. No individual criterion in this set is required, but at least one of them must be specified for the search to proceed. As long as at least one of the required criteria are met, I can add any combination of other criteria. For example, I select a group, only groups to which I belong are displayed initially. I'll also constrain the search by jurisdiction of California. And change the date option back to sense. And, finally, I remove all financial value restrictions. Now when I click search, I get all the claims, less than a year old, that my team is responsible for in California. There are only about 10, because the sample data is fairly small. If I click print export, I can export these results as a PDF for printing, or as a CSV to use in a spreadsheet program. The other search menu options, activity, check, recovery, and bulk invoice, work in the same way. So do user in group search from the functional and administrative pages, except that there are no required fields there. The one that is a little different is contact search. I'll navigate to an open claim. If I create a new service request, I'll associate the service with this MedPay exposure. The only service available for a MedPay exposure in the base configuration is medical care. Now I'll search the address book application for a doctor. The search returns a list of doctors and medical care organizations, located near the address of the claim. I could select any of these, and they would be populated in the claim. But now I will cancel the search. And the service request. This concludes the searching for entities demonstration. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of the treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment \n\n--- CC_13_02 ---\nSucceed Insurance employees occasionally need to search for activities of a particular type, such as litigation or approval activities. This capability is not present on the activity search screen in the base configuration, so I will add it. I'll log out of ClaimCenter and navigate to Guidewire Studio. If I look at the activity entity, I see that type is a type key, referring to the activity type type list. Now I'll add that type list to the activity search criteria entity. Activity search criteria is a read-only, or final, file. I will have to extend the file to add the new search criterion. I need to add a new type key element. Its name is activity type, with the SI suffix for succeed insurance. It refers to the activity type type list. And it is not a required value, so I will set NULL OK to true. Finally I'll give it a quick description. Finally I'll give it a quick description. Now I'll navigate to search config.xml. Under the existing activity search criteria, I add a new criterion element. The property is the type code I added, activity type underscore SI. Next, I'll add a target property. This is the property whose value must be matched in the type list, which is type. The match type is EQ, signifying that it must be an exact match to the type list. Before I add the new search criterion to the user interface, which is the subject of the next demo, I will regenerate the SOAP files. So I stop the server. In a command prompt window, I navigate to the Claim Center home directory. Here I type the GWB command that starts the SOAP generation. This concludes the configuring search criteria demonstration. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy  neck of neck of neck of neck of neck of neck of neck of neck of neck of neck of neck of neck of neck of neck of neck of neck of neck of neck of neck of neck of neck of neck of    so                                                                          \n\n--- CC_13_03 ---\nNow I'm going to add the type criterion that I configured in the last demo to the user interface, specifically, the activity search page. The first thing to do is create a display key for the criterion. The label it displays should read activity type. Now I'll collapse this node. And take a look at the activity search page. As you can see, there are two main elements. The input set on the left is for required criteria. Remember that you must specify at least one criterion from this group. Also, Guidewire does not support adding a new required criterion. The input set on the right is for optional criteria. I will add my new criterion here. So I double click to navigate to that input set. In the tool box, I start searching for type key input. When type key input appears, I click it. I drop the new type key input immediately below priority. Immediately, some errors appear. I will configure the widget and the errors will be cleared. Users should, obviously, be able to pick a value to search on. So I set the value of the editable property to true. I'll give the widget an ID. And set its label to the display key I created. Finally, I'll set the value of the widget to the type of the activity. Setting the value automatically sets the value type. To test my work, I'll start the Claim Center server. When the server is started, I navigate to Claim Center. And log in as Andy Applegate. On the activity search screen, I'll search for activities assigned to my group, whose type is general. When I search, a number of activities are found. This concludes the Modifying Claim Center search screens demonstration. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of the neck of the neck of the neck of the neck of the neck of the neck of the neck of the neck of neck neck of neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck neck \n\n--- CC_14_01 ---\nI am logged into ClaimCenter as Andy Applegate, and I am going to navigate to a claim. In the sidebar, I click the history link. ClaimCenter displays an uneditable list of significant actions and events in the history of the claim, including every time a user has viewed the claim. I'll create a new legal matter. The only field I must fill in is the name of the matter. Now when I return to the history list, The creation of the new matter appears on the list, as does a record showing that the matter has been assigned. Now I'll close the matter. A reason for closing is required. Closing the matter also appears on the history list. Now I'll create a check. The check will be to the claimant Bo Simpson. The payment is made against the medical expense line associated with Mr. Simpson. This is a final payment and it will pay out the full amount of the reserve. Check creation does not appear on the history list. In fact, the creation of a new object generally does not appear on the history list. However, if I stop, transfer, and transfer, I'll create a new account. I'll create a new object to the history list. This does appear on the history list. A limited set of items appear automatically in the history list. The set of items that appear is defined by the history type type list. There are 23 history types in the base configuration, which between them cover most circumstances that would require a history record. Nonetheless, the list is extendable and you can add custom history record types as needed, which is the subject of the next demonstration. This concludes the history records demonstration. This concludes the history records demonstration.\n\n--- CC_14_02 ---\nThe most common use cases for adding custom history types are tracking specific claim situations, like a claim with over a certain number of notes, and tracking changes to specific fields. Succeed Insurance requires that, when the loss cause field on a claim changes, a history event be created. This should be easily searchable for later data analysis. A few custom history types are already present in the base configuration. Data change in particular seems to meet this need, but, for searchability, I will create a new custom history type. I set the two required variables, the code, and the name. I'll also set the description field. I'll leave the rest at default values. Now let's look at the claim pre-update rules. I see an existing rule which might partially meet the requirement. So I open it and take a look. As expected, it uses the data change custom history type. I will change that. To test the rule, I reload the changed classes. When the classes are reloaded, I switch to Claim Center in the browser. And log in as Andy Applegate. I navigate to the Robert Farley claim. On the loss details page, I change the loss cause field from collision with motor vehicle, to collision with fixed object. When I navigate to the history page, the expected custom history item is displayed at the top of the history list. This concludes the custom history records demonstration. This concludes the custom history records demonstration.\n\n--- CC_15_01 ---\nNext demonstration, I'm going to explore and show what roles and permissions do in terms of access to various aspects of the application. I will use three users, Rick Ralston, a claims supervisor, Ida Belt, a customer service representative, and the system administrator. As you will see, each user has access to different areas of the application, relative to their job responsibilities. I'll start with Rick. Since he's a supervisor, Rick has access to the team tab. Next, let's look at claim ownership. As Rick, I create a new claim. As Rick, I'll put together a quick auto claim to demonstrate. Let's suppose Mr. Williams hit a moose coming out of his garage. I'll add the vehicle Mr. Williams was driving. I'll add the vehicle to the vehicle. Finally, Rick assigns the claim to Ida Belt. Rick searches for Ida's user ID. Rick clicks Assign. But when he attempts to save the claim, he sees that Ida does not have permission to own claims. So instead, he assigns the claim to NDApplegate, an adjuster. Now he can finish and save the claim. I'll take note of the claim number for later use. Then, as Rick, navigate to the claim. On the contacts page, Rick has the ability to edit contacts in the address book. Rick also has the ability to close a claim. Now let's look at Ida. Ida does not have access to the team tab. Ida does not have access to the team tab. Ida can search for a claim. Ida does not need to close the claim. Ida does not need to close the claim. Ida does not need to close the claim. Ida does not need to close the claim. But she cannot close the claim. She can view contacts, but she cannot edit them. Let's look at why she is restricted this way. A login is the system administrator. Let's start by looking at IDA's user record. Users have roles. IDA has exactly one role, Customer Service Representative. Andy Applegate, on the other hand, has two roles, Adjuster Entrusted for Sensitive Claims, and Rick Ralston. Has the single role of Claim Supervisor. Let's look at these three roles. Let's start with the Claim Supervisor roles. A role is basically a list of permissions. A user who has a role assigned to them has every permission associated with that role. If the user has two or more roles, they have all permissions associated with any of those roles. The Claim Supervisor role has 12 pages of permissions associated with it. Among these are the right to close claims, to create contacts, to edit contacts, and to view their team. Adjusters, on the other hand, have the permission to own claims. But Customer Service Representatives do not have any of those permissions. This concludes the permissions in the base application demonstration. of the DSA of the DSA of the DSA of the DSA of the DSA of the DSA of the DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA of DSA D Thank you.\n\n--- CC_15_02 ---\nThe Security Dictionary provides useful, detailed information about the permission structure in ClaimCenter. I'll start by looking at System Permissions. Permissions related to activities begin with the letters ACT. The ActCreate permission is a good example. ActCreate is an object-based permission with a description, permission to create new activities. Eight roles use this System Permission. One of these is a System Permission. is the All Permissions, or Super User, role. ActCreate is a member of one Application Permission Key, or APK, Claim.CreateActivity. And it is related to one page, new activity, through that APK. In ClaimCenter Studio, I see that new activities can visit property calls the APK that includes ActCreate. Looking at the ActOwnSystem permission. It has the same layout, but with different details. For example, it belongs to the Activity.onAPK. And it is related to not one but three pages. If I click the Vacation Activities page link, I see that its Visit Permission expression includes the Activity.onAPK. In fact, the Edit and Visit Permission expressions are identical. In Studio, the CanEdit expression is void. This is because one implicitly includes the other. If you can't visit the page you obviously can't edit it, so a separate CanEdit expression would be needed. Only if it were more restrictive than the CanEdit property. Now I'll look at roles in the Security Dictionary. As I mentioned earlier, the Super Users All Underscore Permissions role includes all System permissions. But the Activity Rules Viewer role has only one permission, the right to view Business Rules. If I click the Permission, I see that several roles include this permission. That's pretty much all there is. That's pretty much all there is to roles. A role is just a list of permissions. There's a slight quirk to the Pages section of the Security Dictionary. It includes more than just pages. It includes all PCF files in the application, including things like screens and views, neither of which require permissions, because they inherit them from their parent pages. So perhaps it should really be called a PCF instead of pages. The main reason for this is that some non-page PCFs, like popups and forwards do have permission expressions. For example, the Activity Detail Forward requires the Activity View APK. Finally, on in the Application Permission Key section of the Security Dictionary, I can select an APK and see the permissions it conveys and the pages that use it. Some APKs have an additional reference type. Element references list elements, such as widgets, in PCFs that use the APK or permission in their available properties. For example, the Activity View APK is used to determine whether the subject cell of some activities list views is available. This concludes the Security Dictionary demonstration. The is is  is is is\n\n--- CC_15_03 ---\nWelcome to the configuring permissions demonstration. Succeed Insurance has identified a requirement to limit which employees are able to add and remove officials on a claim. Initially, this will be permitted only to adjusters. I begin by typing Alt Shift I to determine the name of the PCF that contains the Add slash Remove Officials buttons. It is the Lost Details detail view. The first step is to add a new permission type. The system permission type type list already has an extension I can use. I click to add. And name the new permission official manage, remembering to use the underscore SI suffix. The name is Add and Remove Officials.  And add a description.  And add a description. The next step is to set the visibility properties on the toolbar on Lost Details. I will use the auto mode of the detail view. In a real implementation I would probably also need to do the same for other modes, but for this demonstration I will keep it simple. I scroll down and select the button set for the officials list. There are two visibility properties on this toolbar, one for the Add button. And one for the Remove button. I'll populate them both with the system permission I just created. Now I'll restart the server so my changes will be effective in the application. When the server is ready. I'll add the new permission to the adjuster role. On the roles page of the administration tab. I click the adjuster role. And edit it. I click Add. And select my new permission. To test the configuration, I will log in as two users, an adjuster and a supervisor. And the Applegate is the adjuster I'll use. I'll navigate to a claim. On the Lost Details page. I click Edit. The Add and Remove buttons are visible to the adjuster. Remove is not currently available because there is nothing selected to remove. Now I'll log in as Sue Smith, a claims supervisor. I'll navigate to the same claim. I'll navigate to the same claim. And the Lost Details screen. When I click Edit. The Add and Remove buttons are not visible. It'sountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountount \n\n--- CC_16_01 ---\nSucceed Insurance requires that, for any fatalities on a claim, the adjuster responsible for the claim should contact the next of kin and extend condolences on behalf of Succeed, as well as providing reassurance that Succeed Insurance will handle the claim quickly and fairly. I'll log in as the system administrator, who has permission to create and update business rules. Now, I navigate to the Business Activity Rules screen. Here, I create a new rule. The name of the new rule is Contact Next of Kin. The rule should test every exposure on a claim, so I select Exposure as the trigger entity. This will occur every time an exposure is created or updated. The rule should apply to every policy type except workers' compensation. So I click Business Owners. Then scroll down and Shift-click Professional Liability to select everything in between. And I move them to the selected box. I'll create a variable to make the rule more readable. The name of the variable is Severity. And it refers to the severity of the specific incident. I need to display the rule conditions if I want to create one. There is only one condition, but it must be enforced, so I select all of the following. The condition is going to be based on the severity variable. The severity must be a fatality for the rule to trigger, so I'll select the equal operator. And set the right expression to death. Finally, the rule has to do something. Specifically, it will generate an activity. The activity pattern, a custom pattern which I have already created, is Contact Next of Kin for fatality. I want this activity to show on the adjuster's calendar as a top priority. I also want to ensure that no more than one Contact Next of Kin activity is created against any single exposure. The rule is complete, so I will save it. Now I will re-enter the rule. This allows me to promote the rule first to Staged. And then to Approved Status. Now that the rule is created, I will test it by creating a claim with the fatality involved. I will log in as IDA Belt, a customer service representative. As IDA, I will create a new claim. I will search for the Brittany Turner account. And I will set the loss date to today. Ms. Turner reports the accident herself. Her only insured vehicle is involved. Ms. Turner hit another car while turning left out of her own driveway. She acknowledges that she is at fault. Moving on. Nothing is required here. Or here. Ms. Turner is distressed because her passenger was killed in the collision. So IDA creates a new exposure for bodily injury liability. The injury incident must be added to the exposure. The injury incident requires an injured person. Her name is Crystal Smith. I'll add a few more details. Though severity is not a required field, it is needed to trigger the business rule. Again, just a few more required details to finish out the exposure. As the injured party, Crystal Smith is the claimant. And now that the exposure is complete. I can finish the claim. I can finish the claim. And visit it. Where I see that the Contact Next of Kin activity has been added to the work plan. This concludes the Creating and Testing and Activity Business Rule demonstration. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of the exhibition. 10.\n\n--- CC_17_01 ---\nSucceed Insurance wants to automatically create a liability when there is an injury in a building covered by a business owner's policy. I am logged into ClaimCenter as a user with administrative rights, and navigate to the Exposure Rules page. There is already an exposure rule related to business owner's policies. Clicking on it, I see that it creates an exposure for building coverage. This rule will not meet my requirement. So I will create a new rule. I'll give the rule a number indicating that this is the first Succeed Insurance Exposure Rule, and then name it Business Owner's Injury Liability. The description field is not mandatory, but is very helpful when someone else has to figure out what the rule does. The trigger incident and trigger action are fixed. The rule will trigger at the creation of a new incident. I want the rule to be enabled, which is the default value. Now we get a bit more specific. I need this rule to apply to injury incidents on business owners' policies. So, I'll set these fields accordingly. I can select specific loss causes, or allow the rule to apply to all loss causes. I can also select what type of parties this rule applies to. And the loss type. I can also restrict the rule to apply to specific jurisdictions. I could also add rule variables. And conditions, but neither are needed for this business requirement. Finally, I need the rule to create an exposure. There is a list of coverage types available. I'll choose Liability. In the base configuration, there is only one coverage subtype available for coverage type liability on a business owner's policy. The rule is complete so I click Save. This returns me to the Exposure Rules page. I click to go back to the rule. Now I can stage the rule. And approve it. To test my rule I will create a new business owner's claim. There are no business owner's policies in the sample database, so I create an unverified policy. I give the policy a legitimate policy number. Select business owner's policy type. And set the loss date to today. The policy needs to be effective on the loss date. So I set the effective date to the beginning of last month. And the expiration date to one year, less a day. I'll give the policy a little bit later. For the insured party, I create a new company. I'll call the company C Bright Lighting. I'll give it an address. And use Autofill to populate the state, county, and zip code. The company needs a contact person. All I need here is a name. Finally, I need a liability coverage so there can be a liability exposure. I'll set some reasonable limits. That completes the policy, so I click next. Let's keep it simple. Sandy Stone called us. Sandy slipped on a wet floor and hit their head on a piece of furniture. Sandy is an agent who represents the company, not an employee, so this is not a workers' comp claim. There was no sign warning of the wet floor. Now I'll add the injury incident. Sandy is the injured party. This is a third party loss. The injury is of moderate severity. Sandy was briefly knocked unconscious. By definition, if you're knocked unconscious, you've sustained at least a mild concussion. That completes the injury incident. And when I move to the last page of the claim wizard, an exposure of tight bodily injury and coverage liability has been created. This concludes the creating and testing and exposure business rule demonstration.\n\n--- CC_17_02 ---\nSucceed Insurance requires that a reserve in the amount of $2,000 be automatically set aside for exposures associated with injury incidents on general liability policies. I will navigate to the reserve creation rules. Here, I observe that none of the existing reserve creation rules relate specifically to injury exposure types. So I'll create a new rule. I'll give the rule a descriptive name, using the SI for Succeed Insurance Code. And add a description. The loss type is liability. The loss type is liability. And the rule only applies to general liability policies. I don't need a rule variable, but I do need a rule condition. The requirement is that there should be an injury incident on the exposure. I could use the does not equal operator and set the right expression to null, but it's simpler to use the has a value operator. Finally, I need an action to create the reserve. The reserve will be for claim cost. For medical costs. And the amount of the reserve is $2,000. This completes the rule so I will save it. Then return to it. So I can stage it. And approve it. Now I'll create a general liability claim to test the rule. I select a general liability customer. The claim is reported by Hans Molman. Hans is the claimant. A brick fell out of the wall and hit Hans in the head. This happened at the company headquarters. Now I'll add details of the injury. For purposes of this demonstration, Hans is a third party. The brick fall resulted in a minor concussion, which is a moderate injury. This is all the information I need at this time. I'll add an exposure associated with the injury incident. This exposure is for general liability medical payments. This is a very important thing. I'll assign the claim to myself and finish it. Now when I visit the claim. If I look at its financials page. I see the $2,000 medical payment reserve the rule created. This completes the creating and testing a reserve business rule demonstration. So Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy ",
  "generated_at": "2026-02-13T12:46:11.457506"
}