{
  "chapter": "ch04",
  "chapter_title": "PolicyCenter Introduction",
  "domain": "policy administration",
  "video_count": 47,
  "total_duration_seconds": 9659.26,
  "total_duration_formatted": "02:40:59.260",
  "total_words": 22787,
  "avg_confidence": 0.9452,
  "videos": [
    {
      "filename": "In_Policy_07_01.mp4",
      "stem": "In_Policy_07_01",
      "duration": "00:02:15.020",
      "words": 434,
      "confidence": 0.954
    },
    {
      "filename": "In_Policy_08_01.mp4",
      "stem": "In_Policy_08_01",
      "duration": "00:01:58.260",
      "words": 344,
      "confidence": 0.9298
    },
    {
      "filename": "In_Policy_08_02.mp4",
      "stem": "In_Policy_08_02",
      "duration": "00:03:33.260",
      "words": 565,
      "confidence": 0.9512
    },
    {
      "filename": "In_Policy_09_01.mp4",
      "stem": "In_Policy_09_01",
      "duration": "00:01:44.860",
      "words": 196,
      "confidence": 0.961
    },
    {
      "filename": "In_Policy_09_02.mp4",
      "stem": "In_Policy_09_02",
      "duration": "00:02:26.360",
      "words": 327,
      "confidence": 0.9747
    },
    {
      "filename": "In_Policy_09_03.mp4",
      "stem": "In_Policy_09_03",
      "duration": "00:02:08.120",
      "words": 233,
      "confidence": 0.9079
    },
    {
      "filename": "In_Policy_10_01.mp4",
      "stem": "In_Policy_10_01",
      "duration": "00:01:48.140",
      "words": 230,
      "confidence": 0.9351
    },
    {
      "filename": "In_Policy_10_02.mp4",
      "stem": "In_Policy_10_02",
      "duration": "00:00:38.740",
      "words": 51,
      "confidence": 0.9564
    },
    {
      "filename": "In_Policy_11_01.mp4",
      "stem": "In_Policy_11_01",
      "duration": "00:04:05.560",
      "words": 436,
      "confidence": 0.9508
    },
    {
      "filename": "In_Policy_12_01.mp4",
      "stem": "In_Policy_12_01",
      "duration": "00:06:16.540",
      "words": 616,
      "confidence": 0.9325
    },
    {
      "filename": "In_Policy_13_01.mp4",
      "stem": "In_Policy_13_01",
      "duration": "00:04:33.020",
      "words": 535,
      "confidence": 0.9062
    },
    {
      "filename": "In_Policy_13_02.mp4",
      "stem": "In_Policy_13_02",
      "duration": "00:03:34.880",
      "words": 551,
      "confidence": 0.9239
    },
    {
      "filename": "In_Policy_13_03.mp4",
      "stem": "In_Policy_13_03",
      "duration": "00:03:22.960",
      "words": 578,
      "confidence": 0.9405
    },
    {
      "filename": "In_Policy_14_01.mp4",
      "stem": "In_Policy_14_01",
      "duration": "00:04:19.940",
      "words": 654,
      "confidence": 0.9388
    },
    {
      "filename": "In_Policy_15_01.mp4",
      "stem": "In_Policy_15_01",
      "duration": "00:03:41.320",
      "words": 568,
      "confidence": 0.9043
    },
    {
      "filename": "In_Policy_16_01.mp4",
      "stem": "In_Policy_16_01",
      "duration": "00:04:53.780",
      "words": 845,
      "confidence": 0.921
    },
    {
      "filename": "In_Policy_16_02.mp4",
      "stem": "In_Policy_16_02",
      "duration": "00:04:42.300",
      "words": 478,
      "confidence": 0.9397
    },
    {
      "filename": "In_Policy_16_03.mp4",
      "stem": "In_Policy_16_03",
      "duration": "00:02:24.720",
      "words": 294,
      "confidence": 0.9024
    },
    {
      "filename": "In_Policy_17_01.mp4",
      "stem": "In_Policy_17_01",
      "duration": "00:02:30.120",
      "words": 337,
      "confidence": 0.9793
    },
    {
      "filename": "In_Policy_17_02.mp4",
      "stem": "In_Policy_17_02",
      "duration": "00:03:39.160",
      "words": 525,
      "confidence": 0.9618
    },
    {
      "filename": "In_Policy_18_01.mp4",
      "stem": "In_Policy_18_01",
      "duration": "00:05:19.180",
      "words": 844,
      "confidence": 0.9553
    },
    {
      "filename": "In_Policy_19_01.mp4",
      "stem": "In_Policy_19_01",
      "duration": "00:08:57.600",
      "words": 1396,
      "confidence": 0.9615
    },
    {
      "filename": "In_Policy_19_02 .mp4",
      "stem": "In_Policy_19_02",
      "duration": "00:06:48.520",
      "words": 731,
      "confidence": 0.9245
    },
    {
      "filename": "In_Policy_20_01.mp4",
      "stem": "In_Policy_20_01",
      "duration": "00:02:31.100",
      "words": 446,
      "confidence": 0.9634
    },
    {
      "filename": "In_Policy_21_01.mp4",
      "stem": "In_Policy_21_01",
      "duration": "00:01:40.160",
      "words": 262,
      "confidence": 0.9651
    },
    {
      "filename": "In_Policy_21_02.mp4",
      "stem": "In_Policy_21_02",
      "duration": "00:01:14.360",
      "words": 233,
      "confidence": 0.9488
    },
    {
      "filename": "In_Policy_21_03.mp4",
      "stem": "In_Policy_21_03",
      "duration": "00:01:34.760",
      "words": 203,
      "confidence": 0.9632
    },
    {
      "filename": "In_Policy_22_01.mp4",
      "stem": "In_Policy_22_01",
      "duration": "00:01:47.680",
      "words": 272,
      "confidence": 0.9556
    },
    {
      "filename": "In_Policy_23_01.mp4",
      "stem": "In_Policy_23_01",
      "duration": "00:01:45.820",
      "words": 243,
      "confidence": 0.959
    },
    {
      "filename": "In_Policy_24_01.mp4",
      "stem": "In_Policy_24_01",
      "duration": "00:05:08.080",
      "words": 469,
      "confidence": 0.923
    },
    {
      "filename": "In_Policy_24_02.mp4",
      "stem": "In_Policy_24_02",
      "duration": "00:02:16.000",
      "words": 243,
      "confidence": 0.9441
    },
    {
      "filename": "In_Policy_25_01.mp4",
      "stem": "In_Policy_25_01",
      "duration": "00:01:52.860",
      "words": 429,
      "confidence": 0.9573
    },
    {
      "filename": "In_Policy_26_01.mp4",
      "stem": "In_Policy_26_01",
      "duration": "00:01:50.560",
      "words": 180,
      "confidence": 0.9377
    },
    {
      "filename": "In_Policy_27_01.mp4",
      "stem": "In_Policy_27_01",
      "duration": "00:01:42.920",
      "words": 201,
      "confidence": 0.9242
    },
    {
      "filename": "In_Policy_28_01.mp4",
      "stem": "In_Policy_28_01",
      "duration": "00:02:58.020",
      "words": 476,
      "confidence": 0.9458
    },
    {
      "filename": "In_Policy_28_02.mp4",
      "stem": "In_Policy_28_02",
      "duration": "00:01:45.400",
      "words": 224,
      "confidence": 0.9606
    },
    {
      "filename": "In_Policy_29_01.mp4",
      "stem": "In_Policy_29_01",
      "duration": "00:02:12.320",
      "words": 383,
      "confidence": 0.9804
    },
    {
      "filename": "In_Policy_30_01.mp4",
      "stem": "In_Policy_30_01",
      "duration": "00:02:56.060",
      "words": 359,
      "confidence": 0.9565
    },
    {
      "filename": "In_policy_01_01.mp4",
      "stem": "In_policy_01_01",
      "duration": "00:02:50.960",
      "words": 591,
      "confidence": 0.917
    },
    {
      "filename": "In_policy_01_02.mp4",
      "stem": "In_policy_01_02",
      "duration": "00:07:07.360",
      "words": 1361,
      "confidence": 0.9519
    },
    {
      "filename": "In_policy_03_01.mp4",
      "stem": "In_policy_03_01",
      "duration": "00:03:11.960",
      "words": 371,
      "confidence": 0.9387
    },
    {
      "filename": "In_policy_03_02.mp4",
      "stem": "In_policy_03_02",
      "duration": "00:01:59.180",
      "words": 315,
      "confidence": 0.9686
    },
    {
      "filename": "In_policy_06_01.mp4",
      "stem": "In_policy_06_01",
      "duration": "00:06:09.360",
      "words": 909,
      "confidence": 0.9538
    },
    {
      "filename": "In_policy_06_02.mp4",
      "stem": "In_policy_06_02",
      "duration": "00:03:19.820",
      "words": 487,
      "confidence": 0.9566
    },
    {
      "filename": "In_policy_06_03.mp4",
      "stem": "In_policy_06_03",
      "duration": "00:05:09.160",
      "words": 899,
      "confidence": 0.9616
    },
    {
      "filename": "In_policy_06_04.mp4",
      "stem": "In_policy_06_04",
      "duration": "00:08:21.880",
      "words": 941,
      "confidence": 0.9471
    },
    {
      "filename": "In_policy_06_05.mp4",
      "stem": "In_policy_06_05",
      "duration": "00:03:51.120",
      "words": 522,
      "confidence": 0.9483
    }
  ],
  "full_text": "--- In_Policy_07_01 ---\nIn this demo, I will cover the policy tools for an enforced policy. In the summary screen, there is a view of the contents of the policy file summarized on one screen. The screen also includes information regarding current activities, and policy transactions in progress. In the billing screen, there is a view of the overall balance and balances for individual policy periods. You can also view the payment schedule. The contacts screen displays contacts that have a role on the policy. This screen lists the contents of the policy. the users that interact with the policy by the role that they perform on the policy. The screen also shows the assigned group that the user belongs to. You can add or remove participants. For existing roles, you can change the user who performs that role. Search and view any attached documents related to the policy transaction or policy. Search and view any attached documents related to the policy transaction or policy. View summary information about all policy transactions that have occurred on the policy. The listing includes policy transactions that have modified the policy and policy transactions that are in progress, withdrawn, not taken, or non-renewed. You can also compare policy transactions. View any issues that may affect the policy. This section includes underwriting referral reasons, underwriting issues, claims, prior policies, or prior losses. You can also add, close, or reopen underwriting referral reasons. Search and view historical events that pertain to the policy. You can filter history events. The financial transactions tool is an unsupported internal tool reserved for development environments. Users with the internal tools permission are able to access this item. Guidewire does not support the tool in production settings. of the Filogy of the Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy Thank you.\n\n--- In_Policy_08_01 ---\nA policy change transaction is used to modify the policy while it is in force. Policy changes usually have an impact on the premium. For example, one months into the policy period, the insured calls to remove a vehicle from the commercial auto policy. Locate the policy and open the policy file. Click Actions. Select Change Policy. Enter the effective date in a description. The effective date here is a when the changes are effective, not the start date of the policy term. It must be within the policy term boundary. Click Next to start the policy change transaction. Go to Vehicles. Select the vehicle. Click Remove Vehicle. Click Quote. Since the number of vehicles does not exceed the threshold of asynchronous quoting, it will rate the policy immediately. You can edit the effective date of an unbound policy change by clicking Actions. Select Effective Date under Edit. Click OK to proceed as it may affect premium. Change the effective date. Click Next to go back to the policy change transaction. Click Quote again. Go to Policy Review screen. Go to Policy Review screen. The Differences tab displays the changes comparing to the existing policy. Click the Policy Review tab. The Policy Change Wizard buttons are similar as a submission. If the policy holder is satisfied, you can bind and issue the policy. Click OK to confirm. Filogy of the Differences tab. Filogy of the Differences tab. Filogy of the Differences tab. Filogy of the Differences tab. Filogy of the Differences tab. Filogy of the Differences tab. Filogy of the Differences tab. Filogy of the Differences tab. Filogy of the Differences tab. Filogy of the Differences tab. Filogy of the Differences tab. Filogy of the Differences tab. Filogy of the Differences tab. Filogy of Differences tab. Filogy of Differences tab. Filogy of Differences tab. Filogy of Differences tab. Filogy of Differences tab. Filogy of Differences tab. Filogy of Differences tab. Filogy of Differences tab. Filogy of Differences tab. Filogy of Differences tab. Filogy of Differences tab. Filogy of Differences tab. Filogy of Differences tab.                                                                          \n\n--- In_Policy_08_02 ---\nWhen multiple policy transactions are started and based on the same policy period, it may create a preemption situation. The first job that finishes preempts all other jobs, as the jobs that try to complete later do not have the changes made by the job that finishes first. We will walk through an example with a policy of your choice. From the policy file, Start a Policy Change. Go to PA Coverages. Change the Comprehensive Deductible from 1000 to 250. Click Save Draft to save the changes. Do not issue this policy change job, but go back to the same policy file. Start another policy change. Start another policy change. This warning does not indicate that a preemption will necessarily occur, or that it already occurred. Go to PA Coverages. Change the Comprehensive Deductible from 1000 to 500 this time. We will finish this policy change. Click Quote. Issue the policy change. Since this job finishes first, it preempts the other open policy change job. It offers a link to go to the unfinished policy job created earlier. The preemption warning message and the handle preemption button appear on every page of the open policy change. Go to Policy Review. Expand the tree structure on the Differences tab, which compares the current policy change job with the existing policy data that it is based on. As you can see, it displays the existing policy's comprehensive deductible as 1000, which is prior to the other issued policy change, so it is not based on the most up-to-date policy data. You must handle the preemption before you can continue the policy change process. On the Handle Preemptions page, it compares the existing policy that the current job is based on with the other policy change job that has completed earlier. Expand the tree structure. Review the data. There are several options here. The Apply All Changes button allows you to apply changes from the job that finishes first. The Withdraw button discards the current job. The Decide Later button saves the draft and returns to the Policy Review screen. Let's click Apply All Changes. It goes back to the Differences tab on Policy Review, which compares the data to the policy review. The Preemptions tab pairs the current policy change job with the existing policy data that it is based on. Expand the tree structure. After applying all changes, the existing policy has been updated to the most recent data. This is the end of the demonstration of preemption. Filogy of the Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Fil \n\n--- In_Policy_09_01 ---\nPre-renewal direction is specified as a special set of instructions detailing how to renew the policy. Go to a policy that is bound, but without a renewal job started. Click Actions. Select Pre-renewal direction. You can only add one pre-renewal direction to a policy. Click Edit. In the base configuration, you can specify that the renewal ends in non-renewed, ends in not-team, be referred to a customer service representative, underwriter, or underwriter assistant. Select Non-Renew. Select Non-Renew payment history as the non-renew reason. Set the security level which controls who can view it. Add a detailed text to the note. Click Update to save the information. On the Policy File Summary page, there is a link to the existing pre-renewal direction. Alternatively, click Actions. Select Pre-renewal Direction. You can edit, delete, or view the notes of the pre-renewal direction. When the batch process starts the renewal job automatically, it checks the pre-renewal direction first, and puts the renewal job in a non-renewing status. After the current policy expires, the renewal job completes. From the expired policy, navigate to Policy Transactions. The renewal job ends in non-renewed. This is the end of the demonstration for pre-renewal direction.\n\n--- In_Policy_09_02 ---\nA renewal transaction is automatically started by a batch job, for policies expiring in a number of days defined in PolicyCenter. However, a user can manually start a renewal at any time. Go to a policy file that is in force. To manually start a renewal, click Actions. Select Renew Policy. Click OK to confirm. The renewal job is in the renewal workflow. It will become automatically quoted and it will be completed on the renewal start date. Or you can click Next. Before the renewal is bound, changes may be made. Make the policy editable. This applies to renewal jobs started by the batch job as well. It removes the renewal from the workflow and puts it in a draft status. After making the desired changes, quote the renewal job. There are two bind options. Renew puts the job back in the renewal workflow. It will be completed on the renewal start date and ends up bound and renewed. You can still edit the renewal job if you want. Issue now binds and issues the renewal immediately as a new policy term. The renewal job is completed and cannot be edited. Let's select Renew. Select a renewal code. Select a renewal code. Save the data. The renewal job is in the workflow and has a status of Renewing. Click on the renewal job to return to it. This time, we decide to issue the renewal immediately. Click Edit Policy Transaction again to put it in the draft status. Click Quote. Click Bind Options. This time, select Issue Now because we do not want to make any changes. The renewal job is bound as a new policy term. Go to the Account. The new policy term is scheduled because the current term has not expired. When the date reaches the start date of the renewal term, the new term becomes in force and the previous term becomes expired. This is the end of demonstration for manual renewal. \n\n--- In_Policy_09_03 ---\nIf a user starts a renewal, then changes the original policy and issues it, what happens to the renewal? If the renewal is unbound, the policy change can be applied to the renewal. In this example of a business owner's policy file, start a renewal manually. The renewal is in the renewal workflow. It will be automatically completed, when it times out on the renewal start date. Go to business owner's line. Verify that the optional coverage is deductible is 500. Go back to the policy file. This time, start a policy change. This time, start a policy change. Click Next to start the process. Go to business owner's line. Change the optional coverage is deductible. Select 1000. Quote the policy change. Issue the policy. Note a message about a later unbound renewal. You can apply the changes to the renewal by clicking the message link. The renewal job is put back in draft mode. Go to business owner's line. Verify that the previous policy change date of 1000 on optional coverage is deductible has been applied to the renewal job. You must quote the renewal again. Click Bind Options. Select Renew. Select a renewal code. Click OK to save the data. The renewal is put back to the automatic renewal workflow and is in a renewing status. This is the end of demonstration of interrupted renewal. Click the plan of bankruptcy.                           so                                                                          \n\n--- In_Policy_10_01 ---\nThe cancellation transaction is the process of voiding a policy while it is in force. In this demo, you will see the process of a policy cancellation. In this example, Alice Applegate has to log in to cancel a policy. Alice has to cancel Ray Newton's policy today because he has not paid his premium. To cancel the policy, Alice initiates a cancellation transaction through the Actions menu. Select Cancel Policy. After the cancellation wizard starts, Alice selects Insurer as the source of the cancellation. This is because Ray has not paid his premium and the insurer must cancel the policy as a result. In the dropdown titled, Reason, Alice selects Non-Payment. Alice includes details about the reason in the text field. Since Ray did not pay, she writes the details. Alice starts the cancellation transaction when she selects Bind. Alice selects Schedule Cancellation. Alice has successfully scheduled the cancellation. Alice is working with another policy that Ray has in cancellation. She wants to rescind the cancellation. She starts with the Actions menu. Alice selects Rescind Cancellation and selects the cancellation. Now Alice clicks the Close Options dropdown. Alice clicks on Policy Transactions and selects Recent Cancellation. To view the transaction, she clicks on the Policy link. Alice clicks on Policy Transactions. The transaction list reflects the current status of the cancellation transaction. This is the end of the demonstration. \n\n--- In_Policy_10_02 ---\nUsing a policy canceled due to non-payment, start a reinstatement because the payment was received. From the policy file, click Actions. Select Reinstate Policy. Select a reason. Quote the reinstatement. Reinstate the policy. The policy goes into force on the reinstatement date. This is the end of demonstration of reinstating policy.\n\n--- In_Policy_11_01 ---\nA transaction or job is out of sequence if its effective date is earlier than other bound transactions on the policy for that contractual term. In this example, a customer calls to change a car's color in an auto policy, effective on March 1st. Later, the customer calls to make some changes effective on February 1st. Click Actions. Create the first policy change. Set the effective date of the policy change to March 1st, using the calendar. Click Next to start the policy change process. Go to Vehicles. Change the car's color to yellow. Go to PIA Coverages. Medical limit is changed to 10,000. Quote the policy change. Issue the policy. Go back to the same policy file. The customer calls again to say that he had the car painted blue. And added a new driver on February 1st. Start the second policy change job. Set the effective date to February 1st, which is earlier than the previous policy change job. Click Next to start the process. Click OK to proceed. The out of sequence message is displayed on the top of every page. Go to Drivers. Add a new driver. Create a new driver. Simply select an existing driver. Click the Roles tab. Make sure to populate the fields for year first licensed and the number of accidents and violations. Go to Vehicles. Change the vehicle's color to blue. Go to PIA Coverages. The customer also wants to select a higher medical limit. Select 20,000. Try to quote.  An error message is displayed for an out of sequence conflict that requires resolution. Go to Policy Review. Click Change Conflicts. The conflicts occur when changes are made to the same fields. In this example, the color and medical limit. The newly added driver does not cause any conflict because the change is not on the same field. You can click the Override All or Override None buttons. You can also resolve individual conflict by selecting Yes or No in the Override Future Conflicts column. In this example, click No for the car's color, so that the color is not on the same field. The color blue of the current job is only effective from February 1st to March 1st. On March 1st, the color yellow from the other job will be effective for the policy, while the liability limit will be merged forward to the job with a later effective date. Click Submit. After submitting the resolution, it cannot be reverted. Click OK to confirm. Now you can quote the policy change. Issue the policy. This is the end of demonstration of out of sequence transaction.\n\n--- In_Policy_12_01 ---\nUsers with the user admin privileges can manage users and groups. Log in as SuperUser. Click the Administration tab. Select Users and Security. The internal organization Enigma Fire and Casualty is always displayed by default. Organizations have groups and subgroups. Click a group, for example, Eastern Region. Group information. Group information is located on different tabs. The Basics tab contains the group name, parent group, organization information, security zone, etc. The Users tab lists the users belonging to this group. Users can be added and removed through this tab. The Producer Codes tab lists all producer codes available to the parent group which can be made available in the current group by setting it to Yes in the Available column. The Queues tab lists the queues used for activity assignment assignment. The Regions tab. The Regions tab lists the regions that the system uses for making assignment decisions. To search for a group, go to the Groups page under Users and Security in the left menu. For example, let's find the group for Los Angeles producers in the Armstrong organization. You can enter any free text or a partial word. Click Search. Click the desired group to view the details. Clicking the organization's link on the Basic tab takes you to the organization's detail page. After examining the organization's groups, the user admin decides to add a new group for foster city producers. Click Actions. Select New Group. Enter the group name. The new group belongs to the organization Armstrong and Company. Click the search icon. Enter the search criteria. Click Search. Select the right organization. Set producer as the type of the new group. The security zone applies restriction on internal users when they are searching for other users, groups, producer codes, or organizations. The internal user must have the same security zone as on the group to access the group. Select Western Region. Select localization. Click Update to save the new group. Openountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountount The search word is pretext. Click Search. Click the user link in the result list. The basic step lists information about the user regarding internal or external, user type, etc. The Attributes tab can be used to associate custom attributes with the user for assignment purpose. Some examples of user attributes are expertise, language, line of business. The Access tab lists the groups the user belongs to, and producer codes if user producer code security is set to yes. Manage the roles of the user on the Roles tab. In this example, Alice Applegate has two roles, Underwriter and Reinsurance Manager. The Profiles tab displays the basic information about the user. The Regions tab is used to add the geographic area for the user. The UW Authority tab lists the underwriting authority profiles used to approve underwriting issues. Let's add a new user to the group created earlier. Click Actions. Select New User. Enter the user's information. Enter the user's information. Enter name. To set a user as an external user, set External to Yes. The user belongs to Armstrong and Company. Click the search icon. Enter name. Click Search. Select the organization. Set the user type to be Producer. Enter a phone number. Click Update to save the new user. The warning messages are displayed about non-matching roles and group. Go to the Roles tab. Add the Producer role. Enter the producer role. Go to the Access tab. In the Groups section, click Add. Select User Group. Select Foster City Producers, the group created earlier. Note that the User Producer Code security is set to Yes. Users inherit Producer codes from their group, and can have additional codes added. Click Update again. The user has been created successfully. Click Update.                                                                                                               \n\n--- In_Policy_13_01 ---\nLog in as Superuser. Click Administration. The tree structure will always show the home organization of the user, either internal or external. Search for an organization using the links under Users & Security. Enter the search criteria. Click Search. The search results are displayed as links. Clicking on the links to the search criteria. Click Search. Click for Armstrong and Company to view the details. The Basics tab displays the organization info, such as, name, type, address, supervisor, etc. The Users tab lists users under that organization. The Producer Codes tab displays the list of producer codes with the description, status, branch and the preferred underwriter for each code. The Queues tab lists the queues used for activity assignment. The Regents tab lists the queues used for activity assignment. The Regents tab lists the regions that the system can use when making assignment decisions. A new organization can be created using the Actions menu. We will not go into details for this action. Next, we will look at how to manage Producer Codes. Click on the Producer Code link for Armstrong Premier. The Basics tab displays the code, description, organization, status and other information related to the Producer Code. The Roles tab lists the regions that the system can use when making assignment decisions. The Roles tab lists the roles added to the Producer Code. The Groups tab lists the groups that have this Producer Code, in View-only mode. The Users tab lists the users that have access to this Producer Code, in View-only mode. To search for a Producer Code, go to the Producer Codes page under Users & Security. Enter Search criteria and click Search. Create a new Producer Code from the Actions menu. Select New Producer Code. The Code field must be unique. The new code belongs to Armstrong and Company. Click the Search icon to find the organization. Enter the name. Click Search. Select Armstrong and Company. Enter a description. It is optional to select a preferred underwriter for underwriter assignment purpose. Go to the Roles tab. Add the Producer role. Click Update to save the new Producer Code. If multiple languages are turned on, a warning message about localization is displayed. Click Update again to save. The new Producer Code must be made available to the users in any group. Click on the Organization link. Go to the Producer Codes tab to review the codes for the organization. Go to the Group for Foster City Producers. Click the Producer Codes tab for the group. It displays all the Producer Codes from its parent, the organization. Click Edit. Set a Producer Code to be available for the current group by clicking the checkbox. Click Update to save the change. Go to the Users tab. Click the link for the user Mary Armstrong in the group. Go to the Access tab. Verify that the Producer Code is displayed under Producer Codes from group. Additional Producer Codes can be added by editing the user. Click Add in the Additional Producer Codes section. Search for the Producer Codes. Select the Producer Code to add to the user. Save the changes. This is the end of the demonstration for managing organizations and Producer Codes.  !\n\n--- In_Policy_13_02 ---\nProducerCode security restricts user access to accounts, policies and jobs. Producers with different ProducerCodes cannot view each other's book of business. After logging in as SuperUser, in the organization Armstrong and Company, check the ProducerCodes and which users have them. Click the ProducerCode for Armstrong, Los Angeles. Go to the Users tab. Note the list of users for ProducerCode 500120252. The user PaytonArmstrong is in the list, while Eli Armstrong is not in the list. Log out SuperUser. Log in as PaytonArmstrong. Create a new account and submission. Click Account. Select New Account. Select New Account. Create an account for Floral Shop. Enter the Company Name. Click Search. It returns 0 result. Click Create New Account. Select Company. Enter the New Account information. Open the ProducerCode drop-down. Select the Code for Armstrong, Los Angeles. Save the Account Info. Note down the Account Number. Next, click the Actions Menu. Select New Submission. Select the Business Owner's Product. Note the Submission Number. Log out PaytonArmstrong. Click OK to confirm. Log in as Eli Armstrong. Click Account. Log out to the Account. In the Account Number Quick Search field, type in the Account Number for the account that was just created, and search for it. Filogy of theountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountount An informational message is displayed that the search returns zero results. Next click the Policy menu. In the Submission Number Quick Search field, type in the submission number. Click the search icon. Policy Center displays a similar error that the Eli cannot access the policy. Log out Eli Armstrong. Who can view these accounts and submission other than Peyton Armstrong? Log in as a user who has the same producer code as that on the account or submission. For example, Archie Armstrong. Click the Account menu. In the Account Number field, type in the same account number, and search for it. The user is able to view the account and the submission successfully. This is the end of demonstration for producer code security. Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil \n\n--- In_Policy_13_03 ---\nUserAccess can be configured to allow external users to be assigned to groups and producer codes from other organizations. For training purpose, the configuration parameter ExternalUserAccess it is set to ProtectInternal, which allows external users to be assigned to groups and producer codes in any external organizations, but not the internal organization. After logging in a superuser, find an external user. For example, Peyton Armstrong. Select the user. Click Edit. Go to the Access tab. Because the external user access level is set to ProtectInternal, you can add groups by searching within other external organizations. Click Search and select a group. Click the Organization Search icon. Find the Organization for Builders Risk Brokers. Click Search. Click Search. Select the External Organization Builders Risk Brokers. Click Search again on the Search Groups page. Select the Producer's group. Users inherit producer codes from their assigned groups. Try to add groups within an internal organization. Click Search and select a group. Click the Organization Search icon. Find the internal organization, Enigma Fire and Casualty. Click Search. Select the Internal Organization. On the Search Groups page. Click Search again. On the Search Groups page, make sure to click Search again. Select a group from the internal organization. An error message is displayed, stating that the user does not have access to the group. Note that it can be configured to assign the external user to groups in the internal organization. You can add additional producer codes by clicking Add. Select the external organization. First, find the external organization, All Risk Insurance. Enter the name. Click Search. Select the external organization. On the Producer Codes page, click Search again. Select the Producer Code. Click Update to save the changes. You can also add users to a group by going to the group. Go to the Users tab. Click Edit. Add a user from an external organization, Commercial Insurers. Click the Search icon for Organization. Enter the name. Click Search. Select the Organization. Enter the name.   On the Search Users page, click Search again. Select the user to be added. Save the changes. This is the end of demonstration for External User Access. Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil \n\n--- In_Policy_14_01 ---\nThe forms page on a policy file displays the list of inferred forms. The inference logic is defined in the form pattern. Form patterns are managed on the Administration tab by users with the appropriate permissions. Go to Administration, Business Settings, Policy Form Patterns. Users can search for a form pattern by entering the form number, form name, product, or group code in the respective fields. For example, select the Personal Auto Product. Click the search button. This returns the form patterns that match the search criteria. Navigate the list by clicking the arrows. To view the details of a form pattern, click on the link to open it. For example, PA0148, Electronic Equipment and Media. To show you more details, we will click Edit. On the Basics tab, Code is a globally unique form pattern code to identify the form. Number is the form number. Technically, this is an arbitrary string, but it is typically driven by the form number as used by the issuance system. Policy Center uses the addition value in conjunction with the form number field to indicate if two or more patterns are different drafts of the same form. Name is the form's description. Any data related to this form collected after quote? Choose Yes to infer forms at both quote time and bind time, or No to infer forms only at quote time. When set to Yes, endorsement numbers are added to the form on a policy based on its priority. Priority is an integer used to determine the assignment order for endorsement numbers, and the processing order for forms during form inference. Reference code is used for customer integration purposes. Form names can be localized if the system is configured for another locale on the basis. In the Forms tab, the Forms tab is used for the form. On the Products tab, add the products that use the current form pattern. On the Transaction Types tab, add the policy transaction types that use this form pattern. The Jurisdictions tab has two panels. Policy Center determines if a form pattern is available for a policy using the Availability table. In this example, the form is only available in Louisiana. Jurisdictional replacement is the concept of one form replacing another form in a particular jurisdiction. The Policy Change tab contains settings for the form in Policy Change Transactions. Policy Center displays this tab if policy change has been added on the Transaction Types tab. On the Inference tab, you can choose what line the inference applies to, and any other criteria that will infer the form on the policy. You can select from the list of inference conditions. For example, selected coverage, condition, or exclusion is used. Click the search icon to search for a coverage, condition, or exclusion. Search for the coverages on the policy line. It returns the list of coverages that are defined in the product model. We will just go back to the form pattern without any changes. The Inference condition for this form pattern is, when the coverage for taped disk media exists. You can add any covered object fields to define the inference logic further. This is a list of objects that exist on the policy. Click Cancel without saving the changes. Go back to the Administration page for policy form patterns. The Add button allows you to add a new form pattern. Let's go to a sample submission to show that the forms is inferred when the condition in the form pattern is met. The submission is created. The submission is created with a vehicle in Louisiana. Go to PA Coverages. Then Additional Coverages tab. The coverage taped disk media exists and it matches the inference condition on the form pattern PA0148. Since the submission has been quoted, go to the Forms page. The form PA0148 is inferred successfully on the quoted submission. This is the end of demonstration for form pattern.\n\n--- In_Policy_15_01 ---\nThe logged-in user is a producer Archie Armstrong. We will use a personal auto submission to give an overview of the underwriting issue process. One driver, John Newton, is 20 years old. Reckless Newton is an excluded driver as shown on the Rolls tab. The cost for the new vehicle is $200,000. Try to quote. The underwriting rule framework checks the policy data and raises underwriting issues that might block the transaction at certain points. In this example, the excluded driver underwriting issue blocks quote for the current user. Go to the risk analysis page to see more details. PolicyCenter displays underwriting issues on the UW issues tab. There are two issues blocking bind. The new cost of $200,000 triggers the high-value vehicle issue. The drive of age 20 triggers the issue for primary driver under 25. The Approve button is grayed out for the issue-excluded driver. Agent must request approval if he does not have sufficient authority to approve the issues. Filogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age 20. The sogogy of age Type in the submission number. Click the search icon. Under UW Review appears on the Info bar of the submission. Go to the Risk Analysis page. Approve the Underwriting Issue for Excluded Driver. On the Risk Approval Details page, set Allow Edit to Yes, which means the approval is effective even if the policy transaction is edited and the same issue will not be raised again. Click OK to approve the issue. The submission can now proceed beyond the previously blocked point, quote. Edit Policy Transaction. Go to Vehicles. The Underwriter found the cost new was entered with an extra zero. Let's fix it. Quote again. Go to Risk Analysis. Underwriting issues are automatically removed when the condition goes away. In this example, the issue for High Value Vehicle that blocks bind was removed. Underwriting issues can be reopened after they are approved or rejected. You can also view the details of the issue. The Risk Approval Details screen displays a history for each underwriting issue. Open the View Issues Blocking drop-down. Select View All. Auto Approval. Auto Approvable Issues provide automatic approval if the user has the appropriate authority. For example, State of Garaging and Total Premium Over Authority are auto-approved for the underwriter. The underwriter must release the lock to let the agent to proceed. A UW activity is created and assigned to the initial referrer, who requested the approval. Click Release. This is the end of the overview of Underwriting Authority. The Underwriter is a\n\n--- In_Policy_16_01 ---\nUnderwriting rules are managed in the user interface and contain fields related to define and approve the underwriting issues. Log in as superuser. Go to Administration. Select Business Settings, Business Rules, Underwriting Rules. Clone an existing underwriting rule to see how the rule is defined. For example, PA, Primary Driver Under 25. Click Clone. On the Rule Details page, there are several fields that define the underwriting rule. Name identifies the underwriting rule in the user interface. Code must be unique and identifies the underwriting issue type. A checking set represents a point in a job at which conditions are checked to raise underwriting issues, such as pre-quote, bind or pre-issuance. A blocking point stops progress of the job until an issue is approved. In this example, the issue is raised at quote time but it blocks bind. Default duration specifies the property on the new approval page, and it indicates when an approval will expire. You can enter a description for the rule and a start and end date. Default duration specifies the property on the new approval page, and the new approval page, and the new approval page. In the applies to section, select which policy lines, jurisdictions, and policy transactions this rule applies to. The rule context provides policy data to be used by the rule. You can also create reusable variables. These are the list of predefined context for personal auto policies. This rule uses the context for each vehicle. In the Rule Condition section, create the conditions for raising the underwriting issue. In this case, the primary driver's age on a vehicle is less than 25. You can add a new criteria. Click the Expression field. The context objects based on the selected rule context can be used to create the left and right expressions. Click the arrow to select a mode for the expression. The list of modes contains formula, count, sum or lookup. There are also several options to choose for the operation. In the Underwriting Issue Details section, the issue key can uniquely identify the underwriting issue once it is raised. The value is compared with authority grants to determine if the user can approve this issue. Short and long description are used to display the underwriting issues on the risk analysis page. Both are localized. The fields are related to approving issue. If auto-approval is set to yes, the issue is automatically approved if the logged in user has the authority to approve it. Default edit before bind corresponds to the property on the new approval page. Yes indicates the issue will not be raised again if the policy transaction is edited after the issue has been approved. Default approval blocking point specification is This is the default approval blocking point when an issue is opened for approval. Value comparator defines how to compare the issue value to specify if it is within the authority. This is the list of available value comparators. Value format type defines which output formatter to use. This is the list of value formatter types. Default value assignment type specifies how to compute a default approval value from the value of the policy center. Policy center uses this value if the comparator is set to at least or at most. Fixed copies the issue value directly to the default approval value. Offset amount or offset percentage adds to the issue value by an offset amount or percentage to produce the default approval value. Click cancel to go back to the underwriting rules page. There are more functionalities under the more drop down menu. For example, importing and exporting the rules. Clicking the show filters button. The search filters are displayed. This is the end of the overview of the underwriting rule. Filogy of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of winner of winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner winner \n\n--- In_Policy_16_02 ---\nIn this demo, we create a new underwriting rule for drivers over 80. It should be evaluated before quote time, and no quote should be provided if the condition is true. The approval will expire after one year by default. First login as superuser. Go to Administration. Select Business Settings, Business Rules, Underwriting Rules. Click Add. Enter the required fields to define the rule on the Rule Details tab. The code must be unique. Take pre-quote as the checking set since it should be evaluated before quote. Select Block Quote for blocking point. Select 1 year for default duration after the underwriting issue is approved. Enter the description. Go to the Advanced tab. Set the fields related to approving the issue. Select at most for value comparator, so that you can set a upper limit in the underwriting authority for this underwriting issue type. Select age as the value formatter type. Select Fixed as the default value assignment type, so that the driver's age is used directly to be compared with the user's underwriting authority limit. Go back to the rule details page. Go back to the Rule Details page. In the Applies to section, click Selected for policy lines. Select Personal Auto and click the right arrow to move it to the selected list on the right. Select the Rule Context Personal Auto policy, for each driver, which provides data objects to the drivers on the policy. Next, set up the condition that raises the underwriting issue. Click in the Expression field. The list of available objects are displayed for the selected rule context. Select the object PIA driver. Type a dot to show the fields on the object. Select age. In the Operation drop-down, select the greater than sign. In the Write Expression field, type in the number 80. Next, set underwriting issue details. Use the syntax of $ and curly braces to wrap the policy objects. The fixed ID of the driver object is unique, so it can be used as the issue key to identify the underwriter issue once it is raised. Use the driver's age as the value of the underwriting issue. Enter the short description for the underwriting issue for all languages. Enter the long description for the underwriting issue. Enter the rule. Save the rule. Log out. Log in as a producer Archie Armstrong. Create a personal auto submission with a driver of Rady. We have prepared one as an example. Driver Tom Newton is 84 years old. Try to quote. The issue driver over 80 is raised, and it blocks quote. Go to risk analysis. The age is displayed with the issue, because we configured the underwriting rule to record the value. The Approve button is grayed out because the user does not have the authority. We will discuss authority profile in a separate demonstration. The Filogy of the !\n\n--- In_Policy_16_03 ---\nLogin as Superuser. Go to Administration. Select Users & Security, Authority Profiles. On the Authority Profiles, there are buttons, New, Clone, and Delete to manage underwriting authority profiles to grant authority to approve underwriting issues. We will grant Agent 2 authority to approve issues for drivers over 80 but at most 85. Click the Authority Profile for Agent 2. Edit the profile. Add a new Authority Grant. Click the search icon. Type in the name of the underwriting issue type. Click Search. Select Driver Over 80. Keep the Comparator as at most. Enter a limit in the Value field. We have granted the Profile Agent 2 to approve the issue for Driver Over 80, but at most 85. Click Update to save the changes. Fix the Localization Warning and click Update again. Ensure that the Authority Profile Agent 2 is assigned to the user Archie Armstrong. Locate the user. Go to the UW Authority tab of the user. Verify that Agent 2 is listed on the UW Authority tab. If not, click Edit and add the desired Authority Profiles. You can also remove authorities that are no longer applicable. Log out. Log in as Archie Armstrong. Log in as Archie Armstrong. Locate the Personal Auto Submission with the Driver Over 80 underwriting issue. Go to Risk Analysis. The Approve button is now available for the Driver Over 80 issue. On the Risk Approval Details page, the fields are populated based on those from the underwriting rule, for example, Allow Edit, Through, Valid and Till. You can change the at most values so that the approval is valid as long as the driver's age is less than that at. Click OK to approve the issue. This is the end of demonstration for managing authority profile.\n\n--- In_Policy_17_01 ---\nIn this demonstration, I will show you how the product model relates to PolicyCenter at a high level. This is a PolicyCenter screen. I am going to access Ray Newton's account. I am going to do a quick quote for a personal auto policy for Ray Newton's account. Early in the submission process, you are prompted to select a product name. Products are configured using a product model. The product model is at the heart of PolicyCenter's configuration. The product selection looks very simple in PolicyCenter, but the details behind it are all contained in the design of the product model. Before looking more at the product model, let me complete the personal auto submission I began. Ray Newton is the only driver, and he has a Toyota Highlander. Please hold on while I populate all the fields. Here is our quote. Now, let's get back to the product model. Guidewire's product designer tool provides insight into the product model. Let me log in and show you where some aspects of that personal auto product can be managed. Using the product designer, I can locate the specific products that you saw in PolicyCenter. Here is the personal auto product. Take a look at the details that are available for viewing here in the product designer. These are all parts of the product model. Here is the name of the product, as we saw in PolicyCenter. Here is the product description, which also appears in PolicyCenter. You can also have a look at the display key settings for the product. Here is the default for the policy term. Note that you can make some, but not all changes using the product designer. These are the options for the out-of-the-box product. Likewise, the product types for the product are personal and commercial, based on the out-of-the-box configuration. You can also define which type of account the product applies to. Additional changes to the policy lines included in policy terms can be made using these options. This concludes the demonstration.\n\n--- In_Policy_17_02 ---\nLogin to Product Designer. Click on the Products button. This is where a full insurance product can be defined. Note that a product definition is not exactly the same as configuring a product. Defining the insurance product using Product Designer includes defining the product model for a specific line of business. Changes to the user interface, business rules, or other programming details happen in Guidewire Studio. In this product list, you see the sequence of how specific insurance products will appear in the Policy Center application. After clicking on the product called Business Owners, you will see several related fields to define. These fields include the account type, which can be a company or a person. The product type field has two options, commercial or personal. This refers to the line of business type. For example, personal auto is personal, while business owners is commercial. You can define the policy term as annual, or anything else that you can use. The product type is relevant to the line of business. This is the default term that appears for the product early in the submission process. Let's take a look at the business owner product availability. Availability, in this context, refers to whether or not a SPECIFC product appears as something to select as a product option. Policy lines do not have a separately configurable availability framework. Instead, the policy line availability is tied to the product level. However, the policy line details such as coverages, coverage terms, exclusions, and conditions can be configured specifically for availability. Login to Product Designer. Click on the Products button. This is where a full insurance product can be defined. Note that a product definition is not exactly the same as configuring a product. Defining the insurance product using Product Designer includes defining the product model for a specific line of business. Changes to the user interface, business rules, and the product model for a specific line of business. Or other programming details happen in Guidewire Studio. In this product list, you see the sequence of how specific insurance products will appear in the Policy Center application. After clicking on the product called Business Owners, you will see several related fields to define. These fields include the account type, which can be a company or a person. The product type field has two options, commercial or personal. This refers to the line of business type. For example, personal auto is personal, while business owners is commercial. You can define the policy term as annual, or anything else that is relevant to the line of business. This is the default term that appears for the product early in the submission process. Let's take a look at the business owner product availability. Availability, in this context, refers to whether or not a SPEESHIFC product appears as something to select as a product option. Policy lines do not have a separately configurable availability framework. Instead, the policy line availability is tied to the product level. However, the policy line details such as coverages, coverage terms, exclusions, and conditions can be configured specifically for availability. Filogy               Filogy Filogy  Filogy        Filogy                  Filogy !            Thank you.\n\n--- In_Policy_18_01 ---\nThe purpose of this demo is to show how to work with coverages in Product Designer. Product Designer is used to view and configure coverages for PolicyCenter. Coverages are associated with policy lines, so let's look at these. Click Policy Lines. For the purposes of this demo, we'll look at the Business Owners line, also known as BOP. Click Business Owners line. Next, let's look at the coverages for this line. Click Coverages. This screen lists the coverages for this line. Notice that the columns show us the name of each coverage, the unique code assigned to that coverage, and the coverage category. The last column shows the covered object associated with each coverage. The term covered object is synonymous with coverable. Next, let's look at the details of one of the coverages. Click the Burglary and Robbery coverage. Notice that the covered object for this coverage is BOPlication. Once a coverage has been created, the covered object cannot be changed. The Existence field is currently set to Electable. This means that the coverage will not be selected by default, but it can be selected. Select the down arrow to show the other options. First, let's talk about the required value. This means that the coverage will automatically be added to the submission and cannot be unselected. Select Required. Click the down arrow again. Next, let's talk about the suggested value. This means that the coverage will automatically be added to the submission, like required, but it can be unselected. Select Suggested. Click the down arrow again. That brings us to the Defined by Script setting. This means that a developer can write a GOSA script to determine the existence of this coverage dynamically. Select that setting. Notice that the Advanced section automatically expands to show a few fields for this coverage. We're not going to talk about the initialization or removal script fields right now, but more information is available in the Policy Center documentation. I just want to point out the existence script field. If you have existence logic that needs to be determined dynamically, you can write GOSA code here to handle those types of requirements. We don't need to do that for this coverage, so I'll just set it back to Electable. Select Electable. Now let's look at the Category field. This coverage is using the Crime category. Categories are used to create logical groupings of coverages. Also, these categories are used in the Policy Center screens to group coverages. Let's look at categories for the Business Owners line. Here's the list of categories. Notice that each category has a name and a code. Let's add a new category. Click Add. This is the Add Category screen. Set the code to BOPTestCat underscore ext. And the name to Test Category. And then save the category. Click OK. Now that we have a new category, we need to validate it. Click Validate. Notice that there are no validation errors. Next, let's add a new coverage. Click Add. This is the Add Coverage screen. Set the code to BOPTestCov underscore ext. Set the name to Test Coverage. Next, let's set the category for this coverage. Click the down arrow. Select Test Category. Next, we'll select the covered object. Click the down arrow. Select Business Owners line. The covered object type defaults to Business Owners Cove, so we don't need to make any changes to that field. Also, the Available Date field defaults to the current date, so we just leave this as is. Click OK. Next, let's validate the coverage just to be sure everything is good. Click Validate. No validation errors. Next, let's talk about change lists. It's important to realize that the changes we have been making to the product model have been recorded in a change list. This makes it easy to review the changes before we make them permanent. To view these changes, click the changes icon. Notice that the Test Coverage and Test Category we created are listed here. Since these were created for this demo, we'll revert those changes. First, let's revert the coverage change. Click on Test Coverage. Now the change list is empty. This concludes the demonstration. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy \n\n--- In_Policy_19_01 ---\nThe purpose of this demo is to explore the coverage terms in Product Designer. We're starting out on the Product Model screen. The coverages and coverage terms are associated with the line, so click Policy Lines. This screen shows the policy lines that are available. We'll continue working with the business owner's line as we did in the last demo. Next, we'll look at the coverage terms associated with the burglary and robbery coverage. Click Coverages. Click the burglary and robbery coverage. Click Terms. Coverages can have zero to many terms associated with it. This coverage has one coverage term. Notice that this screen shows the name, code, and model type of each coverage term. This coverage term is a limit model type. We'll talk about this limit now. Most coverages set a limit on the maximum amount that will be paid. These limits may be set on a per incident basis, for example, a maximum payment per auto accident, or on an annual basis. For example, a maximum total amount paid in any policy year. A limit is used on the burglary and robbery coverage to record how much coverage will be provided if a burglary or robbery occurs at a given location. Now, let's look at the coverage term. This is the coverage term screen. Just like coverages, coverage terms are controlled by availability and offerings. Here's the name field for this coverage term. The name of a coverage term can be translated into multiple languages if needed. To see this, I'll click the globe icon. This is the display key by language screen. Notice that this coverage term's name has been translated into multiple languages. We don't need to make any changes on this screen, so just click cancel. Next, we'll talk about the coverage term. This coverage term is the required field. Notice that this field is checked for this coverage term. This means that the coverage term is required for this coverage. Some coverages have optional coverage terms. This coverage term is a direct term type. This means that this coverage term will allow a policy center user to enter a numeric value. This coverage is using the direct term one database column. This database field will be used to store the limit value that is entered. For this term, we are using a direct term type to specify the limit. A direct term type can store a variety of types of data. For this term, we only want to store monetary amounts, so money is selected here. Let's look at what other options are available for this field. Notice that we can have count, days, hours, or even percentages. To set it back, just select money from the drop-down list. In the next section of this screen, we have a table. This table is used to specify the default value, minimum, and maximum values for this coverage term. The values are specified by currency. For this coverage term, these have only been added for US dollars. Next, let's look at the integration section. This section contains the model type, aggregation model, and restriction model fields. These fields have been specified for this coverage term. The last field is the reference code. This field is often used for integration purposes by downstream systems. Next, let's look at the liability coverage for business owners. Scroll down and click liability. Let's look at the terms for this coverage. This is an interesting coverage. Notice that this has a limit, a deductible, and a third term that doesn't have a model type. We'll look at these in detail. First, let's look at the limit coverage term. Notice the term type for this is package. A package term is a compound collection of limits or deductibles selected as a group from a list of predefined choices. Notice that this coverage term is using the choice term 3 column. This column is used because a package term has a set of predefined choices. Next, let's look at the packages. On this screen, we can see the packages that have been defined for this term. These packages are composed of a set of three values. Now, let's go back to the coverage term screen. Notice that the 300, 600, 600 package is the default value for this coverage term. Now, let's go back to the liability coverage. Click terms. Next, let's go back to the PD deductible term. A deductible is the amount of loss paid by the policyholder. Either a specified dollar amount, a percentage of the claim amount, or a specified amount of time that must elapse before benefits are paid. The bigger the deductible, the lower the premium charged for the same coverage. The purpose of this coverage term is to allow a policy center user to select the deductible that will be paid by the policyholder in the event of a loss. This coverage term is to allow a policy center user to select the deductible that will be paid by the policyholder in the event of a loss. Let's look at this coverage term type. An option term type is a value selected from a predefined range of coverage term options. This is like the package type we saw earlier, but this will be just a single value instead of a set of values. Let's look at the options for this coverage term. The options are no deductible, $250, $500, etc. Now, let's go back to the liability coverage. Click terms. Let's look at the third coverage term. Notice that this coverage term has a type key as its term type. This means that the values for this coverage term will come from the deductible type type list. This type list is defined using Guidewire Studio, but we can see the available values by clicking the down arrow for the default value field. Here are the values in the type list. Next, let's add a new coverage term to the liability coverage. Return to the liability coverage. Click terms. For the purposes of this demo, we'll create a test coverage term that uses a package limit. To create the new coverage term, click add. This is the add term screen. We'll use this screen to set up our new coverage term. Enter a code for this new coverage term. Next, enter a name. Click the term type drop-down. Select package. Use the default values for the remaining fields. Click OK to save the new coverage term. Notice the error message. Because we specified a term type of package, we must specify at least one package for this coverage term to be valid. Let's do that now. Click packages. Click add. This is the add package screen. Enter a code for this package. No need to change the available date at this point, so just click OK. Notice that we have a different error message now. We have added a package. However, we also need to specify the contents of that package before it is valid. Click contents. Click add. Click add. Recall that this package was 102550. We need to specify the meaning of each part of the package. Click the name field. Enter P1. Click the value type field. Click the drop-down. Select money. Click the value field. Enter 10. Now, add the second part. Enter the second part as shown here. And the third part. Click validate. We have an error message that we have a monetary term, but we have not specified the currency. Let's fix that. Click the package. Click the drop-down. Select US dollars. Now, validate the scoverage term again. Notice that we have a no validation errors message. Product Designer makes it easy to duplicate packages to reduce the data entry that we must do. Click duplicate. Set the code to 2050100. The currency is already set to US dollars, so no additional changes are needed. So, click OK. Next, change the content values of this package. Change the value of the first row to 20. Second row to 50. And the third row to 100. Validate the changes. No validation errors. This process will be repeated until all packages have been added. There's a lot more about coverage terms, but what we've seen so far is a good start. Refer to the Policy Center documentation on coverage terms for more information. This concludes the demonstration.\n\n--- In_Policy_19_02 ---\nIn this demo, we will use the Homeowners Policy Line to learn more about generic schedules. To go to the Homeowners Line Coverage page, click Policy Lines, then Homeowners Line, then Coverages. Scroll down and click the Scheduled Personal Property Coverage. The Scheduled Personal Property is a Scheduled Coverage. Notice that this coverage has two pages that are not found in other coverages. Let's look at the Scheduled Properties page first. It contains field definitions to capture information for scheduled items, for example, item description. Next, let's look at the Scheduled page. On the Scheduled page is a link to another coverage HOP-Line Scheduled Cov item. It is a Scheduled item coverage used to set coverage terms, such as limit and deductibles used for rating purposes. Let's examine the Scheduled Personal Property in the application. Login is Alice Applegate. Next, open an existing Homeowners Submission. Click the down arrow next to Policy. This is the Homeowners Submission. Go to the Coverages page. Click Optional Coverages. Select the Scheduled Personal Property coverage. Click Add. The left columns map to the Scheduled Properties defined in the Schedule Coverages. The right side coverage term columns, for example, limit and deductible, are derived from the Scheduled Item Coverage. Next, we'll create new schedules with coverage terms in Product Designer. Now, we're back in Product Designer. Go to the Homeowners Line Coverages page. Now, we'll add the new schedule. Click Add. This is the Add Coverage page. Enter the code. Enter the name. Click the drop-down. Select Optional Coverages. Click the drop-down for Covered Object. From this list we can select any regular covered object. This is for a dwelling, so select Hop Dwelling. Next, click the drop-down for the Covered Object Type. Select Hop Dwelling Schedule Cove. After selecting the Scheduled Covered Object Type, two additional fields are displayed to further define the schedules. Enter a schedule code. Click OK. Notice the error message. This means that we need to define the schedule properties. Let's do that now. Click Schedule Properties. Next, we'll add Schedule Properties for the description of the item and the quantity. Click Add. This is the Add Property to Schedule screen. First we'll add the Description property. Enter the code for the Description property. And then the name. Next, we need to specify the type of this property. Click the drop-down. Since the Description property will hold text, select String Call 1. Click OK to save the property. Validate the changes. No validation errors. So let's add the Quantity Schedule property. Return to the Schedule Property page. Click Add. Enter the code. And the name. Quantity should be a numeric value. Click the drop-down to see what is available. There are two possibilities for this. Int Call 1 and Pass Int Call 1. Int Call 1 would allow the user to enter negative or positive numbers for the quantity. That really doesn't make sense when we need to know how many of an item they have. The Pass Int Call 1 will only allow positive numbers which makes sense for this. Select Pass Int Call 1. Click OK. Validate the changes. Again, no validation errors. So return to the Schedule properties. Click the Schedule page. Next, we need to set the most descriptive property field. Recall that we have description and quantity. Let's use description. Click the drop-down. Select description. Notice there are no Schedule terms available. Next, we'll fix that. Click Coverages. Click Add. Enter the code. And the name. Click the drop-down. Select Optional Coverages. Click the drop-down for Covered Object. Select the Hopdwell Schedule Cove item. The Covered Object type is selected automatically. Click OK. Click Terms. Click Add. This is the Add Term screen. Enter the code. And the name. Click the Term Type drop-down. We could use Direct, Option, or Package for this depending on the business requirements. However, to keep it simple for this demonstration we'll select Direct. Click the drop-down for the value type. Again, the value type depends on the business requirements. But we'll just use money for this. Click OK. Click the drop-down for Model Type. And select Limit. Validate the changes. No validation errors, so return to Coverages. Scroll down and click the Scheduled Coverage. Click the Schedule page. Click Select Item Coverage. Select the Scheduled Item Coverage. That completes the new schedule. This concludes the demonstration. This concludes the demonstration.  \n\n--- In_Policy_20_01 ---\nIn this demo, I will demonstrate how to find the availability settings in the product model, using Product Designer. I will show you where to specify conditions that make a coverage available or not available. A coverage's availability depends on different factors such as dates, jurisdiction, underwriting company, and job type. There are ways to configure availability using a script or grandfathering coverage that is otherwise not available. Let's take a look at a personal auto policy as an example. I am going to take a look at this collision coverage. This collision coverage has an availability set with no specifics. However, let's take a look at another coverage to see how things can differ. In this collision coverage, the availability is set to two states, Massachusetts and Michigan. Here is another example where the coverage is mostly unavailable but available in Michigan. Note that jurisdiction is not the only way to control availability. Let's take a look at one more example in the business owners line of business. This example shows where to add grandfathering and where to add an availability script. If I wanted to make a coverage available through grandfathering, I would do it here. I can add specific criteria like jurisdiction, underwriting company, or the end effective date, in order to make the coverage available. Finally, the example of where to add an availability script is located here. In the availability script section, the specific instructions for availability can be added. Note that availability lookup tables are good for simple comparisons. Product model patterns specify an availability script to handle more complex conditions. For example, a script would be necessary if the coverage pattern is only available for vehicles manufactured after 1986. For more information about availability, please consult the Policy Center documentation. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy Thank you.\n\n--- In_Policy_21_01 ---\nIn this demonstration, I will show you where to edit and configure question sets using the Product Designer tool. First, log into Product Designer. After logging in, I will click the option for Question Sets so that I can create a new question set for the business owner's line of business. In order to add a new question set, I click on Add. For the purposes of this demonstration, I am naming the new set BLP test set. The code I use is the same as the name to avoid confusion. In the dropdown for Question Set Type, I have to specify the purpose of the question set. In this example, I am assuming the question set is related to pre-qualification questions for a policy submission. Details about the specific question set types are available in the Policy Center documentation. Question sets can be included in job wizards based upon their type, answer container, and the product with which they are associated. In this example, there are three options, which is in the base configuration. The three options for the answer container are the policy line, the policy location, and the policy period. Although the qualification questions are associated with the policy period in the base configuration, I am choosing policy line for the sake of the demonstration. Now that I am done creating the question set, I select OK. The new question set appears in the list now. Note that no questions exist yet for this set. This is the end of the demonstration. This is the end of the demonstration.\n\n--- In_Policy_21_02 ---\nIn this example, I will add a pre-qualification question related to driver age for the personal auto line of business. To access the question set, I find the questions under the personal auto pre-qualification question set. There are several different types of questions to choose from. In this case, I am asking a yes or no question, so I will choose the Boolean option. As was the case with creating question sets, I need to enter a code. The code is what the answers use to point back to their questions. To make it easy to understand, I am entering a simple code related to the question. The label field should contain the actual question I want to ask. I am going to enter the question as, is the driver under age 30? Although I was clear about a Boolean format, I still have an option for specific user interface interaction. I would like a radio button. I select OK now to add and view the question in this question set. The new question appears in the question set. The question is in the list of questions. If I wanted to put this question first in my list, I can drag it up to the top of the question list. The order here in Product Designer determines the order in which the questions appear in Policy Center. This concludes the question set demonstration.\n\n--- In_Policy_21_03 ---\nIn order to define the offerings, select the product line of business, and then proceed to offerings. In this example, I will work with the personal auto line of business. Now I will select offerings for the personal auto line. If you are working with a different line of business, then you select that line first, then select offerings. The out-of-the-box version of PolicyCenter has preset offerings. On the screen, there are three offerings, the basic program, the standard program, and the premium program. I am going to select the basic program. Now I will open up the selections to see how the offering is configured. I will open the personal auto policy line, so I can see the specific details about the basic program offering. When I click on coverages, I will be able to see the specifics for this offering. I can see that the comprehensive coverage is enabled, and has been modified. In the right panel for this coverage, I am able to review details about the offering. Filogy of the offerings, including its name, code, theountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountount Finally, the suggested option refers to a coverage is automatically included in the offering, but can be removed. This concludes the offerings demonstration.\n\n--- In_Policy_22_01 ---\nModifiers impact the rating of a policy. A modifier can increase or decrease a policy premium. You might add a modifier to a product or to a policy line. In this demonstration, I will show you how to access the settings for a modifier in a product. I am going to open the commercial package to access the out-of-the-box example that is set up for modifiers. The commercial package product has one modifier. This is an individual risk premium modifier. There are several rate factors associated with this modifier. Now I will go into the specific factors to see what is included. Clicking here has the same effect as if I clicked in the navigation window. Let me take a look at the building features. Although I can already see the default minimum and maximum, I will show you where you can change the default. I will change these values. You can change the values here in product designer. Modifier availability is also impacted by jurisdiction. I will check into management as another rate factor. As was the case with building features, you can see the default values, but you can also configure them by clicking on the factor. Finally, if I want to add a new modifier, I can do it through this interface. When I click Add, I am prompted to enter several details about the modifier. Since I am not actually configuring a real setup, I will put some test values into the dialog box. In the drop-down for Data Type, four options appear by default. For more information about modifiers, please see the Guidewire document. Filogy of the                                                                          \n\n--- In_Policy_23_01 ---\nSometimes when a policy is issued, the issuance is dependent on the delivery of another piece of information. PolicyCenter has an option called Contingencies which gives the user that you can create a new contingency for a policy from an open policy transaction, that is, a submission or policy change, and from the policy file. In this example, I will work with the right construction account and a business owner's submission. In the Risk Analysis section, select the Contingencies tab. This is where you add a contingency. Select Add Contingency. Create details for the contingency relevant to the line of business. The action is what happens if the contingency is not handled by the due date. The action is configurable. More details on action configuration are available in documentation. Backslash C backslash R. Type a description for the contingency. Choose an example of an action that will happen if the contingency is not met by the due date. Select a date in the future by which the contingency requirement must be met. Save the contingency by clicking OK. A reminder message alert appears in orange text on each screen for the policy. Click the link for each contingency to view details. Documents, Notes, and Notes. And activities can be added to the contingency. Handle the contingency by clicking Resolve or Waive. Return to the Risk Analysis screen. The alert is gone, and the status displays appropriately. This is the end of the demonstration.\n\n--- In_Policy_24_01 ---\nA policy hold is placed on a transaction in the event of a natural disaster, or for changes in business to prevent users from creating new policies, or changing existing policies. Log in as SuperUser. Policy holds are managed through the Administration page. Select Business Settings, Policy Holds. Create a new policy hold to prevent personal auto-submission during hurricane season. When Underwriting Holds. When Underwriting Hold is selected for the Hold Type, the UW-issue info fields will be available. The code must be unique. Enter a detailed description of the policy hold. The hold starts on June 1. It ends on September 30. It can be open-ended. You can always update the end date when you know the exact date. Select the predefined UW-issue type, UW Policy Hold. Enter the long description for the UW-issue. It must have at least one hold rule. A hold rule. A hold rule specifies the line of business, policy transaction, date type, and coverage that Policy Center uses to determine whether or not to hold a policy transaction. There is no region added, so it applies countrywide. Save the new policy hold. Log out. Log in as an underwriter Alice Applegate. Open the account for Ray Newton. Create a new submission. Select Personal Auto. Go to the policy info page. The submission's effective date is between the policy hold's effective date range. Add a driver. Create a vehicle. Quote the submission. A warning is displayed for an underwriting issue that blocks bind. On the risk analysis page, the underwriting issue raised due to the policy hold is listed. The user does not have the authority to approve it. Let's log out. Log back in as super user. Go to Administration. Users and Security. Authority Profiles. Open Underwriter 1. Edit the authority profile. Add a new authority. Search or enter the UW issue type for UW Policy Hold. Save the changes. You may have to click Update again. Log out. Log in as Alice Applegate again. Go to the previous submission. On the risk analysis page, the user can approve the underwriting issue now. Click OK. The user can issue the policy. The user can issue the policy. Log out. Log in as super user one more time. Policy holds can be exported and imported through the admin tab. To export, select Utilities, Export Data. Under Export Administrative Data, select Policy Holds. Click Export. An XML file containing the policy holds are created. To import, go to Utilities, Import Data. Locate the policy holds XML file. Click Finish to import the file. Since we did not change the policy holds, no new entries are imported. It is useful for transferring data from one environment to another. Filogy holds the Filogy holds the Filogy holds the Filogy holds the Filogy holds the Filogy Thank you.\n\n--- In_Policy_24_02 ---\nUnderwriting referral reasons are used when a notable condition arises outside of a transaction. Log in as an underwriter Alice Applegate, and locate an enforced policy. Underwriting referral reasons are managed on policy tools, risk analysis page. Add a new UW referral reason because the loss claims on the policy are too high. Select bind referral as the issue type. Enter a short description for the issue. Enter a long description. Enter a short description. Save the new UW referral reason. Save the new UW referral reason. Underwriting referral reasons raise underwriting issues the next time a transaction is run and quoted on that policy. In this example, start a policy change. Click Next. Quote the policy change. Go to Risk Analysis. The underwriting issue loss claims too high is raised and blocks bind. Let's go back to the policy file. Go to Tools, Risk Analysis, where the UW referral reasons are managed. The underwriting referral reason can be closed. It will not raise an underwriting issues next time a transaction is run and quoted on the policy. Start another policy transaction or go to the previous policy change job. Put the policy change in draft mode to get the most updated policy data. Quote the policy change again. Quote the policy change again. Go to Risk Analysis. The underwriting issue for loss claims too high is not raised because the underwriting referral reason has been closed. This is the end of demonstration.\n\n--- In_Policy_25_01 ---\nIn this demonstration, I will show you two ways in which you can add a document. Documents can be added to accounts, policies, or jobs. I will start with the right construction account. To create or upload a document, click Action, New Document, or go to the Documents page on the left. The Upload Documents tab appears in the lower part of the screen. Select Add Files. Navigate to a file. This is an example, so I will select a text file. Click Open to choose the file. Now I will add the required details for the file. This includes the status and the document type. I am going to select the document type here. And finally, I am selecting a section type. Now I can upload this new document. Let me show you how to create a document from a template. This time I will attach the document to a policy. Click Actions, click Actions, and New Document. Then select Create from a template. To find the specific template, select Search. For this example, I will just select Other. I am specifying English as the language. From the options, I am selecting a document type related to the quote. After verifying the details, I am going to click Create Document. This creates the document from the template. When I click Update, the document gets attached to the policy. The document is not actually uploaded, but it is referred to. The document might reside on a document server. Verify the document is related to the policy by selecting Documents. In the list, I can view the document properties. This concludes the demonstration for documents. This concludes the demonstration for documents. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy Thank you.\n\n--- In_Policy_26_01 ---\nThe common business case for a note is that an end user enters a detailed record of actions related to a policy, account, job, or other entities, for example, contingency, underwriting referral reason, etc. In this example, the customer calls to update the phone number on file. The agent made the changes. To create a new note, click Actions. Select New Note. Select a topic for the note. Type in the subject. It is optional. Select the nivel of the note. Save the note. Click on the Notes link on the left navigation panel. A list of notes can be seen. A user with appropriate permissions can delete and edit the notes. In this example, the user can edit the note, but not delete. A note added to a job will be attached to the associated policy. Similarly, a note added to a policy will be attached to the associate account. You can filter the notes. Let's select a specific policy. Click Search. The notes for that policy only are displayed. This is the end of demonstration for managing notes.\n\n--- In_Policy_27_01 ---\nThe common business cases for an activity is either to do, an action, or to reveal, verify or inspect, something related to an account, policy or job. First login is an underwriter assistant, Dennis Wright. Open the account Wright construction, and create a new commercial auto submission. Enter required information. Create a new vehicle. Go back to the commercial auto line page. The product model is synchronized and the liability coverage is added. Quote the submission. The current user Dennis Wright is an underwriter assistant. The underwriter, Alice Applegate, must review the submission to accurately assess the risk, before it can be bound. Go to Actions and select New Activity, Underwriting Review, Review and Approve. In the Assign to field, search for or select Alice Applegate. Click OK to create the activity. Log out. Log back in as Alice Applegate. Go to My Activities. The new activity, Review and Approve, is listed. It has a due date, priority, etc. Click the subject link. It opens the activity and its associated policy. The user can review it and click Complete to close the activity. This is the end of demonstration for creating an activity. Filogy of theount of theount of theountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountount so                                                                                                                                                   \n\n--- In_Policy_28_01 ---\nRoles and permissions control user access to user interface components and functionality in PolicyCenter. We will log into PolicyCenter as several users with different permissions, to see how permissions influence access to PolicyCenter and the ability to see and do things. First, login is Rick Ralston, who has the underwriting supervisor role. On the desktop, there are many menu links on the left navigation menu. There is also a team tab on the tab bar. Logout. Logout. Login is Alice Applegate, who has the underwriter and reinsurance manager role. Notice the team tab is not displayed, since the underwriter role does not have the view team permission. Logout. Login as external admin, who has the user admin role. It only has the My Activities link on the left menu. It does not have the account tab on the tab tab. Logout. Logout. Login as superuser to manage the roles and permissions. The roles are managed on the Administration page. Select Users and Security, roles. A role is a name collection of permissions, and typically maps to a job title or a job function. Let's create a new role. Type in the name. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy Select the desired permission. Determine what the actions that the users with this role can perform, such as view, edit, etc. and those permissions to the role. A permission can also be removed from the role. Here are just some examples. Click Update to save the role. Open the Producer role. The role can be edited. Go to the Users tab. Policy Center lists the users, whom have this role assigned to them. You must go to the user to assign roles to the user. Go to the Roles tab. Edit the user. You can add a new role to the user. Or select a role. The Remove button is available now. Let's cancel the edit. A user has all the permissions of the roles assigned, cumulatively. This is the end of demonstration for roles and permissions.\n\n--- In_Policy_28_02 ---\nSecurity Dictionary is a series of HTML pages that documents the permissions and roles in the application. It is located at policycenter.build.dictionary.security.index.html. There are four categories at the top. Click each category refreshes the list below. An Application Permission Key is a set of one or more system permissions. For example, the Account Create Permission Key represents the system permissions for creating an account. Each Application Permission Key displays the set ofountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountount permissions needed to view or edit that page, if any. Next, move to the System Permissions section. System permissions are defined in the TypeList System Permission type. Each system permission lists the roles containing it, and the pages and elements in the user interface that reference the system permission. Next, go to the Roles section. It lists all the roles. Click to open a role. Each role lists the permissions it contains. Keep in mind that the Security Dictionary is a series of static HTML pages. If changes are made to the permissions in a given role, the Security Dictionary must be regenerated to reflect those changes. The Security Dictionary is a useful tool for both business and technical users. It can be used to check where a permission is applied, on which page, the UI element, and the permissions a role contains. This is the end of demonstration of Security Dictionary.\n\n--- In_Policy_29_01 ---\nValidation is a check executed by PolicyCenter before a given action, to ensure that the current business data is valid. Let's create a new contact. Select Person as the contact type. Validation with field validators will verify the field as the user types values. For example, the date field uses a field validator to ensure a certain format. The input mask appears as a watermark in the field and restricts user input, which must match the pattern. Letters or numbers entered using an incorrect format will not be accepted by the application. The input must match the pattern of the watermark. Validation occurs during save using business logic. Required fields have red asterisks on the UI. Error or warning messages are displayed on the UI after clicking Update. Next, let's look at how validation executed on wizard steps validates the policy data. For example, the user tries to navigate away from the page, when no driver is entered for the vehicle on a personal auto submission. A warning message is displayed. User can continue with other actions when a warning occurs. A warning or error message can be configured to be displayed at different point of time in a job. In this example, the driver missing on a vehicle is only a warning before quote, but it becomes an error when the quote button is clicked. The error or warning messages may be displayed on the top of the page, or in a worksheet at the bottom, depending on the validation method used. If the error message is displayed on a different page, there is a link to the page, where the condition exists. In this case, the error message is displayed on the Covertures page, but the error condition is on the Vehicles page. You can click on the error message. Clicking the link takes you to the Vehicles page, so that you can fix the problem. You can click the Clear button to get rid of the frame at the bottom. Try to quote again on the Vehicles page, where the problem exists. The error message is displayed again, but there is no link on the message, because it is on the same page. Errors must be resolved before the user can continue. This is the end of demonstration for validation-based                      \n\n--- In_Policy_30_01 ---\nA final audit is scheduled for workers' compensation or general liability policies in the base application. A final audit contains the verified, ultimate cost for a policy with variable basis. Login as an underwriter. In this example, the underwriter issued a general liability policy. The audit schedules are managed on its own page under Tools. The underwriter role does not have permissions to work with audits. Therefore, the action column does not have buttons visible. Note down the policy number. Log out. The auditors normally work with the audits. Login as Adam Auditor. Go to the same policy. Type in the policy number. Click the search icon. Go to the audit schedules page. In the action column, the edit button are visible for audits not yet started. The auditor can change the start date, due date, audit method, etc. The audit task batch process starts audit jobs when it is on, or passes the audit start date. Once the audit job is started, the auditor can view, and enter audit information. In this example, it has not reached the start date, so the audit job is not started. Log out. Log in as an auditor supervisor, who has the permission to manually start audit jobs. Locate the same policy. Go to audit schedules. In the action column, the edit, start, and wait buttons are visible. Manually start the final audit. There is a link to the audit job, which is available to users with the auditor role, as well. Clicking the link opens the audit wizard. Go to the details page. Enter the audited basis for the class code. Calculate the premium. Submit the final audit. Return to the policy. Go to audit schedules. Click the filter drop-down. To view the completed audits, select the option All, or Closed within last 12 months. The revise button is visible for completed final audits. It reverses the original final audit and copies the audit information to a new final audit. New information can be entered. Calculate the premium. Submit the revised final audit. This is the end of demonstration for final audit. This is the end of demonstration for final audit.                                    \n\n--- In_policy_01_01 ---\nA new account can be created for a person or a company. To create a new account, the user must have the permission to do so. For example, log in as a producer, Archie Armstrong. In this demo, we will cover the basics of creating a new account for a person. Click the Account tab at the top. Select New Account. First, it goes through the name clearance process to check if there is already an existing account. Enter the first name. Enter the last name. Click Search. It returns zero results. Click Create New Account. You can either create a new one by selecting Person, or create the account based on a matching contact by searching the address of the account. Click the address box. Let's select Person from the drop-down. Enter the address information. After you enter City, State, or Zip Code, it tries to auto-fill the rest. Start typing in the City field. Select from the list of suggested cities. The State and Zip Code are auto-filled. Select an address type. Next, you must select a producer code, which is a unique identifier that Policy Center uses to track which agents set up and service the account. In this example, the producer code should be Armstrong Premier from Armstrong & Company. Click the search icon to find the organization quickly. To search for Armstrong, type the first couple of letters of the organization name. Click Search. Select Armstrong and Company. Select the producer code, Armstrong Premier. Click Update. The account is created, and an account number is assigned. The account summary dashboard provides several information panels with details about the account holder, a general overview of the account and policies. Accounts can be edited. The account holder information can be updated, if needed. Let's just cancel out of it. The account has a status of Pending. If there are no active policies, you can withdraw the account by clicking Actions. Select Withdraw Account. The status changes to Withdraw. The status changes to Withdraw. You can reopen it by clicking Actions. Select Reopen Account. The status changes back to Pending. An account becomes active after a policy submission is bound or issued, which is described in a later of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the account of the \n\n--- In_policy_01_02 ---\nThe account file provides a complete view of the account, where you can view and edit account information. Locate the account. Select Write Construction as an example. The Account Summary Dashboard provides several information panels that are important to customer service representatives, agents, and underwriters. It contains details about the account holder, a general overview of the account, current activities, a list of policy terms, open policy transactions for the account. Claims, billing details, producers, related accounts, and notes are also on the account summary page. By default, it only lists the top three entries for many items. To view more items, go to their individual screens. The menu links in the left sidebar provide supporting information for the account. This menu is context sensitive. Go to the contacts screen. A contact setup from the account file can be used by all policies within the account. One contact can play multiple roles on the account and policy. Some contact information is shared across policies, while some revisioned at policy level, depending on the configuration. In this setup, Write Construction has two roles as a contact, account holder and named insured. Contacts can be edited by clicking the edit icon. Click cancel to go back. Clicking the view icon takes you to the contact file. Go back to the account. Go to the location screen. When an account is created, the account holder's address is the primary location by default, but it can be changed if needed. Locations are legally enforced on the policies, but Policy Center stores locations at the account level for easier location maintenance. Locations created for a policy are added at the account level automatically. You can add a new location for the account. A new location can be specific or nonspecific. Select nonspecific location. Locations are required to be added at the location location if a particular address is unknown. Select the state. Save the location information. Clicking the link on fields like the location number opens the location details screen for editing. Editing a location is only for correction purposes or updates. Certain fields cannot be changed during edits, including nonspecific location, state and country. Corrections and updates propagate to newly created policy transactions, but does not affect enforced policies. Save the changes. Save the changes. Go to the participants screen. A participant is a Policy Center user who is assigned to an account with a specific role. Participants include creators, underwriters, producers, and auditors, etc. They can be used to assign an activity related on the account. Click Edit to manage the participants. Add a participant. Add a participant.  Click the role drop-down. These are the out-of-the-box examples for roles. Let's select Auditor. Click Select User. Enter the user. Enter the search criteria. Search for the user. Select the user. Select the assigned group. Save the participant information. Go to the Policy Transactions screen. This screen lists all of the policy transactions on the account. They can be filtered by status, type, and product. The status filters are all open and complete. You can filter by all of the policy transaction types. Go to the Submission Manager screen. In the Submission Manager, all policy-related submissions appear for easy access. There are some quick action buttons. Go to the Underwriting Files screen. Underwriting files allow users to view risk information by group. The base configuration puts submissions in one group and all renewals in another group. Click the Submission group. You can view the details of this submission group. Click up to Underwriting Files to go back. Go to Related Accounts. You can view, add, and remove related accounts. Click Add. You must select a relationship. It indicates the account relationship. We'll just cancel out of it. You can also search for accounts with a common account holder or named Insured. Go to the Documents screen. You can search for and view any attached documents related to the account or policies in the account. You can attach documents to the account. All documents attached to policies are also visible at the account level. Go to the Notes screen. A note is a detailed record of the actions or thought processes of a Policy Center user. You can search for, view and edit the notes. Go to Claims. If Policy Center is integrated with the Claims system, the claim information about the account is displayed on the Claims screen. You can search for claims by policies, jobs, or dates. Go to the Billing screen. Similarly, if the billing system is integrated, it displays billing information on the Billing screen. For example, the past due amount for each policy term in Invoices. The Policy Terms tab at the bottom of the screen displays summary information for individual policy terms. You can see policies falling under this account as well as policies that are billed to this account. Go to the Invoices tab. The Invoices tab displays invoices retrieved from the billing system. You can choose to display invoices for the last 3, 6, and 12 months. These are the sample data for account billing. Go to the History screen. The History screen gives the user an overview of all the transactions related to the account and policies in the account. You can filter the history events by user, timestamp or the Related to field. Scroll down. Select the Policy for Business Owners. Click Search. It returns the history for the Business Owners policy. This is the end of demonstration for the supporting account information. Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil Fil of the treatment of treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment treatment                                                                          \n\n--- In_policy_03_01 ---\nLog in as an underwriter Alice Applegate. There are several ways to search for a policy. If you know the policy number, a quick way is to click the policy drop-down menu. Type in the policy number field. Click the search icon. If the policy exists, it opens the policy file directly. The policy file is the electronic file in which Policy Center stores policy information that is part of the legal contract. The more comprehensive option is to go to the search menu at the top. Select Policies. If free text search is enabled, as in this demo, two tabs are displayed, Basic and Advanced. On the Basic page, enter the search term, for example, a partial name. Click Search. A list of policies is required. The basic search is only available when free text search has been set up. See the documentation for instructions on how to set it up. Go to the Advanced tab. This page has more criteria for searching policies and is the default option when free text search is not set up. It invokes a database search. You can select a specific transaction or just policy. To search for a company as the primary insured on the policy, enter the company name. First name and last name. Click Search. The search results are displayed. Click Reset to clear the inputs. To search for a person as the primary insured on the policy, enter first name and last name. For example, Ray Newton. If you enter first name and last name only, you must check the exact match boxes. Click Search. The search results are listed below. If exact match is not selected for names, you must enter more information. Click Search. If you search with first and last name only, but without exact match checked, an error message is displayed. Let's enter the city and state. Then try again. Click Search.  Click Search. It finds the policy successfully. Click Reset to clear the inputs. You can search by account number or policy number directly. Enter a policy number. Click Search. Click Search.  From the result list, click the policy number link to open the policy file. This is the end of demonstration for policy search.                                          \n\n--- In_policy_03_02 ---\nThe policy information stored in PolicyCenter is part of the legal contract. You can view the details of the policy contract in a policy file. Each line of business will look different. This example is for a commercial property policy. At the top of the policy file, an info bar displays a quick list of information about the policy, which are the line of business, policy holder, associated account, policy number with the status, etc. The left navigation allows you to see a series of screens of the policy contract with a click. On policy info, you can see policy details, such as the primary named insured, the term type, effective date and expiration date. Policy contract contains screens for various covers, coverables and the associated coverages that protect the risk. For example, the policy line itself is a coverable and has liability limit. Locations, buildings, jurisdiction or other coverables and have their own specific coverages. Clicking on a location or building reveals coverage details. This is the building's details page. Click the coverage tab. These are the coverages for the building. Any blankets will appear on the blanket screen. Modifiers are factors that may affect the premium. The quote screen displays the premiums and cost breakdown of the policy, such as the taxes and surcharges, and the premium for each building. Forms are the physical representation of an insurance policy contract. They are inferred based on the policy data. The concept of forms is discussed in the forms lesson. Click Actions. The Actions menu has a list of actions you can perform on the policy, such as change, cancel, renew policy, etc. Copy Submission is a useful menu option, which copies the current policy and creates a new submission. More details about different policy lines are covered in the full application submission lesson later. This is the end of demonstration for policy contract basis.\n\n--- In_policy_06_01 ---\nAs an underwriter. To create a personal auto submission in the base application, start from a person account, for example, Ray Newton. Click Actions. Select New Submission. On the New Submission screen, you will define the organization and producer code, if different from the default, or in the case of risk reservation. You can choose to create a single or multiple policies. Click Multiple. Selecting Multiple allows you to enter the number of submissions you want to create. The default limit is 5 submissions but it is a configurable parameter. This will be useful when the account holder wants to create multiple personal auto policies. Let's select Single again. Click the quote type drop down. There are two options. Full Application gathers the complete set of information needed to apply for a bindable quote. Quick Quote gathers the minimal information needed to generate a quote and can be converted to a full application later. Let's select Full Application. You can also select a different default based state or effective date if needed. Select Personal Auto from the product list. On the Offering screen, click Offering Selection. Select an offering which has predefined product details targeted for different types of customers. Click the Back and Next button or the Step link on the left to navigate within the submission. Let's click Next. On the Qualification page, answers to the questions will pre-qualify or reject the application. Click Yes for the question Any drivers with convictions for moving traffic violations within the past three years? It displays the text box to capture the explanation. Next, enter the policy contract details. On the Policy Info screen, you can edit the primary named insured by clicking the link on the name. Click Cancel to go back to the Policy Info screen. Click the down arrow to change the primary named insured to another contact. The policy address can be similarly changed. Policy details include the term type, effective date, expiration date, and written date, etc., which appear on the right can be edited. The producer of record and underwriting company can be edited. Click Next to go to the Drivers screen. You must add at least one driver. Click Add. You can create a new driver or select an existing driver, for example, Ray Newton. Enter all the required fields. Click the Roles tab. Enter the year first licensed. This will be pre-populated if the driver has been used before. You must select the number of accidents and violations for both the policy level and account level. If not set now, you will get a validation error while trying to bind the policy. You can come back to the screen and fix it then. Click Next to go to the Vehicles screen. This is where you add the vehicles to be insured. Click Create Vehicle. Enter the Vehicle VIN. The vehicle cost new is $25,000. The license state must match the default base state. If you want to change the base state of the submission, update the garage date location. Assign drivers to vehicles. Use Ray Newton 100%. Click Next to go to the Coverages screen. A coverage is protection from a specific risk. The coverages are available as configured in the product model. You can select a different term for a coverage, for example, the Auto Liability Package. Let's add the collision coverage that protects the selected vehicle. Go to the Additional Coverages tab. Add the Rental Car Loss of Use coverage. Go to the Exclusions and Conditions tab. An exclusion defines a risk that is explicitly not protected. A condition is policy provision that defines required behaviors for the carrier and insured. Click Add Exclusion or Condition. Click Search. Select Exclude Custom Equipment. Click Add Selected Exclusions and Conditions. Click Next to the Risk Analysis screen. The Underwriter Issues tab is where any underwriting issues that might affect quote and binding of the submission can be viewed, approved, or rejected. You can manage any contingencies, prior policies, claims, losses, etc. on these tabs. Click Next to go to the Policy Review screen. After reviewing all the policy data for this submission, click the Quote button. The Quote screen displays the total cost for the submission on a read-only Quote screen. It displays the breakdown of the premiums by vehicle at the bottom. Click Next to the Forms link on the left. The Forms screen displays the forms that will be included in the policy contract. Click the Payment link. The Payment screen appears after quoting, but before issuing the policy. This is where the desired billing and payment methods retrieved from the billing system are selected. Let's take a look at the buttons for the submission. At any point, you can save the policy data by clicking Save Draft, create a new version of the policy, or close the submission by selecting one of the options, Withdraw Transaction, Decline, or Not Taken. You can do several things after quoting, including editing, binding or issuing the policy. Click Bind Options. There are two bind options. Bind only will bind the policy without issuing it. For example, the insurer needs additional documents before the policy can be issued. Let's select Issue Policy, which binds the policy first and then issues it immediately. Click OK to continue. Now you have successfully created a personal auto policy. A confirmation can be seen with several quick links for you to navigate to the next desired scenario.\n\n--- In_policy_06_02 ---\nIn this example, Wright Construction wants a new policy for a recently acquired business. The business is a motel. I will walk through the steps to create a business owner's policy submission. Start a new submission for a business owner's policy. In the offerings, you will see an option for single or multiple policies. Selecting multiple allows you to enter the number of submissions you want to create. The out-of-the-box limit is 5 submissions. The number is a configurable parameter for account holders wanting to create multiple business owner's policies. In this example, I will select single and proceed with a business owner's policy submission. Backslash C backslash R. On the offerings screen, there are predefined product details targeted for different types of customers. In this example, there are two offerings, silver or platinum. On the qualification screen, answer the questions to qualify or reject the application. This question is an example of a filtering question that could impact risk. Next, enter the policy contract details. On the policy info screen, you can set the date quote needed. Edit the primary named insured by clicking the link on the name. Click the down arrow to change the primary named insured to another contact. The policy address can be similarly changed. In this example, I will stick to the defaults. In the business owner's line, you can set up details about the policy's coverage. First, I will specify the small business type. The policy needs a coverage for employee dishonesty, so I will add that in this coverage. Existing locations from the account can be added. If you create a new location at the policy level, it is added to the account level as well. You can edit the policy location by clicking the link on the location. Coverage is selected here only applied to the selected location. In the business owner's line, you can select the desired location. Buildings are the primary rating unit for the business owner's line. On the building screen, add the buildings at each location. Select the desired location anywhere in the row and add buildings to it. Enter all the required fields. I have to enter the class code for a motel. Now I will enter the premium basis amount and the building limit. I also have to enter a business personal property limit for this building. Now I will proceed to the last few screens before I quote the policy. The modifiers screen is where you can apply credit or debit factors that affect rating. The risk analysis screen is where underwriting issues or other risk related concerns appear. The final screen before quoting is the policy review. I am going to quote the policy now. Because I am comfortable with the quote, I will issue the policy. I have one more chance to stop issuance here. I will still issue the policy. Now I can view the business owner's policy.\n\n--- In_policy_06_03 ---\nIn this demonstration, I will walk through a homeowner policy submission. I am going to use Ray Newton's account and assume he needs a homeowner's policy. Now that I found his account, I can pull it up and begin a homeowner's submission. There are several options to choose from when I start the submission. Among them, there is an option to produce a single or multiple policies. Selecting multiple allows you to enter the number of submissions you want to create. The base configuration limit is 5 submissions and is a configurable parameter. This will be useful when the account holder wants to create multiple homeowner's policies. In this case, I only want a single policy, so I am selecting single in the state of California. and a full submission. After that, I select homeowners. Now I am in the qualification screen. On the qualification screen, I have to answer questions that can qualify or reject the application. The answers to these questions can also impact later functionality in the submission. The first options are for the policy type and coverage form. The policy type is for a dwelling, and the coverage form I am going to select is HO3. In this example, Ray will live in the dwelling, so I will enter this detail. Ray has mentioned that he will live in the home full time, so I add this to the details. There is no swimming pool on this home, so I will not select that option and move on to the next screen, Policy Information. In this screen, I want to make sure I enter the date by which I am going to select. After selecting the date, I will click Next and move to the next screen to enter more property details. The dwelling screen describes the dwelling covered with details about occupancy, hazards, animals and swimming pools. Additional interests appear in a separate tab. Note that additional interests can be configured using type lists. Ray describes the home's details including a local burglar alarm in the fire protection class. I add these details in the dwelling screen. Ray also explains that all the floors have fire alarms and that there is a partial sprinkler system. Ray also explains that all the floors have fire alarms and that there is a partial sprinkler system. Ray has not yet gone through the property to get details that may impact the rating of this policy. That's okay though, I can skip this screen for now without any problems. I am going to move to the coverage's details. There are already default values for each coverage part, but you must enter details that have an asterisk. Each policy type will have a different set of values. This is only applicable for the HO3 policy. Beginning with Coinsurance in Coverage A for the dwelling, I am going to enter 80%. Next, I am going to specify for this submission that Coverage C for Personal Property covers property loss using replacement cost. Coverage D requires that I enter a loss of rental income as yes or no. If I cannot rent out the property and suffer a loss of rental income, I can enter this option here. Since Ray is going to live here full-time and there is no loss of rental income, I select No. The prohibited use coverage is related to situations that often arise from natural disasters. If a civil authority prevents access to an undamaged property, then the policy holder is covered to some extent. The number of days can vary. In this example, I am selecting 45 days, which is a generous coverage. Two weeks is a more standard protection. Now that all the coverage details are in Policy Center, I am moving on to modifiers so I can complete the initial quote. For this demonstration, I will not add any more information and take the defaults for modifiers. Based on the entered data, no underwriting problems have come up. I will move on to review the policy details and quote. After I complete the quote, I can view all the associated coverage forms. These are really the heart of the policy. After reviewing the forms, I can take a look at payment options in the payment screen. Ray is happy with the quote, so we agree that we can issue this policy based on the entered data. The policy summary screen gives an overview of the new homeowners policy. This concludes the homeowners submission demonstration. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy Thank you.\n\n--- In_policy_06_04 ---\nCommercialAuto supports asynchronous quoting. Clicking the quote button triggers asynchronous quoting when it is enabled, and the number of vehicles on the policy transaction exceeds the threshold. It runs the quote in the background, and users can navigate to other screens to work. Once the quoting completes, an activity is created to notify the user whether the quote process completes successfully or with errors. For training purpose, asynchronous quoting has been enabled. The coverable threshold has been changed from 30 to 3. We will create a commercial auto submission with four vehicles. Login as an underwriter Alice Applegate. Start from any account. For example, write construction. Click Actions. Select New Submission. On the New Submission screen, we will choose to create a single policy, full application submission for commercial auto. On the Offerings screen, select an offering which has predefined product details. Go to the Qualification screen. Answers to the questions may impact later functionality. The question Did agent inspect vehicles? Is an example of the filtered question. Clicking Yes opens another question. Enter the inspection date. Next, enter the policy contract details. On the Policy Info screen, you can edit the primary named insured, add additional named insured. Select the appropriate organization type. Policy details including the term type, effective date, expiration date, and written date, etc. appear to the right. Finally, the producer of record and underwriting company can also be edited. Move to commercial auto line. On the Commercial Auto Line screen, select Specifics for the product, fleet type and other details. Select Business Auto for product. Select Fewer than 10 units for fleet. Move to Locations. On the Locations screen, you can create new locations or add existing locations from the account. These are the garaging locations. Move to vehicles. The vehicles. The vehicles screen is where the vehicles to be insured are added. Click Create Vehicle. Select a garaging location. Select a vehicle type. Enter a VIN number. Enter the cost. Click the search icon to find the class code. Click Search. Select a class code. Select a class code. Save the vehicle information. Add three more vehicles to trigger asynchronous quoting. After adding vehicles, you must go back to the Commercial Auto Line screen. The product model is synced when the screen is loaded. The liability coverage is added under the Commercial Auto Owned Liability Group now. Click Clear to get rid of the frame at the bottom. Move to State Info. Move to State Info. Move to State Specific Coverages and Modifiers. Move to Drivers. Add Drivers Covered by the Policy. You cannot select Account Contacts on the Driver screen in the Base Application. You must manually add information for each driver. Save the driver information. Move to Covered Vehicles. Move to Covered Vehicles. The Modifiers screen displays the vehicle groups. Each row corresponds to coverages such as Liability and Collision. The column represents the vehicle group, such as AVO, Own Vehicles Only, or DVO, Designated Vehicles Only. The values can be overwritten if you have the Edit Covered Vehicles permission. If you make changes, a message will appear stating that the Covered Autos were manually edited. Move to Modifiers. You can use the Modifiers screen to apply credit or debit factors that affect rating. Move to Risk Analysis. The Risk Analysis page is where any underwriting issues that might affect quote and binding of the submission can be viewed. You can capture any contingencies, prior policies, claims, losses, etc. on these tabs. Move to Policy Review. The Policy Review screen contains all the policy data for the submission. Click the Quote button. Policy Center displays an alert that quoting will be processed in the background. To proceed, select OK. Until asynchronous quoting is completed, Policy Center displays a message at the top of the Policy Transaction screens indicating that the quote is being processed. The Policy Transaction is locked and cannot be edited. Only the Back and Next buttons are available. You can navigate to other screens to work. When quoting is completed, Policy Center unlocks the Policy Transaction and creates an activity that the quote is completed. Navigate to Desktop. Go to My Activities. Locate the activity related to the submission. The activity subject indicates whether the quote completed successfully or completed with warnings or errors. Click the activity subject to view the activity and the associated quote or validation results. In this case, the quote is successful. Policy Center displays the quote screen for the policy transaction and the associated activity in the Activity tab at the bottom of the screen. If the quote has warnings or errors, they can be viewed in the Validation Results tab next to the Activity tab. Other more serious issues, such as rating or unexpected errors, will appear on the Policy Transaction screen. Click Complete to close the activity. You can view the forms or payment screen by clicking the links on the left. Let's look at the Submission Wizard buttons at the top. At any point, you can click Save Draft to save the entered data, create a new version of the policy, or close the submission by selecting one of the options, Withdraw Transaction, Decline, or Not Taken. After quoting, you can do several things, including editing, binding or issuing the policy. There are two bind options. Bind only will bind the policy without issuing it. For example, the insurer needs additional documents before the policy can be issued. Let's issue the policy, which binds the policy first and then issues it immediately. The confirmation screen is displayed with several quick links. You have successfully created a commercial auto policy with asynchronous quoting.\n\n--- In_policy_06_05 ---\nThe two-step quoting feature improves the quote performance by splitting the quote process into two parts. The part finishing the quote is run only after the price is finalized. In the based application, two-step quoting is only enabled in the commercial property line. Let's look at how it works by logging into PolicyCenter first. Start from any account. For example, write construction. Click Actions. Select New Submission. We will walk through a single policy, full application submission for the commercial property product. On the Policy Info screen, enter the required information. Move to Buildings and Locations. There is one default location. You can add new locations if needed. Each location requires at least one building to continue. In the Actions column of a location, click the down arrow. Select Add Building, then Select a new building. Enter all the required fields on the Details tab. In the Class Code field, type it directly or click the search icon to find the appropriate class code. Select a coverage form. Go to the Coverages tab. Select the Selecting Club. For Business Income Coverage, enter an income limit. Save the building information. Move to Blankets. Select the Blankets. Blankets. Blankets provides coverage for a combination of items with a single limit for all the covered items that are included under the blanket. For example, apply a coverage across multiple locations or buildings. This is optional. Move to Modifiers. Use the Modifiers screen to apply credit or debit factors that affect rating. Move to Risk Analysis. The Risk Analysis page is where any underwriting issues that might affect quote and binding of the submission can be viewed. You can manage any contingencies, prior policies, claims, losses, etc. on those tabs. Move to Policy Review. The Policy Review screen contains all the policy data for the submission. Two-step quoting is enabled for the commercial property line. Instead of a quote button, a rate button appears in policy transactions when the policy period is in draft state. Click Rate to generate the premium for the policy and bring it to rated status. During the process, it syncs the product model, validates policy data, checks underwriting issues at the pre-quote checking set. The Quote screen displays the total cost for the submission on the Read Only Quote screen. It displays the breakdown of the premiums at the bottom. You can edit the submission and rate again until you are happy with the premium. After rating completes, execute post-rating tasks by clicking Finish Quote to bring the policy to quoted status. During the process, it infers the forms, checks reinsurance, checks underwriting issue at the quote release checking set. Move to Forms. Review the forms that will be included in the policy contract. Move to Payment. The Payment screen appears after quoting, but before issuing the policy. This is where you select the desired billing and payment methods retrieved from the billing system. You can do several things after quoting, including editing, binding or issuing the policy. From here, you can issue the policy, which first binds the policy. You have successfully created a commercial property policy with two-step Quote. ",
  "generated_at": "2026-02-13T11:42:42.136193"
}