{
  "lessonId": "ch02-l01",
  "chapterId": 2,
  "chapterSlug": "ch02",
  "lessonNumber": 1,
  "title": "Surepath Overview",
  "sourceFile": "01_ProjectPhases.mp4",
  "sourceFolder": null,
  "totalSlides": 15,
  "estimatedMinutes": 25,
  "slides": [
    {
      "slideNumber": 1,
      "title": "Welcome to SurePath",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "SurePath is Guidewire's methodology for delivering successful insurance implementations.", "level": 0, "bold": true },
        { "text": "Provides collateral, tooling, and standards for predictable, high-quality delivery", "level": 1, "bold": false },
        { "text": "Applies to new implementations, cloud transitions, and all engagement models", "level": 1, "bold": false },
        { "text": "All collateral freely available via Guidewire Community and Marketplace", "level": 1, "bold": false }
      ],
      "notes": "SurePath is the umbrella name for Guidewire's delivery methodology encompassing standards, collateral, tools, and pre-built solutions that together create a predictable path to implementation success.",
      "narration": "Welcome to the SurePath Overview. SurePath is Guidewire's comprehensive methodology for delivering successful insurance implementations.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 2,
      "title": "The SurePath Wheel",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "SurePath is organized around four interconnected pillars:", "level": 0, "bold": true },
        { "text": "Chart Your Path — Plan your journey with estimation tools, release planning, and scope alignment", "level": 1, "bold": false },
        { "text": "Guide Your Delivery — Follow proven standards, best practices, and Cloud Assurance", "level": 1, "bold": false },
        { "text": "Embed Quality — Build quality using automated checks, reference tests, and certifications", "level": 1, "bold": false },
        { "text": "Drive Value — Align delivery to business objectives with value-focused implementation", "level": 1, "bold": false }
      ],
      "notes": "The SurePath wheel shows four quadrants that work together throughout the entire implementation lifecycle. Each pillar has dedicated collateral, tools, and processes.",
      "narration": "SurePath is organized around four pillars: Chart Your Path, Guide Your Delivery, Embed Quality, and Drive Value.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 3,
      "title": "SurePath Delivery Approach",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "SurePath supports multiple engagement models and uses Agile delivery:", "level": 0, "bold": true },
        { "text": "Project Types: New Cloud Implementation, Cloud Transition, Self-Managed to Cloud, Cloud Updates", "level": 1, "bold": false },
        { "text": "Engagement Models: Guidewire-Led, Partner-Led, Customer-Led, and hybrid combinations", "level": 1, "bold": false },
        { "text": "Agile release-based delivery with 1-week sprints early, 2-4 week sprints during development", "level": 1, "bold": false },
        { "text": "Three guiding principles: Agile Delivery, Value-Driven Implementation, Success-Focused Execution", "level": 1, "bold": false }
      ],
      "notes": "SurePath adapts to different project types and engagement models while maintaining consistent guiding principles. The Agile approach uses sprint-based execution with evolving cadence throughout the project.",
      "narration": "SurePath supports multiple project types and engagement models with Agile delivery, guided by three principles: Agile, value-driven, and success-focused.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 4,
      "title": "Path to Success",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "The Path to Success defines five major milestones:", "level": 0, "bold": true },
        { "text": "Chart Your Course — Define scope, estimate effort, align on value", "level": 1, "bold": false },
        { "text": "Mobilize & Execute — Set up teams, elaborate stories, build and test", "level": 1, "bold": false },
        { "text": "Launch Your Solution — Deploy to production, migrate data, go live", "level": 1, "bold": false },
        { "text": "Adopt & Evolve — Transition to operations, drive user adoption", "level": 1, "bold": false },
        { "text": "Achieve Business Objectives — Realize committed business value", "level": 1, "bold": false }
      ],
      "notes": "Each milestone maps to specific project lifecycle phases with defined entry/exit criteria. Quality is embedded through evaluation events, BDD practices, and Cloud Assurance assessments.",
      "narration": "The Path to Success defines five milestones from charting your course through achieving business objectives.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 5,
      "title": "Guidewire Cloud Standards",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "Cloud Standards define rules and best practices for implementations:", "level": 0, "bold": true },
        { "text": "Implementation Standards — Best practices for configuring and customizing InsuranceSuite", "level": 1, "bold": false },
        { "text": "Project and Procedure Standards — Guidelines for project management and release processes", "level": 1, "bold": false },
        { "text": "Security Standards — Authentication, authorization, data protection, and compliance", "level": 1, "bold": false },
        { "text": "Testing Standards — Test coverage, performance testing, and quality gates", "level": 1, "bold": false },
        { "text": "Different standards apply by project type; all share security and testing baselines", "level": 0, "bold": false }
      ],
      "notes": "Standards are mandatory for cloud implementations. They are published on Guidewire Community under the SurePath Knowledge topic. The Solution Enablement Team supports interpretation and execution.",
      "narration": "Guidewire Cloud Standards cover implementation, project procedures, security, and testing. Different standards apply depending on project type.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 6,
      "title": "Cloud Assurance",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "Cloud Assurance ensures implementations meet Guidewire Cloud Standards:", "level": 0, "bold": true },
        { "text": "Implementation Assessments — Measure adherence to best practices and app performance", "level": 1, "bold": false },
        { "text": "Feature Assessments — Measure SurePath use, alignment to base, and maintenance reduction", "level": 1, "bold": false },
        { "text": "Phase Readiness Assessments — Evaluate entry/exit criteria before advancing phases", "level": 1, "bold": false },
        { "text": "Solution Enablement Team — Supports standards interpretation; search Community first, then log Implementation Cases", "level": 1, "bold": false }
      ],
      "notes": "Cloud Assurance is ongoing throughout the project, not a one-time check. The Solution Enablement Team maintains the knowledge base and helps interpret standards for specific contexts.",
      "narration": "Cloud Assurance verifies implementations through implementation assessments, feature assessments, and phase readiness checks throughout the lifecycle.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 7,
      "title": "SurePath Collateral & Tooling",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "SurePath provides collateral and tooling for every project phase:", "level": 0, "bold": true },
        { "text": "Estimation: RFP Estimator, Release Planner, Conceptual Sprint Planner, Value Alignment Tools", "level": 1, "bold": false },
        { "text": "Requirements: Training, MindMaps, System/Process Flows, User Story Cards, Integration Designs", "level": 1, "bold": false },
        { "text": "Governance: Shared Responsibility Model, Lead Responsibilities, Activity-Level RACIs", "level": 1, "bold": false },
        { "text": "Estimation accuracy improves: Introductory (±30%) → Workshop (±20%) → Inception (±10%)", "level": 1, "bold": false }
      ],
      "notes": "SurePath's experience-based estimation tools provide proven accuracy that improves as more information is gathered. The RACI matrices define responsibility across all parties for every project activity.",
      "narration": "SurePath provides estimation tools with proven accuracy, requirements collateral, and governance frameworks including shared responsibility models and detailed RACIs.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 8,
      "title": "Pre-Built Solutions",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "Pre-built solutions lower implementation costs and accelerate delivery:", "level": 0, "bold": true },
        { "text": "SurePath Content — Standardized, cloud-ready software driving adoption of Guidewire capabilities", "level": 1, "bold": false },
        { "text": "Guidewire GO — 35+ pre-built product models in Marketplace (US, EMEA, Canada)", "level": 1, "bold": false },
        { "text": "Guidewire Connect — Subscription-based common integrations (e-signatures, document production, payments, credit scoring)", "level": 1, "bold": false },
        { "text": "All pre-built content is developed using Cloud Standards and certified for cloud deployment", "level": 1, "bold": false }
      ],
      "notes": "Pre-built solutions are a major accelerator. SurePath Content provides standards-compliant configurations, Guidewire GO offers ready-to-deploy product models, and Guidewire Connect handles common integrations.",
      "narration": "Pre-built solutions include SurePath Content, over 35 Guidewire GO product models, and Guidewire Connect subscription integrations — all cloud-certified.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 9,
      "title": "Guidewire Project Lifecycle — 7 Phases",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "The Guidewire Project Lifecycle spans 3-24 months across seven phases:", "level": 0, "bold": true },
        { "text": "Pre-Inception (1-6 wks) — Discovery, RFP estimate, workshops, readiness", "level": 1, "bold": false },
        { "text": "Inception (2-8 wks) — Elaborate requirements, estimate backlog, training, value alignment", "level": 1, "bold": false },
        { "text": "Sprint 0 (1-4 wks) — CI/CD setup, developer environment, story elaboration", "level": 1, "bold": false },
        { "text": "Development (4-40 wks) — Plan sprints, build solution, performance testing", "level": 1, "bold": false },
        { "text": "Stabilization (2-20 wks) — Regression, E2E, UAT, InfoSec test, dry runs", "level": 1, "bold": false },
        { "text": "Deployment Prep (2-4 wks) — Finalize disaster recovery, deployment plans", "level": 1, "bold": false },
        { "text": "Launch (varies) — Data migration, deployment, end-user training, hypercare", "level": 1, "bold": false }
      ],
      "notes": "Each phase has defined activities, deliverables, entrance/exit criteria. Sprint cadence evolves from 1-week sprints in Sprint 0 to 2-4 week sprints during development. Same lifecycle applies to both self-managed and cloud.",
      "narration": "The seven-phase lifecycle spans 3 to 24 months: Pre-Inception, Inception, Sprint 0, Development, Stabilization, Deployment Prep, and Launch.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 10,
      "title": "Self-Managed vs Cloud Implementation",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "Both follow the same seven phases — the difference is infrastructure responsibility:", "level": 0, "bold": true },
        { "text": "Self-Managed — Customer configures, integrates, upgrades, tests, and deploys to own infrastructure", "level": 1, "bold": false },
        { "text": "Guidewire Cloud — Cloud Operations provides and supports infrastructure; deploys customer configuration", "level": 1, "bold": false },
        { "text": "Cloud adds teams: Customer Success, Cloud Assurance, Cloud Operations, Production Services", "level": 1, "bold": false },
        { "text": "Project Delivery Assessments (phase readiness + implementation) ensure quality throughout", "level": 1, "bold": false }
      ],
      "notes": "The fundamental lifecycle is the same, but cloud shifts infrastructure responsibility to Guidewire and adds specialized teams. This lets implementation teams focus on business configuration.",
      "narration": "Self-managed and cloud implementations follow the same lifecycle. Cloud shifts infrastructure to Guidewire and adds specialized support teams.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 11,
      "title": "Phase Transitions",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "Each phase has defined entrance and exit criteria:", "level": 0, "bold": true },
        { "text": "Entrance Criteria — Must be met before a phase can start", "level": 1, "bold": false },
        { "text": "Exit Criteria — Must be met to complete a phase; no outstanding items", "level": 1, "bold": false },
        { "text": "When criteria are not met, teams can:", "level": 0, "bold": true },
        { "text": "Adjust Staffing — Add resources to meet objectives", "level": 1, "bold": false },
        { "text": "Obtain Additional Funding — Request budget support", "level": 1, "bold": false },
        { "text": "Modify Project Schedule — Adjust timelines", "level": 1, "bold": false },
        { "text": "Mitigation Plan — Reduce impact, renegotiate criteria", "level": 1, "bold": false }
      ],
      "notes": "Phase transitions are formal checkpoints. Exit criteria from one phase may become entrance criteria for the next when phases overlap. Four structured remediation options address criteria gaps.",
      "narration": "Each phase has entrance and exit criteria. When criteria aren't met, teams can adjust staffing, obtain funding, modify schedule, or create a mitigation plan.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 12,
      "title": "Teams & Key Roles",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "The Guidewire ecosystem provides multiple layers of support:", "level": 0, "bold": true },
        { "text": "Core Team — Customer, Guidewire, and Partner resources", "level": 1, "bold": false },
        { "text": "Extended Services — Implementation (onsite/remote), specialized services (data migration, integrations, education)", "level": 1, "bold": false },
        { "text": "Advisory/Assurance — Implementation management, delivery assessments, value alignment", "level": 1, "bold": false },
        { "text": "Global Enablement — Incident handling, product development access, situation management", "level": 1, "bold": false },
        { "text": "Key roles: Delivery Manager, Functional Architect, Technical Architect", "level": 1, "bold": false },
        { "text": "SurePath Role RACIs define responsibilities for all teams across every project phase", "level": 1, "bold": false }
      ],
      "notes": "The staffing model shows concentric rings of support around the core team. SurePath provides detailed RACI matrices introduced during Pre-Inception and reviewed before each phase.",
      "narration": "The Guidewire ecosystem provides core team, extended services, advisory, and global enablement layers, with detailed RACI matrices defining responsibilities.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 13,
      "title": "Organizational Change Management",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "OCM is a critical ingredient for successful implementations:", "level": 0, "bold": true },
        { "text": "Drives organizational readiness to transition people, processes, and strategies", "level": 1, "bold": false },
        { "text": "Guidewire provides collateral and guidance; SI partners handle OCM execution", "level": 1, "bold": false },
        { "text": "Customer workstreams: Program Management, OCM, Agency Compliance, Legacy Cutover, Testing, Development, Training", "level": 1, "bold": false },
        { "text": "Targets both company users and agent users of Guidewire systems", "level": 1, "bold": false }
      ],
      "notes": "OCM is frequently underestimated. While Guidewire provides collateral, the actual execution must be handled by the customer or SI partner. Successful implementations always include strong OCM.",
      "narration": "Organizational Change Management drives readiness for transition. Guidewire provides collateral while SI partners handle execution across program management, compliance, and training workstreams.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 14,
      "title": "Chapter Summary",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "Now you know that SurePath...", "level": 0, "bold": true },
        { "text": "Enables the Path to Success for all project types — new implementations, cloud transitions, all engagement models", "level": 1, "bold": false },
        { "text": "Sets up projects for success with collateral and tools — predictable results with embedded quality", "level": 1, "bold": false },
        { "text": "Ensures teams focus on delivering value — aligned to strategic business objectives", "level": 1, "bold": false },
        { "text": "Accelerates implementations — leveraging pre-built content, Guidewire GO, and Guidewire Connect", "level": 1, "bold": false },
        { "text": "The 7-phase Project Lifecycle provides structured assessments, clear roles, and OCM support throughout", "level": 1, "bold": false }
      ],
      "notes": "Students should now be able to explain SurePath, identify its four pillars, describe the seven lifecycle phases, and understand the team structure and role of OCM.",
      "narration": "In summary, SurePath enables success for all project types with collateral, tools, pre-built solutions, and a seven-phase lifecycle with structured assessments and clear roles.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 15,
      "title": "Demo: Project Phases Overview",
      "slideType": "demo",
      "bodyParagraphs": [],
      "notes": "Watch the Project Phases Overview video covering the Guidewire Path to Success, Project Lifecycle phases, phase transitions, teams and key roles, and organizational change management.",
      "narration": "Watch this demonstration covering the Guidewire Project Lifecycle phases, teams, roles, and organizational change management.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "demoVideoIndex": 0
    }
  ],
  "videos": [
    {
      "index": 1,
      "filename": "01_ProjectPhases.mp4",
      "path": "/academy/guidewire/videos/ch02/01_ProjectPhases.mp4"
    }
  ],
  "hasNotes": true,
  "hasTables": false,
  "hasImages": true
}
