{
  "lessonId": "ch01-l01",
  "chapterId": 1,
  "chapterSlug": "ch01",
  "lessonNumber": 1,
  "title": "Guidewire Cloud Overview",
  "sourceFile": "01 - Intro - Guidewire Cloud Overview.mp4",
  "sourceFolder": null,
  "totalSlides": 28,
  "estimatedMinutes": 37,
  "slides": [
    {
      "slideNumber": 1,
      "title": "Guidewire Cloud Overview",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "Welcome to an overview of Guidewire Cloud.", "level": 0, "bold": true },
        { "text": "This chapter introduces the Guidewire Cloud platform and walks you through the five core applications that make up InsuranceSuite for the Cloud.", "level": 0, "bold": false }
      ],
      "notes": "This is the opening lesson of the Guidewire Cloud Overview chapter. It sets the stage for the rest of the chapter by introducing the platform and the five key personas we will follow throughout the tour.",
      "narration": "Welcome to an overview of Guidewire Cloud. By completing this lesson, you will be able to describe the Guidewire Cloud Applications: ProducerEngage, PolicyCenter, CustomerEngage, ClaimCenter, and Explorer.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 2,
      "title": "Lesson Objectives",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "By the end of this lesson, you will be able to:", "level": 0, "bold": true },
        { "text": "Describe the Guidewire Cloud applications: ProducerEngage, PolicyCenter, CustomerEngage Account Management, ClaimCenter, and Explorer", "level": 1, "bold": false },
        { "text": "Explain how Guidewire Cloud applications help insurers meet three essential imperatives: engage customers, innovate, and grow efficiently", "level": 1, "bold": false }
      ],
      "notes": "The two main learning objectives for this chapter. Students should be able to identify each application and explain the three strategic imperatives after completing all lessons.",
      "narration": "By completing this lesson, you will be able to describe the Guidewire Cloud Applications and explain how they help insurers engage customers, innovate, and grow efficiently.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 3,
      "title": "Three Essential Imperatives",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "Every insurer is driving these three essential imperatives:", "level": 0, "bold": true },
        { "text": "ENGAGE — Enable digital transformation, deliver service excellence, make insurance convenient", "level": 1, "bold": false },
        { "text": "INNOVATE — Accelerate product launch, empower business users, harness open ecosystem", "level": 1, "bold": false },
        { "text": "GROW EFFICIENTLY — Reduce IT complexity, achieve profitable growth, drive process improvements", "level": 1, "bold": false },
        { "text": "All supported, enhanced, and optimized through data and analytics", "level": 0, "bold": true }
      ],
      "notes": "Guidewire is the platform P&C insurers trust to engage, innovate, and grow efficiently. We combine digital, core, analytics, and AI to deliver InsuranceSuite as a cloud service.",
      "narration": "Guidewire is the platform P&C insurers trust to engage, innovate, and grow efficiently. We combine digital, core, analytics, and AI to deliver insurance suite as a cloud service.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 4,
      "title": "A Tour of InsuranceSuite for the Cloud",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "This course takes you on a tour of InsuranceSuite for the Cloud, focusing on five personas:", "level": 0, "bold": false },
        { "text": "Broker/Agent — ProducerEngage", "level": 1, "bold": false },
        { "text": "Underwriter/CSR — PolicyCenter", "level": 1, "bold": false },
        { "text": "Customer — CustomerEngage Account Management", "level": 1, "bold": false },
        { "text": "Adjuster — ClaimCenter", "level": 1, "bold": false },
        { "text": "Manager — Explore", "level": 1, "bold": false }
      ],
      "notes": "As we walk you through the policy lifecycle, you will see those strategic imperatives come to light — how to engage, innovate, and grow efficiently through the seamless integration of Guidewire Insurance Suite and straight-through processing.",
      "narration": "This course takes you on a tour of insurance suite for the cloud. We focus on five personas: the broker or agent, the customer service representative or underwriter, the policyholder, the claims adjuster, and then finally the insurance manager.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 5,
      "title": "Demo: Introduction to Guidewire Cloud",
      "slideType": "demo",
      "bodyParagraphs": [],
      "notes": "Watch the introductory video that sets the stage for the Guidewire Cloud Overview. This short clip introduces the platform, learning objectives, and the five personas we will explore.",
      "narration": "Watch the introductory video that covers the Guidewire Cloud platform overview, learning objectives, and the five key personas.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "demoVideoIndex": 0
    },
    {
      "slideNumber": 6,
      "title": "ProducerEngage",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "ProducerEngage is the agent-facing part of the Guidewire Cloud Platform.", "level": 0, "bold": true },
        { "text": "This digital application supports end-to-end business transactions that are important to an agent.", "level": 0, "bold": false },
        { "text": "Gives agents access to policy, billing, and claims information — as well as relevant tasks and activities — on a single screen", "level": 1, "bold": false },
        { "text": "Seamlessly integrated with Guidewire InsuranceSuite for a 360-degree view", "level": 1, "bold": false }
      ],
      "notes": "ProducerEngage is the first stop on our tour. It represents the Broker/Agent persona. Through ProducerEngage, agents have access to policy, billing, and claims information as well as relevant tasks and activities, on a single screen.",
      "narration": "The first stop on our tour is ProducerEngage. ProducerEngage is the agent-facing part of the Guidewire Cloud Platform. This digital application supports end-to-end business transactions that are important to an agent.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 7,
      "title": "ProducerEngage Capabilities",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "ProducerEngage enables an agent to:", "level": 0, "bold": true },
        { "text": "Find a suitable insurance quote for a customer", "level": 1, "bold": false },
        { "text": "Complete a quote", "level": 1, "bold": false },
        { "text": "Change or cancel a policy", "level": 1, "bold": false },
        { "text": "Submit a claim on a client's behalf", "level": 1, "bold": false }
      ],
      "notes": "ProducerEngage provides a streamlined interface for insurance agents to manage their book of business. The dashboard shows open quotes, policy changes, cancellations, and renewals at a glance.",
      "narration": "ProducerEngage enables an agent to find a suitable insurance quote for a customer, complete a quote, change or cancel a policy, and submit a claim on a client's behalf.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 8,
      "title": "ProducerEngage Dashboard",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "The ProducerEngage Dashboard provides a consolidated view of:", "level": 0, "bold": false },
        { "text": "Open Quotes — Quotes awaiting completion or customer response", "level": 1, "bold": false },
        { "text": "Open Policy Changes — Pending modifications to existing policies", "level": 1, "bold": false },
        { "text": "Open Cancellations — Cancellation requests in progress", "level": 1, "bold": false },
        { "text": "Open Renewals — Policies approaching renewal", "level": 1, "bold": false },
        { "text": "Open Activities — Tasks and activities for the next 7 days", "level": 1, "bold": false }
      ],
      "notes": "The dashboard is the agent's home screen in ProducerEngage. It shows a summary of all open work items and upcoming activities, allowing agents to prioritize their work effectively.",
      "narration": "The ProducerEngage dashboard provides a consolidated view of open quotes, policy changes, cancellations, renewals, and upcoming activities.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 9,
      "title": "Demo: ProducerEngage Walkthrough",
      "slideType": "demo",
      "bodyParagraphs": [],
      "notes": "Watch the full ProducerEngage demonstration. This walkthrough covers the agent dashboard, account summary, quoting workflow, policy changes, and claim submission — all from the agent's perspective.",
      "narration": "Watch this demonstration of ProducerEngage, covering the agent dashboard, account management, quoting workflow, and claim submission from the broker/agent perspective.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "demoVideoIndex": 1
    },
    {
      "slideNumber": 10,
      "title": "PolicyCenter",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "PolicyCenter is the core policy administration system in the Guidewire Cloud Platform.", "level": 0, "bold": true },
        { "text": "It is the underwriter and customer service representative's primary workspace for managing the full policy lifecycle.", "level": 0, "bold": false },
        { "text": "Supports the complete policy lifecycle from submission to renewal", "level": 1, "bold": false },
        { "text": "Provides integrated workflows for underwriting, rating, and issuance", "level": 1, "bold": false },
        { "text": "Seamlessly connected to ProducerEngage and other InsuranceSuite applications", "level": 1, "bold": false }
      ],
      "notes": "PolicyCenter is the heart of the InsuranceSuite platform. It handles all aspects of policy administration including new business, endorsements, renewals, and cancellations. This is where the underwriter/CSR persona works.",
      "narration": "PolicyCenter is the core policy administration system in the Guidewire Cloud Platform. It is the underwriter and customer service representative's primary workspace for managing the full policy lifecycle.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 11,
      "title": "PolicyCenter Capabilities",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "PolicyCenter enables underwriters and CSRs to:", "level": 0, "bold": true },
        { "text": "Review and approve submissions from agents", "level": 1, "bold": false },
        { "text": "Manage the quoting and binding process", "level": 1, "bold": false },
        { "text": "Handle policy changes (endorsements) and renewals", "level": 1, "bold": false },
        { "text": "Process cancellations and reinstatements", "level": 1, "bold": false },
        { "text": "View account and policy details with a My Summary dashboard", "level": 1, "bold": false }
      ],
      "notes": "The My Summary dashboard in PolicyCenter shows an overview of open activities, submissions, renewals, and other work items. It provides a centralized workspace for the underwriter/CSR to manage their book of business.",
      "narration": "PolicyCenter enables underwriters and CSRs to review submissions, manage quoting and binding, handle endorsements and renewals, and process cancellations.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 12,
      "title": "Straight-Through Processing",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "PolicyCenter demonstrates straight-through processing:", "level": 0, "bold": true },
        { "text": "When an agent submits a quote through ProducerEngage, the submission flows seamlessly into PolicyCenter", "level": 1, "bold": false },
        { "text": "The underwriter can review, approve, and bind the policy without re-entering data", "level": 1, "bold": false },
        { "text": "Changes made in PolicyCenter are immediately reflected in ProducerEngage", "level": 1, "bold": false }
      ],
      "notes": "Straight-through processing is one of the key benefits of the integrated InsuranceSuite platform. Data flows seamlessly between applications, reducing manual data entry and improving accuracy.",
      "narration": "PolicyCenter demonstrates straight-through processing. When an agent submits a quote through ProducerEngage, the submission flows seamlessly into PolicyCenter for review and approval.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 13,
      "title": "Demo: PolicyCenter Walkthrough",
      "slideType": "demo",
      "bodyParagraphs": [],
      "notes": "Watch the PolicyCenter demonstration. This walkthrough covers the My Summary dashboard, submission review process, policy binding, and how straight-through processing works between ProducerEngage and PolicyCenter.",
      "narration": "Watch this demonstration of PolicyCenter covering the My Summary dashboard, submission review, policy binding, and straight-through processing.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "demoVideoIndex": 2
    },
    {
      "slideNumber": 14,
      "title": "CustomerEngage Account Management",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "CustomerEngage is a digital, self-service application that enables customers to view and manage every aspect of their insurance account.", "level": 0, "bold": true },
        { "text": "Provides customers with clear visibility into claim handling processes and operations", "level": 1, "bold": false },
        { "text": "Enriches overall claims experience for policyholders", "level": 1, "bold": false }
      ],
      "notes": "CustomerEngage Account Management represents the Policyholder persona. It is the customer-facing portal where policyholders can manage their insurance accounts, view policies, file claims, and make payments.",
      "narration": "CustomerEngage is a digital, self-service application that enables customers to view and manage every aspect of their insurance account.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 15,
      "title": "CustomerEngage Capabilities",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "As a customer, you can:", "level": 0, "bold": true },
        { "text": "View your policies, claims, and invoices", "level": 1, "bold": false },
        { "text": "Manage bills for your policies and make payments", "level": 1, "bold": false },
        { "text": "View and manage payment schedules", "level": 1, "bold": false },
        { "text": "File a claim", "level": 1, "bold": false },
        { "text": "Update your personal information", "level": 1, "bold": false }
      ],
      "notes": "CustomerEngage provides a modern, consumer-grade experience for policyholders. The self-service portal reduces call center volume while empowering customers to manage their insurance needs at their convenience.",
      "narration": "As a customer, you can view your policies, claims, and invoices, manage bills, view payment schedules, file a claim, and update your personal information.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 16,
      "title": "Self-Service Claims Filing",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "CustomerEngage streamlines the claims experience:", "level": 0, "bold": true },
        { "text": "Customers can file a first notice of loss (FNOL) directly through the portal", "level": 1, "bold": false },
        { "text": "The claim flows seamlessly into ClaimCenter for adjuster review", "level": 1, "bold": false },
        { "text": "Customers can track claim status in real-time", "level": 1, "bold": false }
      ],
      "notes": "The integration between CustomerEngage and ClaimCenter demonstrates straight-through processing on the claims side. When a customer files a claim through the portal, it automatically creates a claim in ClaimCenter.",
      "narration": "CustomerEngage streamlines the claims experience. Customers can file a first notice of loss directly through the portal, and the claim flows seamlessly into ClaimCenter.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 17,
      "title": "Demo: CustomerEngage Walkthrough",
      "slideType": "demo",
      "bodyParagraphs": [],
      "notes": "Watch the CustomerEngage demonstration. This walkthrough covers the policyholder portal, account management, bill payment, and the self-service claim filing process.",
      "narration": "Watch this demonstration of CustomerEngage covering the policyholder portal, account management, bill payment, and claim filing.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "demoVideoIndex": 3
    },
    {
      "slideNumber": 18,
      "title": "ClaimCenter Overview",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "ClaimCenter is an enterprise software application designed to manage the claims process from first notice of loss through execution of financial transactions.", "level": 0, "bold": true },
        { "text": "Gives your claims team real-time access to the information they need when they need it", "level": 1, "bold": false },
        { "text": "Enables claims automation to free up resources to focus on complex claims", "level": 1, "bold": false },
        { "text": "Easily defines when and how exposures, reserves, and activities are created", "level": 1, "bold": false },
        { "text": "Ensures compliance with corporate policies and claims best practices", "level": 1, "bold": false }
      ],
      "notes": "ClaimCenter represents the Claims Adjuster persona. It is the core claims management system that handles the full claim lifecycle from FNOL to settlement. It provides adjusters with all the tools they need to manage claims efficiently.",
      "narration": "ClaimCenter is an enterprise software application designed to manage the claims process from first notice of loss through execution of financial transactions.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 19,
      "title": "ClaimCenter Capabilities",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "ClaimCenter supports the full claims lifecycle:", "level": 0, "bold": true },
        { "text": "First Notice of Loss (FNOL) — Capture initial claim details", "level": 1, "bold": false },
        { "text": "Investigation — Assign adjusters, manage exposures", "level": 1, "bold": false },
        { "text": "Evaluation — Set reserves, assess liability", "level": 1, "bold": false },
        { "text": "Settlement — Process payments and close claims", "level": 1, "bold": false }
      ],
      "notes": "The claims lifecycle in ClaimCenter follows a structured workflow. Claims flow in from multiple channels — CustomerEngage self-service, agent submissions via ProducerEngage, or direct call center entry.",
      "narration": "ClaimCenter supports the full claims lifecycle: first notice of loss, investigation, evaluation, and settlement.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 20,
      "title": "Claims Integration",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "ClaimCenter integrates seamlessly with the InsuranceSuite:", "level": 0, "bold": true },
        { "text": "Claims filed through CustomerEngage flow directly into ClaimCenter", "level": 1, "bold": false },
        { "text": "Policy information from PolicyCenter is automatically available to adjusters", "level": 1, "bold": false },
        { "text": "Claim status updates are visible to agents in ProducerEngage and customers in CustomerEngage", "level": 1, "bold": false }
      ],
      "notes": "The integration between ClaimCenter and the rest of InsuranceSuite eliminates data silos and ensures all stakeholders have access to the latest claim information.",
      "narration": "ClaimCenter integrates seamlessly with the InsuranceSuite. Claims filed through CustomerEngage flow directly into ClaimCenter, and policy information from PolicyCenter is automatically available.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 21,
      "title": "Demo: ClaimCenter Walkthrough",
      "slideType": "demo",
      "bodyParagraphs": [],
      "notes": "Watch the ClaimCenter demonstration. This walkthrough covers the claims workbench, FNOL processing, claim details, exposure management, and the adjuster workflow.",
      "narration": "Watch this demonstration of ClaimCenter covering the claims workbench, FNOL processing, exposure management, and the adjuster workflow.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "demoVideoIndex": 4
    },
    {
      "slideNumber": 22,
      "title": "Explore Overview",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "Explore is a cloud-native data analytics and visualization application that enables you to explore data from your Guidewire InsuranceSuite applications.", "level": 0, "bold": true },
        { "text": "Contains several dashboards, each of which include several visualizations that represent your data", "level": 1, "bold": false }
      ],
      "notes": "Explore represents the Insurance Manager persona. It is the analytics and reporting layer of the Guidewire Cloud platform, providing business intelligence capabilities across policy, claims, and billing data.",
      "narration": "Explore is a cloud-native data analytics and visualization application that enables you to explore data from your Guidewire InsuranceSuite applications.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 23,
      "title": "Explore Capabilities",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "With Explore, you can:", "level": 0, "bold": true },
        { "text": "Analyze your data to discover new insights", "level": 1, "bold": false },
        { "text": "Visualize and collaborate to improve business effectiveness", "level": 1, "bold": false },
        { "text": "Accelerate decision-making with real-time dashboards", "level": 1, "bold": false },
        { "text": "Access pre-built dashboards for common insurance metrics", "level": 1, "bold": false }
      ],
      "notes": "Explore enables insurance managers to make data-driven decisions. The pre-built dashboards cover key metrics like loss ratios, claim frequency, policy retention, and premium trends.",
      "narration": "With Explore, you can analyze your data to discover new insights, visualize and collaborate to improve business effectiveness, and accelerate decision-making.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 24,
      "title": "Data-Driven Insurance",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "Explore brings data analytics to the InsuranceSuite:", "level": 0, "bold": true },
        { "text": "Aggregates data from PolicyCenter, ClaimCenter, and BillingCenter", "level": 1, "bold": false },
        { "text": "Provides drill-down capabilities from summary dashboards to individual records", "level": 1, "bold": false },
        { "text": "Supports the 'Grow Efficiently' imperative by enabling process improvement through data insights", "level": 1, "bold": false }
      ],
      "notes": "Explore is the key enabler of the 'Grow Efficiently' imperative. By providing visibility into operational data, it helps insurance managers identify process bottlenecks and drive improvements.",
      "narration": "Explore brings data analytics to the InsuranceSuite by aggregating data from all core applications and providing drill-down capabilities.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 25,
      "title": "Demo: Explore Walkthrough",
      "slideType": "demo",
      "bodyParagraphs": [],
      "notes": "Watch the Explore demonstration. This walkthrough covers the analytics dashboards, data visualizations, and how managers use Explore to gain insights from InsuranceSuite data.",
      "narration": "Watch this demonstration of Explore covering analytics dashboards, data visualizations, and business intelligence capabilities.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "demoVideoIndex": 5
    },
    {
      "slideNumber": 26,
      "title": "Chapter Summary",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "In this chapter, you explored the five core Guidewire Cloud applications:", "level": 0, "bold": true },
        { "text": "ProducerEngage — Agent-facing digital application for managing policies and claims", "level": 1, "bold": false },
        { "text": "PolicyCenter — Core policy administration for underwriters and CSRs", "level": 1, "bold": false },
        { "text": "CustomerEngage — Self-service portal for policyholders", "level": 1, "bold": false },
        { "text": "ClaimCenter — Claims management from FNOL to settlement", "level": 1, "bold": false },
        { "text": "Explore — Data analytics and visualization for managers", "level": 1, "bold": false }
      ],
      "notes": "This closing lesson summarizes the key applications covered in the Guidewire Cloud Overview. Students should now be able to describe each application and explain the three essential imperatives.",
      "narration": "In this chapter, you explored the five core Guidewire Cloud applications: ProducerEngage, PolicyCenter, CustomerEngage, ClaimCenter, and Explore.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 27,
      "title": "Three Imperatives Revisited",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "You also learned how these applications support the three essential imperatives:", "level": 0, "bold": true },
        { "text": "Engage — ProducerEngage and CustomerEngage provide digital experiences for agents and customers", "level": 1, "bold": false },
        { "text": "Innovate — Straight-through processing and seamless integration enable rapid product deployment", "level": 1, "bold": false },
        { "text": "Grow Efficiently — Explore provides data insights to reduce IT complexity and drive process improvement", "level": 1, "bold": false }
      ],
      "notes": "The three imperatives — Engage, Innovate, Grow Efficiently — are the thread that connects all the Guidewire Cloud applications. Each application contributes to one or more of these strategic goals.",
      "narration": "You also learned how these applications support the three essential imperatives: engage, innovate, and grow efficiently.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 28,
      "title": "Demo: Closing Notes",
      "slideType": "demo",
      "bodyParagraphs": [],
      "notes": "Watch the closing notes video that wraps up the Guidewire Cloud Overview chapter and summarizes the key takeaways.",
      "narration": "Watch the closing notes that summarize the key takeaways from the Guidewire Cloud Overview chapter.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "demoVideoIndex": 6
    }
  ],
  "videos": [
    {
      "index": 0,
      "filename": "01-intro-guidewire-cloud-overview.mp4",
      "path": "/academy/guidewire/videos/ch01/01-intro-guidewire-cloud-overview.mp4"
    },
    {
      "index": 1,
      "filename": "02-producer-engage.mp4",
      "path": "/academy/guidewire/videos/ch01/02-producer-engage.mp4"
    },
    {
      "index": 2,
      "filename": "03-policy-center.mp4",
      "path": "/academy/guidewire/videos/ch01/03-policy-center.mp4"
    },
    {
      "index": 3,
      "filename": "04-customer-engage.mp4",
      "path": "/academy/guidewire/videos/ch01/04-customer-engage.mp4"
    },
    {
      "index": 4,
      "filename": "05-claim-center.mp4",
      "path": "/academy/guidewire/videos/ch01/05-claim-center.mp4"
    },
    {
      "index": 5,
      "filename": "06-explore.mp4",
      "path": "/academy/guidewire/videos/ch01/06-explore.mp4"
    },
    {
      "index": 6,
      "filename": "07-closing-notes.mp4",
      "path": "/academy/guidewire/videos/ch01/07-closing-notes.mp4"
    }
  ],
  "hasNotes": true,
  "hasTables": false,
  "hasImages": true
}
