{
  "chapter": "ch01",
  "chapter_title": "Guidewire Cloud Overview",
  "domain": "cloud platform architecture",
  "video_count": 1,
  "total_duration_seconds": 2058.76,
  "total_duration_formatted": "00:34:18.760",
  "total_words": 5090,
  "avg_confidence": 0.9763,
  "videos": [
    {
      "filename": "01 - Guidewire Cloud Overview.mp4",
      "stem": "01 - Guidewire Cloud Overview",
      "duration": "00:34:18.760",
      "words": 5090,
      "confidence": 0.9763
    }
  ],
  "full_text": "--- 01 - Guidewire Cloud Overview ---\nWelcome to an overview of Guidewire Cloud. By completing this lesson, you will be able to Describe the Guidewire Cloud applications, ProducerEngage, PolicyCenter, CustomerEngage, ClaimCenter, and Explorer. Also, you will be able to explain how Guidewire Cloud applications help insurers meet three essential imperatives. Describe the guidewire to help them engage, innovate, and grow efficiently. Guidewire is the platform P&C insurers' trust to engage, innovate, and grow efficiently. We combine digital, core, analytics, and AI to deliver InsuranceSuite as a cloud service. Insurers want to be able to engage, provide an innovative experience for their customers, and ultimately make insurance convenient. Insurers want to innovate and to rapidly prototype and deploy products faster than ever before. And, insurers want to be able to grow efficiently, reducing IT complexity and ultimately driving process improvement. This course takes you on a tour of InsuranceSuite for the cloud. We focus on five personas, the broker or agent, the customer service representative or underwriter, the policy holder, the claims adjuster, and then finally the insurance manager. As we walk you through the policy lifecycle, you will see those strategic imperatives come to light. How to engage, innovate, and grow efficiently through the seamless integration of Guidewire InsuranceSuite and straight through processing. The first stop on our tour is ProducerEngage. ProducerEngage is the agent facing part of the Guidewire cloud platform. This digital application supports end-to-end business transactions that are important to an agent. Through ProducerEngage, agents have access to policy, billing, and claims information as well as relevant tasks and activities, on a single screen. ProducerEngage is seamlessly integrated with Guidewire InsuranceSuite for a 360-degree view. ProducerEngage enables an agent to Find a suitable insurance quote for a customer. Complete a quote. Change or cancel a policy. And submit a claim on a client's behalf. For our tour of ProducerEngage, Archie Armstrong, an agent, will demonstrate how straight through processing streamlines every aspect of his job. Our demonstration begins with our agent, Archie Armstrong, logging into ProducerEngage. Archie is immediately presented with the ProducerEngage dashboard, where he can see at a glance everything that requires his attention today. Across the top, a row of dynamic tiles provides quick access to open quotes, endorsements, open cancellations, and renewals. Listed below the tiles are all open activities that are assigned to Archie and are due within the next 7 days. Each activity can be expanded to show its details. Activities are actionable items that an agent can work on anytime. Activity details include the escalation date as well as the activity type and a brief description. Currently, there are no activity notes, but Archie could add a note. After Archie has completed this activity, he marks it as complete. A hyperlink provides access to the related policy. Notice the panel on the right. This demonstrates the ability to access and display information from outside data sources such as Twitter on the ProducerEngage dashboard. This dashboard, and in fact, all of ProducerEngage, is a configurable framework. The expectation is that customers will want to lightly configure the application for their particular requirements and introduce their unique look and feel. The tabs across the top of the screen enable an agent to access any account and to search for a specific account. The tiles are built-in filters. You can filter on recently viewed, recently created, personal accounts, and commercial accounts. In the recently viewed area, hyperlinks provide the means to navigate quickly to an account. Notice there are tabs to access policies and claims. ProducerEngage is seamlessly integrated with Policy Center and Claim Center. There is also a tab for viewing activities. Now that you have had a brief tour of ProducerEngage, let us go to the Right Construction account. Here is the account summary screen for Right Construction. This screen provides an agent with a 360-degree view of one account. The screen exposes relevant policies, claims, and billing data, again demonstrating the seamless integration between Guidewire Insurance Suite products. You can see summary details that are drawn from Policy Center. Producer information includes billing details from Billing Center. The Claims tile provides access to data in Claim Center. The Contacts tile accesses all contacts that are associated with this account. Let us click Open Activities. Here is a list of all open activities related to Right Construction with a button for creating a new activity. An agent can view open quotes, open endorsements and transactions in general, and any claims associated with the account. The Billing and Payment tile provides access to billing information for the account. Here, you can set up automatic payments and manually make payments. Notice the Billing Health check for the account. Let us return to the summary screen where our Producer can start a new quote. To initiate a new quote for Right Construction, Archie would start by clicking New Quote for this account. Suppose, however, another customer calls while he is viewing the Right Construction account. Archie can simply click Start New Quote, and he will be prompted to start a quote for any account. Archie clicks New Quote for this account to start the submission workflow. First, he selects his Producer Code. The Producer Code restricts the products that a given agent can sell. Archie chooses a commercial property submission for this example. Notice the information at the top of the screen does not allow editing. This is a function of the submission workflow, which is designed to be streamlined and intuitive, reducing potential customer frustration and redundancy and minimizing the potential for error. After Archie clicks Next, the Submission Work tree is displayed on the left side, showing the steps of the wizard-driven workflow. The next step is to add buildings and locations to the submission. An agent could capture buildings and locations by adding each one manually. However, Archie chooses to upload an SOV by means of an Excel spreadsheet. To get started with uploading spreadsheets, you must download the pre-formatted template first. Archie selects an SOV that was created earlier. In a matter of seconds, nine buildings have been imported into Producer Engage. As you can imagine, this facility is a real time saver. Customers working with legacy systems typically need to manually key in all information concerning buildings and locations. This task can take hours to accomplish. The ability to import effortlessly these nine buildings and feed the data into the workflow significantly streamlines the operation. Archie chooses building number one for the main office. Let us take a look at everything that was captured with a click of a button. Here is the full address with the territory code, the building number, and the property class code. All of the coverages have been defaulted based on Guidewire offerings, which are essentially packages of coverages and limits for specific risks. By using default values for all the coverages, the workflow provides a straight-through, low-touch underwriting environment. Of course, Archie can choose to modify the coverages, but the more he deviates from the defaulted values, the more data he will need to provide. And the less streamlined the quote cost becomes. Let us scroll through the coverages. You can see the building coverage, the business personal property coverage, the business income coverage, and extra expense coverage as well. Archie can edit any of these coverages. However, he decides to accept all the defaults. He returns to the buildings and locations screen and clicks next. Now that all nine buildings with limits and coverages have been captured, the workflow sends the information over to the rating engine. In the process, any business, underwriting, and reinsurance rules are run against risks before the rating engine returns the total cost of the quote. In a matter of minutes, Archie has gone from submission to quoted on a nine-schedule commercial property quote. That is impressive. Archie clicks next and scans the policy information to be sure it is correct. Notice the email and phone data has been populated with information that was stored with the account. The payment details screen is next. This screen is populated with information drawn from Billing Center, which includes payment details and a list of pay plans. As a side note, Guidewire can handle any type of pay plan. These are created in Billing Center and exposed on the digital layer. Archie selects the first plan in the list with 10% down payment and monthly installments. In the Payment Options area, Archie enters the payment details and clicks Buy Now to kick off the process of binding and issuing the policy. The payment has been successful. A unique policy number has been attached to the policy. This number is hyperlinked in case the agent wants to view or edit the policy data. If Archie needs to make a change, he can do so here. He can renew or cancel the policy. He can also populate the declaration page and print and send the ID cards. The screen provides all this capability, some of which can also be automated. Here is the transaction for the new policy with a premium of $29,934. In this example, you saw how quickly an agent can bind and issue a policy using Guidewire straight through processing workflow capabilities. Now let us see what happens when an underwriting rule interrupts the process of a new commercial property submission. Let us return to the right construction account, where the new policy is listed under Issued Policies. As in the earlier demonstration, Archie starts a new commercial property submission. He finds and selects the SOV file to upload the spreadsheet. And here are the 9 buildings. For the purposes of this example, we have created an underwriting rule that raises an underwriting issue for any building that was constructed earlier than 1990. Archie opens the main office building number 1 location to edit the building details. He types 1984 for the year built and save the changes. Then he continues with the same workflow that you saw earlier. Again, the workflow sends a submission to the rating engine, which returns the total cost of the quote. The underwriting rule could have fired now, when the rating engine returns the premium amount. However, the rule was designed to fire after Archie selects a pay plan for the policy. This means all the data will have been captured before the underwriting referral occurs. Archie enters payment information and clicks Buy Now. The underwriting rule fires and returns an error, as we expected. Archie clicks OK. An alert on the quote screen informs the agent that underwriting issues have been raised for this quote. The issue listed under underwriting issues is building older than 1990, which has blocked the bind. Archie decides to refer the issue to the underwriter. First, he adds a brief note that tells the underwriter it is part of a larger account that is clean account. See main office number 1. He clicks confirm. The quote has been referred to the assigned underwriter for review. An activity has been created for the underwriter review and approval. Immediately, Archie sees the new activity, review and approve for commercial property for right construction, assigned to Christine Kraft, the underwriter. The activity was created by Archie Armstrong with a note for Christine Kraft. The next stop on our tour of insurance suite for the cloud is Policy Center. Policy Center provides full end-to-end policy management and issuance functionality including quoting, rating, underwriting, policy generation, and statistical reporting. It offers seamless integration between core functionality and predictive analytics. Policy Center enables agents and underwriters to create and manage policies, handle inquiries and service accounts, evaluate risks, view policies, create activities. Policy Center brings efficiency to every step from submission to renewal. In the previous demonstration, we met Archie Armstrong, an agent, who created two submissions using Producer Engage. The second submission raised an underwriting issue because of an older building. In this next demonstration, we meet Christine Kraft, the underwriter who was assigned at the issue. Christine Kraft begins by logging into Policy Center. Policy Center is a role-based application, which means everything from screen flow, to access, to data, is based on permissions granted to Christine's role as an underwriter. The summary screen is Christine's desktop. As you can see, the desktop is designed for ease of use. All the data that is pertinent to Christine's role is either displayed on the screen or is available at the click of a button. Here is the review and approve activity for write construction that was just sent from Producer Engage. Before Christine opens the activity, let us take a few minutes to take a brief tour of Policy Center. I have already mentioned the intuitive design of the summary screen. Like Producer Engage, Policy Center is a framework that is intended to be lightly configured by each customer. The sidebar on the left contains the Actions menu at the top. This menu is dynamic, the available menu options vary, based on the current context and the role of the user. For example, from the summary screen, Christine can create a new submission or a new account. In addition, the sidebar provides menu links for quick access to the summary screen, to activities, submissions, renewals, and so on. Across the top are tabs for accessing accounts, policies, contacts, and search. Christine can search by account number. She can select new account or, on the policy tab, start a new submission. Policy Center has sophisticated search functionality. The built-in search uses solid platform capability, which provides features such as Sounds Like and Fuzzy Search. The options available on the Administration tab are based on Christine's role and permissions. Users and Security gives her access to users, organizations, producer codes, and so on. Now, let us look at the right construction account. Christine clicks the link to the account holder summary dashboard. An account holder is the primary contact associated with an account. This screen provides a complete 360-degree picture of the customer relationship and current interactions by displaying data across all accounts for which the contact is the account holder. The account holder summary is especially useful for customer service representatives. Notice the billing and claims health check on the right-hand side of the screen. Below are the policies owned by Wright Construction, any open policy transactions, and open claims. Christine can access the details for a policy or claim by clicking the hyperlink reference number. Again, thanks to seamless integration of Insurance Suite, she can view policy, claim, and billing data all on the same screen. Christine scrolls back to the top and clicks the link to the account summary for Wright Construction. The overview area provides the ability to recalculate the 3-year premium, loss ratio, and total losses. Below that is the billing health check. Here is a list of current activities and then a list of enforced policies. Christine clicks the first policy number to view the latest policy for Wright Construction. The policy summary screen focuses on a single policy and provides the ability to calculate the term financials at the policy level. On the My Summary screen, Christine examines the recent activity that was sent over by Archie Armstrong, our agent. The activity detail indicates this is a review and approve activity. Christine clicks View Notes for details. She sees that this is part of a larger account, which is a clean account. See the main office first location. She puts the submission in edit mode, in case she needs to make any changes. Notice this editable submission has a similar format to the wizard-driven workflow that you saw in Producer Engage. However, as an internal user with the role of underwriter, Christine has more access than agents have when using Producer Engage. Christine clicks Buildings and Locations. She knows to look specifically at main office building number one. She notes that the year built is 1984, as Archie entered it. Christine realizes the age of the building should not be a problem because the account is clean, and this is only one of several buildings. This screen provides the same import or export capability that Archie used in Producer Engage. From here, Christine can proceed to rate the risk. She is routed to the quote screen, where you can see the total cost broken out by total premium in taxes and surcharges. There are also two errors displayed in red. The first error states, this policy has one or more outstanding contingencies. The second error says, this quote will require underwriting approval prior to binding. These messages proactively let the underwriter know that there are some items that need to be taken care of before the policy can be issued. If Christine tries to finish quote, the pre-quote issues screen lists the issues that are blocking the quote. Christine's next step is to go to the Risk Analysis tab and approve the issues that are blocking bind. She clicks the Risk Analysis tab. The Underwriting Issues tab is where Christine can view the issues that are blocking the quote and either approve them and continue on with the workflow or reject them. If she approves the issue, she can then bind and issue the policy. Let us look at the Predictive Analytics tab. The data on this screen illustrates the capability of Guidewire Predictive Analytics. Embedded data and analytics ensure that you know what's working, what's not, and what to do next. Currently, you see data based on pre-built models that are embedded into the workflow. These represent one approach to predictive analytics. Guidewire also supports a BYOM or Bring Your Own Models approach by enabling deployment, integration, and monitoring of predictive models created using third-party tools. This dashboard shows an example of the risk models that we provide. Profitability, customer retention, and expense reduction. These analytics can be used as suggestions, or they can provide input for automation, which is the case for the inspection contingency workflow. Here you can see that a contingency has automatically been attached to the policy based on these predictive analytics. In the demonstration, the Predictive Analytics dashboard showed an example of how real-time predictive insights are embedded in Guidewire core systems. Predictive analytics involves building models to predict future results. It provides guidance to frontline decision makers while continuously measuring business value. Predictive analytics for profitability helps by improving rating sophistication and granularity while identifying and addressing pricing inaccuracies. It improves underwriting profitability. Predictive analytics for claims helps better manage claim indemnity and loss adjustment expenses. In this section, Christine Craft, an underwriter, took us on a brief tour of Policy Center, where she handled an underwriting issue. We also visited the Predictive Analytics dashboard and viewed a contingency that was automatically attached to the policy based on these predictive analytics. The next tour stop is, Customer Engage Account Management. Customer Engage Account Management is a digital, self-service application that enables customers to view and manage every aspect of their insurance account. Customers have clear visibility into claim handling processes and operations. Customer Engage enriches the overall claims experience for policyholders. Thanks to seamless integration with Policy Center, Claim Center, and Billing Center, customers can view their invoices, policies, and claims, manage bills, make payments, and manage payment schedules. As you will see in our demonstration, a customer can file a claim and update personal information. In the previous demonstrations, we have looked at the policy lifecycle from the viewpoint of an agent and then an underwriter. In this next demonstration, we will switch to the customer perspective as we take a tour of Customer Engage Account Management. Meet Ben Wright, a customer who needs to file a claim. Ben Wright of Wright Construction begins by logging into Customer Engage Account Management. Wright Construction is the same account we have been working with in the previous demonstrations. Ben's home page is the account summary screen. This screen was designed to answer the main questions that customers have when they call a customer service representative. What is my balance? Is anything past due? If so, can I pay it? And, when is my next bill? Answers to these questions are clearly displayed across the top of Ben's home screen. Ben can also see all policies held by his account. The account summary screen is another example of the seamless integration of policy, claims, and billing functionality. From this application, Ben can file a first notice of loss for a claim. He can purchase insurance. He can make payments. On the billing summary, Ben can view the billing and payment details for each of the Wright Construction policies. He can also make a payment or set up automatic payments. Similarly, the claims tab provides a list of hyperlinked claim numbers for claims filed by Wright Construction with the status of each claim and the number of the related policy. Ben returns to his home screen and locates the most recent policy. He clicks, file a claim to start a first notice of loss. Guidewire empowers insureds, placing billing, policy, and claims functionality at their fingertips. Here is the new claim tab. Notice the loss date is prefilled with today's date, and the policy number is preselected. After Ben clicks next, the claim information work tree is displayed on the left side, showing the steps of this wizard-driven workflow. The next step is for Ben to describe what happened, why he is filing a claim. He selects the loss cause and enters the date of notice. The important point here is not the details of this claim, but the ease with which an insured is able to capture the claim details. Ben goes on to select the affected building. As anyone who has taken a first notice of loss will attest, this is a stressful situation. Customer Engage is designed to make this process as easy and painless as possible. Ben has entered the claim details. He selects the address from a list of addresses associated with his account. In the next step, Ben will have the opportunity to upload any pictures or supporting documents. If there are witnesses or other third parties, he can add them here. Ben simply adds himself as a contact and clicks next. The new claim summary provides Ben the opportunity to make sure the information is correct and complete. And he is ready to submit the claim. The claim has been successfully submitted. A unique claim number has been attached to the claim. Behind the scenes, the workflow has automatically triaged the claim and assigned it to a claims adjuster based on the characteristics of the claim. Productivity is improved by ensuring the right claim to assign to the right adjuster. In this demonstration, Ben Wright, a policyholder, filed a claim using Customer Engage Account Management. In the next section, the adjuster who was assigned to the new claim will examine the claim in Claim Center. Next stop on the tour, Claim Center and the Guidewire Cloud Platform. Guidewire Claim Center is the P&C industry's most trusted claims management solution. Claim Center manages the entire claims process from first notice of loss through execution of financial transactions. With Claim Center, your claims teams have real-time access to the information they need, when they need it. When Scott logs into Claim Center, he also has instant access to relevant information stored in Policy Center, Billing Center, and Contact Manager thanks to the seamless integration of all insurance suite products. Claim Center enables claims automation to free up your resources to focus on complex claims and easily defines when and how exposures, reserves, and activities are created. Claim Center ensures compliance with corporate policies and claims best practices throughout your organization. In the previous demonstration, we met Ben Wright, a policyholder, who filed a claim using Customer Engage Account Management. Based on the claim characteristics, automated workflow has assigned Ben's first notice of loss to Scott Henson, a claims adjuster. In this next demonstration, the persona of Scott, a claim adjuster, will view the new claim in Claim Center. Scott logs into Claim Center. Like Policy Center, Claim Center is a role-based application. Everything that follows from ScreenFlow to Data Access is based on Scott's role as a claims adjuster. Scott immediately sees two activities on his summary screen that are related to the first notice of loss that Ben filed just minutes ago from Customer Engage Account Management. Before Scott addresses the new claim, let us take a few minutes for a brief tour of Claim Center. As in Policy Center, the Actions Menu and Claim Center is dynamic, varying the menu options that are available to Scott based on his permissions and on the current context. The sidebar provides additional menu links for quick access to activities, claims, exposures, subrogations, pending adjustments, and so on. Across the top in the tab bar, Scott can start a first notice of loss or search for a claim. The Team tab, which is available to managers and supervisors, provides a visual management tool for managing groups that Scott supervises and any subgroups of those groups. At this point, Scott clicks the claim number to examine the new claim. Of course, since this is a new claim, there is not much detail yet. The summary screen provides an overview of how the claim is performing. In the basics area, you see the associated target, which is calculated by a rule and is specific to the insurer. If there were a potential large loss associated with the loss, a high-risk indicator would be displayed in the top right. Currently, no exposures are listed for the claim. Guidewire provides an automated exposure and reserve creation capability. Services attached to the claim would be listed here. Scott views the planned activities, which are based on business logic and are part of the claims tree. Notice the Health Metrics tab, which shows several health metrics that have been run against the claim and indicate how efficiently the claim is being processed. The Policy tab gives Scott a view into the policy related to the claim. He can see the locations, coverages, and limits without having to switch back and forth between Claim Center and Policy Center. Claim financials are available on the Financials tab. Of course, for a new claim, there is not much to show yet. Starting with the first demonstration and ending with this demonstration in Claim Center, you have now walked through a day in the life of a policy. The final stop on our tour of Guidewire Cloud is Explore. You will see what Guidewire provides from a business intelligence and operational reporting standpoint. Explore is a cloud-native data analytics and visualization application that enables you to explore data from your Guidewire insurance suite applications. Each Explore dashboard includes several visualizations that represent your data. With Explore, you can Analyze your data to discover new insights Visualize and collaborate to improve business effectiveness Accelerate decision-making Explore streams data from core systems and other sources into a scalable data infrastructure to provide near real-time insights and enable smart business decisions. For our final demonstration, Sonia Weber, an insurance manager, will take you on a tour of Guidewire Live analytics and Explore. Explore is a cloud-only service that provides 10 pre-built operational dashboards, which provide valuable near real-time insights into claim and policy performance. As an insurance manager, Sonia needs up-to-the-minute feedback on how claims are performing. The first tab Sonia sees is Claim Center Open Inventory Management, which provides an operational overview of how the claim process is performing. The dashboard is fed in near real-time from our data lake based on claims, and can be used to optimize your claims operations. Sonia sees there are currently 207 open claims, with a total incurred of more than $3.5 million. She looks over to the right to view various claim metrics, such as open claims by segment and open claims by assigned group. In the lower left is claim volume by user which is ordered by overdue activities. These, and other metrics, help Sonia optimize her everyday claims management. An important feature of Explore is the ability to export the data from any of the dashboards in RAW or CSV format. Sonia can easily send the charts and figures displayed on her dashboard to a downstream reporting system. Another dashboard that aids Sonia in assessing claim performance is the Claim Center Activity Workflow. Here she can see at a glance activity metrics, such as the number of activities, with metrics on average hours create to close and subject of the activity. Here is a breakdown of activities by assigned user. Explore also features several policy reports, grouped under two categories, Underwriting Conversion and Underwriting Efficiency. The Active Submissions dashboard presents an analysis of open submissions. The horizontal toolbar along the top consists of dynamic filters that enable users to update the display by effective date, company, line of business, and product. A filter can also be added to bring in criteria from the product model. Let us take a brief look at Underwriting Efficiency. Here you can see there are 218 underwriting issues with an average of two days to close. The chart on the right shows underwriting issues by type. Maybe Sonia has a particular underwriting issue that is being flagged significantly more often than the rest, causing a processing bottleneck for the straight-through processing workflow. Sonia can see in near real-time, the issue that is causing the bottleneck. Scrolling down, we see the Underwriting Issues search report. And above the search list is a reminder that Sonia can export the data in RAW or CSV format. She can also create ad-hoc operational reports. In this demonstration, Sonia Weber, an insurance manager, gave you a brief tour of Guidewire Live Analytics. You learned how to explore streams data from insurance suite databases and provides near real-time insights that enable smart business decisions. In this demonstration, Sonia Weber, an insurance manager, gave you a brief tour of Guidewire Live Analytics. You learned how to explore streams data from insurance suite databases and provides near real-time insights that enable smart business decisions. You have completed the course, Guidewire Cloud Overview. You should now be able to Describe the Guidewire Cloud Applications, Producer Engage, Policy Center, Customer Engage, Claim Center, and Explorer. Also, you should be able to explain how Guidewire Cloud Applications help insurers meet these three essential imperatives, engage customers, innovate, and grow efficiently. . . . . .  ",
  "generated_at": "2026-02-13T11:27:33.721522"
}