{
  "lessonId": "ch03-l01",
  "chapterId": 3,
  "chapterSlug": "ch03",
  "lessonNumber": 1,
  "title": "User Story Cards & Implementation Tools",
  "sourceFile": "01_User Story Cards_Assignment.pdf",
  "sourceFolder": null,
  "totalSlides": 18,
  "estimatedMinutes": 45,
  "slides": [
    {
      "slideNumber": 1,
      "title": "User Story Cards Overview",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "In this lesson, you will learn about an integral tool used in InsuranceSuite implementations: User Stories and User Story Cards.", "level": 0, "bold": false },
        { "text": "What You Will Learn:", "level": 0, "bold": true },
        { "text": "The difference between User Stories and User Story Cards", "level": 1, "bold": false },
        { "text": "The 7 tabs that make up a standard User Story Card", "level": 1, "bold": false },
        { "text": "How to document requirements using each tab", "level": 1, "bold": false },
        { "text": "Where User Story Cards fit in the project lifecycle", "level": 1, "bold": false },
        { "text": "How to estimate and plan delivery sprints using User Stories", "level": 1, "bold": false },
        { "text": "This lesson includes 7 hands-on exercises. Download the exercise files below before starting.", "level": 0, "bold": true }
      ],
      "notes": "This chapter is exercise-heavy. Students should download the User Story Card Exercise Excel file before starting. The solution file is also available for reference after completing the exercises.",
      "narration": "Welcome to Chapter 3, where we'll dive into one of the most important tools in Guidewire implementations — the User Story Card. This is a hands-on lesson, so make sure you've downloaded the exercise Excel file before we begin. By the end, you'll be comfortable documenting requirements across all seven tabs of a User Story Card.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "downloadFiles": [
        { "label": "Story Card Exercise", "path": "/academy/guidewire/assignments/ch03/02_UI-StoryCard-Exercise.xlsx" },
        { "label": "Story Card Solution", "path": "/academy/guidewire/assignments/ch03/03_UI-Story-Card-Exercise-Solution.xlsx" }
      ]
    },
    {
      "slideNumber": 2,
      "title": "User Stories vs. User Story Cards",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "User Stories", "level": 0, "bold": true },
        { "text": "A User Story is a short, simple description of a feature told from the perspective of a user. It follows the format:", "level": 0, "bold": false },
        { "text": "\"As a [role], I want [feature] so that [benefit]\"", "level": 1, "bold": true },
        { "text": "Example: \"As a PolicyCenter user with the role of Agent, CSR, Underwriter, or Manager, I want to be able to enter and maintain policy information including name insured, additional named insured, policy term, and company information.\"", "level": 1, "bold": false },
        { "text": "User Story Cards", "level": 0, "bold": true },
        { "text": "A User Story Card is the detailed specification document that expands on a User Story. It is an Excel workbook with multiple tabs that capture all the technical and functional details needed to implement the story.", "level": 0, "bold": false },
        { "text": "Think of the User Story as the 'what' and the User Story Card as the 'how' — it bridges the gap between business requirements and technical implementation.", "level": 0, "bold": false }
      ],
      "notes": "The User Story Card is the primary requirements document in Guidewire implementations. It replaces traditional requirements specifications with a structured, tab-based format that developers and QA can directly work from.",
      "narration": "Let's start with the fundamentals. A User Story is a simple statement describing what a user wants to do, written in everyday language. But to actually build that feature, we need much more detail. That's where the User Story Card comes in. It's an Excel workbook that takes that simple story and expands it into detailed specifications — UI fields, typelists, validation rules, mockups, and acceptance criteria. Each tab serves a specific purpose in the implementation process.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 3,
      "title": "The 7 Tabs of a User Story Card",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "A standard User Story Card contains these tabs:", "level": 0, "bold": false },
        { "text": "1. Document Control — General information, ownership, and change history", "level": 0, "bold": true },
        { "text": "2. UI Mockup — Screenshots or mockups of the proposed UI changes", "level": 0, "bold": true },
        { "text": "3. UI Fields — Detailed field-level specifications for every UI change", "level": 0, "bold": true },
        { "text": "4. Typelists — New or modified dropdown values (typelists)", "level": 0, "bold": true },
        { "text": "5. Validation & Business Rules — Data validation and business rule requirements", "level": 0, "bold": true },
        { "text": "6. Action Items — Outstanding tasks related to the story's completion", "level": 0, "bold": true },
        { "text": "7. Acceptance Criteria — Conditions that must be met for the story to be accepted", "level": 0, "bold": true },
        { "text": "Each tab builds on the previous one. The Document Control tab header is carried over to all subsequent tabs, maintaining consistency across the entire card.", "level": 0, "bold": false }
      ],
      "notes": "The tab structure is standardized across Guidewire implementations. Some projects may add additional tabs, but these 7 are the core set. The UI Final tab is also included but only used after development is complete.",
      "narration": "Every User Story Card follows the same structure with seven core tabs. Think of them as layers of detail — from the high-level overview in Document Control, through visual mockups, down to individual field specifications and validation rules. We'll explore each tab in detail over the next several slides.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 4,
      "title": "Tab 1: Document Control",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "The Document Control tab tracks general information about the User Story and details of document changes. It has three main sections:", "level": 0, "bold": false },
        { "text": "Top Section — Identification & Ownership:", "level": 0, "bold": true },
        { "text": "Story Card Name — Usually comes from the release planner or Jira", "level": 1, "bold": false },
        { "text": "User Story Owner — The business analyst responsible for this story", "level": 1, "bold": false },
        { "text": "Product, Theme, GW-ID, Status, Product Alignment, SMEs", "level": 1, "bold": false },
        { "text": "Middle Section — Descriptions (Rows 14-22):", "level": 0, "bold": true },
        { "text": "Standard Description — Auto-populated from the release planner when the story card is generated", "level": 1, "bold": false },
        { "text": "Customer Description — The customer's version of the user story, if different from the standard description", "level": 1, "bold": false },
        { "text": "Value Justification — Business benefits for the story, especially important for enhancements", "level": 1, "bold": false },
        { "text": "Bottom Section — Revision History (Rows 25-32):", "level": 0, "bold": true },
        { "text": "Tracks who changed the document, when, and what was changed. Always increment the version number with each update.", "level": 1, "bold": false }
      ],
      "notes": "Exercise 2.2.1 covers this tab. Students should enter their name as Story Owner, add Alice Applegate as SME, update the Customer Description with elaboration notes, and add a revision history entry.",
      "narration": "The Document Control tab is your starting point. It identifies the story — who owns it, what product it's for, and its current status. The descriptions section is particularly important: the Standard Description comes from the release planner, while the Customer Description captures what the customer actually said during elaboration sessions. The revision history at the bottom is your audit trail — always update it when you make changes.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 5,
      "title": "Exercise: Document Control Tab",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "Exercise 2.2.1 — Practice Documenting the Document Control Tab", "level": 0, "bold": true },
        { "text": "Open the User Story Card Exercise Excel file and navigate to the Document Control tab. Complete the following:", "level": 0, "bold": false },
        { "text": "1. In the User Story Owner field, enter your name as the Owner", "level": 0, "bold": false },
        { "text": "2. In the SMEs field, add Alice Applegate as one of the SMEs you'll be working with", "level": 0, "bold": false },
        { "text": "3. In the Customer Description, update it to reflect these elaboration findings:", "level": 0, "bold": false },
        { "text": "Primary Named Insured for Personal Auto could be a company or a person", "level": 1, "bold": false },
        { "text": "System must require a person (not company) as Primary or Secondary Named for each submission/policy", "level": 1, "bold": false },
        { "text": "Users do not anticipate using the Date Quote Needed field", "level": 1, "bold": false },
        { "text": "Need a new Client Type field with values: Livestock, Corp, Other (data from Salesforce.com)", "level": 1, "bold": false },
        { "text": "Need to identify primary phone number to call an insured", "level": 1, "bold": false },
        { "text": "Need a new Policy Type field with values: Premier, Platinum, Assigned Risk", "level": 1, "bold": false },
        { "text": "Need a new Plan field (used when Policy Type is Assigned Risk) with values: AIPSO, Pool", "level": 1, "bold": false },
        { "text": "4. Add a revision history entry with your name, today's date, and description of changes", "level": 0, "bold": false }
      ],
      "notes": "This exercise establishes the scenario that will be used throughout all subsequent tab exercises. The 7 requirements listed here will be documented across UI Fields, Typelists, Validation Rules, and Acceptance Criteria tabs.",
      "narration": "Now it's your turn. Open the exercise Excel file and work through this exercise. The requirements you're documenting here — like the new Client Type field and Policy Type field — will carry through to every subsequent tab. This is a realistic scenario based on an actual PolicyCenter implementation.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "downloadFiles": [
        { "label": "Story Card Exercise", "path": "/academy/guidewire/assignments/ch03/02_UI-StoryCard-Exercise.xlsx" }
      ]
    },
    {
      "slideNumber": 6,
      "title": "Tab 2: UI Mockup",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "The UI Mockup tab captures a visual representation of the proposed UI changes.", "level": 0, "bold": false },
        { "text": "Purpose:", "level": 0, "bold": true },
        { "text": "Provide a screenshot or graphical mockup showing what the screen will look like after implementation", "level": 1, "bold": false },
        { "text": "Help developers and stakeholders visualize the target state before coding begins", "level": 1, "bold": false },
        { "text": "Best Practices:", "level": 0, "bold": true },
        { "text": "Use mockup tools or modify existing screen captures to represent the new/changed UI", "level": 1, "bold": false },
        { "text": "Label each UI modification with the related requirement number for traceability", "level": 1, "bold": false },
        { "text": "Only include UI-related content — no other requirements should be documented here", "level": 1, "bold": false },
        { "text": "The header section is carried over from the Document Control tab automatically", "level": 1, "bold": false },
        { "text": "Exercise 2.2.2 (Optional):", "level": 0, "bold": true },
        { "text": "Create a mockup showing: removal of Date Quote Needed field, placement of new Client Type field, Primary Phone identification, new Policy Type field, and new Plan field.", "level": 0, "bold": false }
      ],
      "notes": "The UI Mockup tab is visual-only. Some teams use tools like Balsamiq or Figma, while others simply annotate screenshots from the existing application.",
      "narration": "The UI Mockup tab is where you show, not tell. Rather than describing where a field should go, you paste in a screenshot or mockup that visually shows the target state. This is optional for our exercise, but in a real project it's incredibly valuable — it prevents misunderstandings between business analysts and developers about where things should appear on screen.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 7,
      "title": "Tab 3: UI Fields",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "The UI Fields tab is the most detailed tab in the User Story Card. It tracks every field change for the screens in this story.", "level": 0, "bold": false },
        { "text": "For each field, you document up to 18+ properties:", "level": 0, "bold": false },
        { "text": "Name of DV or LV — Screen name (Detail View or List View) where the field is located", "level": 1, "bold": false },
        { "text": "OOTB, New, Modified — Is this an out-of-the-box field, a new field, or a modified field?", "level": 1, "bold": false },
        { "text": "Display Key — Path of the display key for the field label (for internationalization)", "level": 1, "bold": false },
        { "text": "Label — The label shown on screen", "level": 1, "bold": false },
        { "text": "Path — Data model path to the object the field refers to", "level": 1, "bold": false },
        { "text": "Table — Physical database table where the field is stored", "level": 1, "bold": false },
        { "text": "Field Name — Name of the field in the data model", "level": 1, "bold": false },
        { "text": "Field Type — Data type: bit, varchar, integer, decimal, money, or percentage", "level": 1, "bold": false },
        { "text": "Field Length — Maximum characters or digits for the field", "level": 1, "bold": false }
      ],
      "notes": "This is the most complex tab. Students should cross-out fields not needed and add rows for new fields. Each row represents one UI field change.",
      "narration": "The UI Fields tab is where the real detail lives. Think of it as a complete specification for every field that's being added, modified, or removed. For each field, you're documenting everything a developer needs to know — the screen location, data type, length, whether it's mandatory, its default value, and more. Let's look at the remaining properties on the next slide.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 8,
      "title": "UI Fields — Additional Properties",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "Continuing the UI Fields properties:", "level": 0, "bold": false },
        { "text": "Typelist — Points to a predefined typelist that limits acceptable values for the field", "level": 1, "bold": false },
        { "text": "Editable — Whether the field is editable (true, false, or conditional via Gosu code)", "level": 1, "bold": false },
        { "text": "Mandatory — Whether the field is required (true, false, or conditional via Gosu code)", "level": 1, "bold": false },
        { "text": "Visible — Whether the field is visible to the user", "level": 1, "bold": false },
        { "text": "Available — Whether the user can interact with (click on) the field", "level": 1, "bold": false },
        { "text": "Default Value — The default value; blank means null or not selected", "level": 1, "bold": false },
        { "text": "Notes, Conditions — Document conditional editable, visibility, and mandatory requirements here", "level": 1, "bold": false },
        { "text": "Label (Localized) — For multi-locale support", "level": 1, "bold": false },
        { "text": "Wave or Release — Implementation release number for tracking across releases", "level": 1, "bold": false },
        { "text": "LOB — Line of Business, if the story crosses multiple lines", "level": 1, "bold": false },
        { "text": "Tip: Look for the small red triangles next to fields in the Excel file — hover over them to see additional information about each column.", "level": 0, "bold": true }
      ],
      "notes": "The Editable, Mandatory, Visible, and Available fields are critical for Gosu developers. When these are conditional, the conditions must be clearly documented in the Notes column.",
      "narration": "These additional properties are where it gets interesting. The Editable, Mandatory, and Visible fields can all be conditional — meaning they change based on other values. For example, the Plan field might only be visible when Policy Type is set to Assigned Risk. When you have conditional behavior, document the exact conditions in the Notes column so developers know exactly what Gosu code to write.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 9,
      "title": "Exercise: UI Fields Tab",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "Exercise 2.2.3 — Practice Documenting the UI Fields Tab", "level": 0, "bold": true },
        { "text": "Navigate to the UI Fields tab in your exercise file. Enter the appropriate information for these new/changed fields:", "level": 0, "bold": false },
        { "text": "1. Removing or Hiding the Date Quote Needed field", "level": 0, "bold": true },
        { "text": "Mark the existing field as Modified. Set Visible to false or note it should be hidden.", "level": 1, "bold": false },
        { "text": "2. The new Client Type field", "level": 0, "bold": true },
        { "text": "Mark as New. Document the typelist reference, field type, and that data comes from Salesforce.com integration.", "level": 1, "bold": false },
        { "text": "3. The Primary Phone identification", "level": 0, "bold": true },
        { "text": "Document how users will identify which phone is the primary contact number.", "level": 1, "bold": false },
        { "text": "4. The new Policy Type field", "level": 0, "bold": true },
        { "text": "Mark as New. Define the typelist with values: Premier, Platinum, Assigned Risk.", "level": 1, "bold": false },
        { "text": "5. The new Plan field", "level": 0, "bold": true },
        { "text": "Mark as New. Note that this field is only visible/available when Policy Type = Assigned Risk. Values: AIPSO, Pool.", "level": 1, "bold": false }
      ],
      "notes": "Cross-out OOTB fields that are not needed. Add new rows for new fields. Be as specific as possible about conditional visibility and mandatory requirements.",
      "narration": "This is the most important exercise in the chapter. Take your time with each field — think about what a developer would need to know to implement this correctly. Pay special attention to the Plan field, which has conditional visibility tied to the Policy Type value.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 10,
      "title": "Tab 4: Typelists",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "The Typelists tab documents new and changed typelists (dropdown values) included in the User Story.", "level": 0, "bold": false },
        { "text": "What is a Typelist?", "level": 0, "bold": true },
        { "text": "A typelist is a predefined list of values used to constrain a field. In the UI, it typically appears as a dropdown. Guidewire has hundreds of OOTB typelists in the Data Dictionary — only document new or changed ones here.", "level": 0, "bold": false },
        { "text": "Properties to document for each typecode:", "level": 0, "bold": true },
        { "text": "Name of Typelist — The typelist name referenced in UI Fields tab", "level": 1, "bold": false },
        { "text": "New, Modified — Is this a new customer-defined typecode or a modification to an OOTB one?", "level": 1, "bold": false },
        { "text": "Code — Internal name used for the typecode", "level": 1, "bold": false },
        { "text": "Typecode Name — User-visible name shown in the dropdown", "level": 1, "bold": false },
        { "text": "Description — Long description for the Data Dictionary", "level": 1, "bold": false },
        { "text": "Priority — Order of dropdown values (use intervals of 10, 20, 30 to allow future inserts)", "level": 1, "bold": false },
        { "text": "Retired — True/False indicating if the typecode is no longer used", "level": 1, "bold": false },
        { "text": "Conditions — Visibility conditions (static or dynamic filtering)", "level": 1, "bold": false }
      ],
      "notes": "Enter one row per dropdown value (typecode), not per typelist. Priority intervals of 10 allow future values to be inserted between existing ones.",
      "narration": "Typelists are Guidewire's way of managing dropdown values. They're predefined lists stored in the Data Dictionary. There are so many OOTB typelists that we don't list them all here — you only document the new and changed ones. When entering values, use priority intervals of 10 so you can easily insert new values between existing ones later. And remember — each row represents one dropdown value, not the entire typelist.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 11,
      "title": "Exercise: Typelists Tab",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "Exercise 2.2.4 — Practice Documenting the Typelists Tab", "level": 0, "bold": true },
        { "text": "Navigate to the Typelists tab in your exercise file. Enter the appropriate information for these new/changed typelists:", "level": 0, "bold": false },
        { "text": "1. Client Type typelist (New)", "level": 0, "bold": true },
        { "text": "Typecodes: Livestock, Corp, Other", "level": 1, "bold": false },
        { "text": "Data source: Salesforce.com integration", "level": 1, "bold": false },
        { "text": "2. Policy Type typelist (New)", "level": 0, "bold": true },
        { "text": "Typecodes: Premier, Platinum, Assigned Risk", "level": 1, "bold": false },
        { "text": "3. Plan typelist (New)", "level": 0, "bold": true },
        { "text": "Typecodes: AIPSO, Pool", "level": 1, "bold": false },
        { "text": "Condition: Only visible when Policy Type = Assigned Risk", "level": 1, "bold": false },
        { "text": "Remember: One row per typecode value. Use priority intervals of 10 (10, 20, 30...) for ordering.", "level": 0, "bold": true }
      ],
      "notes": "Students should create approximately 8 rows total: 3 for Client Type, 3 for Policy Type, and 2 for Plan. Each row gets its own Code, Name, Description, and Priority.",
      "narration": "Let's practice documenting typelists. You'll create entries for three new typelists from our scenario. Remember to enter one row per dropdown value — so Client Type with three values means three rows. Set the priorities at 10, 20, 30 so there's room to add values later without re-numbering everything.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 12,
      "title": "Tabs 5-6: Validation Rules & Action Items",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "Validation & Business Rules Tab", "level": 0, "bold": true },
        { "text": "This tab documents data validation and business rules. However, Guidewire recommends placing underwriting rules and validation rules in a separate workbook or master list rather than in the story card.", "level": 0, "bold": false },
        { "text": "You will practice writing business rules in the Functional Requirements course. For now, document the key validation requirements from our scenario.", "level": 0, "bold": false },
        { "text": "Exercise 2.2.5 — Document validation rules for:", "level": 0, "bold": true },
        { "text": "1. Primary Named Insured for Personal Auto could be a company or a person", "level": 1, "bold": false },
        { "text": "2. System must require a person (not company) as Primary or Secondary Named for each submission/policy", "level": 1, "bold": false },
        { "text": "Action Items Tab", "level": 0, "bold": true },
        { "text": "Captures outstanding tasks related to the story's completion — open questions, pending decisions, or work items.", "level": 0, "bold": false },
        { "text": "Exercise 2.2.6 — Document these action items:", "level": 0, "bold": true },
        { "text": "1. Alice Applegate needs to identify all Salesforce.com integration fields — due in 2 business days", "level": 1, "bold": false },
        { "text": "2. Alice Applegate needs to confirm and document all Client Type field values — due tomorrow", "level": 1, "bold": false }
      ],
      "notes": "The Validation tab is intentionally lightweight in the story card. Comprehensive business rules documentation is done in a separate Underwriting Rules workbook during the Functional Requirements phase.",
      "narration": "The Validation and Business Rules tab and the Action Items tab are more straightforward. For validation rules, Guidewire actually recommends keeping the detailed rules in a separate document — the story card just captures the high-level requirements. The Action Items tab is your task list — it tracks who needs to do what and by when to move the story forward. Both of these exercises are quick but important for completeness.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 13,
      "title": "Tab 7: Acceptance Criteria",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "The Acceptance Criteria tab defines the conditions that must be met for the story to be considered complete and accepted by the Product Owner.", "level": 0, "bold": false },
        { "text": "Structure:", "level": 0, "bold": true },
        { "text": "Section 1 — Header (carried from Document Control)", "level": 1, "bold": false },
        { "text": "Section 2 — Product Owner sign-off that all criteria were accepted", "level": 1, "bold": false },
        { "text": "Section 3 — Individual acceptance criteria items", "level": 1, "bold": false },
        { "text": "A single criterion can apply to multiple requirements. Each criterion should be testable and specific.", "level": 0, "bold": false },
        { "text": "Exercise 2.2.7 — Document acceptance criteria for all 7 requirements:", "level": 0, "bold": true },
        { "text": "1. Named Insured can be company or person", "level": 1, "bold": false },
        { "text": "2. Person required as Primary or Secondary Named", "level": 1, "bold": false },
        { "text": "3. Date Quote Needed field removed/hidden", "level": 1, "bold": false },
        { "text": "4. New Client Type field with correct values", "level": 1, "bold": false },
        { "text": "5. Primary phone identification works correctly", "level": 1, "bold": false },
        { "text": "6. New Policy Type field with correct values", "level": 1, "bold": false },
        { "text": "7. Plan field appears only when Policy Type = Assigned Risk", "level": 1, "bold": false }
      ],
      "notes": "Acceptance criteria are the 'definition of done' for the story. Each criterion should be testable. QA teams use these directly to create test cases.",
      "narration": "Acceptance criteria are perhaps the most critical tab for quality. They define exactly what 'done' looks like. A Product Owner reviews these criteria to accept or reject the completed work. Write them so they're testable — a QA engineer should be able to read a criterion and immediately know how to verify it. Notice that one criterion might cover multiple requirements, and that's perfectly fine.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 14,
      "title": "UI Final Tab & Complete Flow Summary",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "The UI Final tab captures a screenshot of the completed, implemented screen.", "level": 0, "bold": false },
        { "text": "This tab is populated after development is complete — it serves as the final documentation of what was actually built, compared to the mockup of what was planned.", "level": 0, "bold": false },
        { "text": "We will not complete this tab in our exercises since no developer has built out the new screen yet.", "level": 0, "bold": false },
        { "text": "Summary — The Complete User Story Card Flow:", "level": 0, "bold": true },
        { "text": "1. Document Control — Identify the story and establish ownership", "level": 1, "bold": false },
        { "text": "2. UI Mockup — Visualize the target state", "level": 1, "bold": false },
        { "text": "3. UI Fields — Specify every field in detail", "level": 1, "bold": false },
        { "text": "4. Typelists — Define new/changed dropdown values", "level": 1, "bold": false },
        { "text": "5. Validation Rules — Capture business rules", "level": 1, "bold": false },
        { "text": "6. Action Items — Track outstanding tasks", "level": 1, "bold": false },
        { "text": "7. Acceptance Criteria — Define 'done'", "level": 1, "bold": false },
        { "text": "8. UI Final — Document what was actually built", "level": 1, "bold": false }
      ],
      "notes": "The UI Final tab closes the loop by documenting the actual implementation alongside the planned mockup. This is useful for future reference and for training new team members.",
      "narration": "The UI Final tab closes the loop. After the developer builds the feature, you capture a screenshot of the actual result. This creates a complete record: what was requested, what was designed, and what was built. Now let's zoom out and look at where User Story Cards fit in the bigger picture of a Guidewire project.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 15,
      "title": "User Story Cards in the Project Lifecycle",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "User Story Cards are used throughout the Guidewire project lifecycle, but they are most heavily created and refined during specific phases:", "level": 0, "bold": false },
        { "text": "Discovery & Elaboration Phase:", "level": 0, "bold": true },
        { "text": "Stories are identified from requirements workshops and elaboration sessions. Initial story cards are created with Document Control and high-level descriptions.", "level": 1, "bold": false },
        { "text": "Design & Specification Phase:", "level": 0, "bold": true },
        { "text": "Story cards are fully detailed — UI Mockups, UI Fields, Typelists, Validation Rules, and Acceptance Criteria are completed. This is the heaviest documentation phase.", "level": 1, "bold": false },
        { "text": "Build Phase:", "level": 0, "bold": true },
        { "text": "Developers use the story cards as their primary specification. Action Items are tracked and resolved. Story cards may be updated as questions arise.", "level": 1, "bold": false },
        { "text": "Test & Accept Phase:", "level": 0, "bold": true },
        { "text": "QA teams create test cases from Acceptance Criteria. The UI Final tab is completed after development. Product Owner reviews and signs off.", "level": 1, "bold": false }
      ],
      "notes": "There are no exercises for this section. It provides context for how story cards fit into the overall implementation methodology.",
      "narration": "User Story Cards aren't a one-time artifact. They evolve throughout the project lifecycle. They start as high-level descriptions during discovery, get fully detailed during design, serve as the developer's blueprint during build, and become the acceptance checklist during testing. Understanding this lifecycle helps you know what level of detail to include at each phase.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 16,
      "title": "Planning Delivery Sprints — Estimation",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "Now that you understand User Story Cards, let's discuss how stories are used to plan delivery sprints.", "level": 0, "bold": false },
        { "text": "The Estimation Challenge:", "level": 0, "bold": true },
        { "text": "Providing accurate estimates for user stories is difficult, especially when you're unfamiliar with the requirements or the work involved.", "level": 0, "bold": false },
        { "text": "Estimation Exercise (Animal Sorting):", "level": 0, "bold": true },
        { "text": "Think about this: How long would it take you to sort 15 animals by size (small to large)?", "level": 0, "bold": false },
        { "text": "1. Estimate how long it would take before starting", "level": 1, "bold": false },
        { "text": "2. Complete the task and record the actual time", "level": 1, "bold": false },
        { "text": "3. Compare your estimate to the actual time", "level": 1, "bold": false },
        { "text": "Most people can estimate this accurately because they're familiar with animals.", "level": 0, "bold": false },
        { "text": "Reflection — Now consider:", "level": 0, "bold": true },
        { "text": "What if you had to estimate the average weight of each animal? How accurate would you be? How much longer would it take? What assumptions did you make? The less familiar you are with the work, the less accurate your estimates will be.", "level": 0, "bold": false }
      ],
      "notes": "This exercise introduces the concept of relative estimation — comparing tasks to each other rather than absolute time estimates. The animal sorting analogy demonstrates that familiarity directly impacts estimation accuracy.",
      "narration": "Let's shift gears to estimation. How do you estimate something you've never done before? That's the challenge every Guidewire project faces. The animal sorting exercise makes a simple point: when you're familiar with something, your estimates are pretty good. But when you're estimating something unfamiliar, like the exact weight of each animal, your accuracy drops dramatically. This is why Guidewire uses relative sizing rather than absolute hour estimates.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 17,
      "title": "T-Shirt Sizing with Fibonacci Scale",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "Guidewire projects use T-shirt sizing mapped to the Fibonacci scale for story estimation:", "level": 0, "bold": false },
        { "text": "XS = 1 point (~8-12 hours of development)", "level": 1, "bold": true },
        { "text": "S = 2 points", "level": 1, "bold": true },
        { "text": "M = 3 points", "level": 1, "bold": true },
        { "text": "L = 5 points", "level": 1, "bold": true },
        { "text": "XL = 8 points", "level": 1, "bold": true },
        { "text": "XXL = 13 points", "level": 1, "bold": true },
        { "text": "Why Fibonacci? The gaps between numbers grow larger as complexity increases, reflecting the increasing uncertainty in larger estimates.", "level": 0, "bold": false },
        { "text": "Key Principle: A lower point value indicates less development time. One point equals approximately 8-12 hours of development effort.", "level": 0, "bold": true },
        { "text": "The Process:", "level": 0, "bold": true },
        { "text": "1. Compare stories relative to each other (not absolute estimates)", "level": 1, "bold": false },
        { "text": "2. Assign T-shirt sizes first, then map to Fibonacci points", "level": 1, "bold": false },
        { "text": "3. Break down each story into tasks and estimate hours per task", "level": 1, "bold": false },
        { "text": "4. Compare total hours to the T-shirt size for consistency", "level": 1, "bold": false }
      ],
      "notes": "The Fibonacci scale (1, 2, 3, 5, 8, 13) is widely used in agile estimation. The increasing gaps between numbers reflect that larger stories have more uncertainty and risk.",
      "narration": "T-shirt sizing is how Guidewire teams estimate work. You compare stories to each other — is this story bigger or smaller than that one? Then you assign a size from extra-small to double-extra-large, each mapped to a Fibonacci number. The beauty of the Fibonacci scale is that the gaps grow wider as you go up, which matches reality — the bigger a task is, the more uncertain your estimate becomes. A 13-point story isn't just 13 times an XS; it's a fundamentally more complex and uncertain piece of work.",
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": []
    },
    {
      "slideNumber": 18,
      "title": "Room Redo Exercise — Sprint Planning Practice",
      "slideType": "content",
      "bodyParagraphs": [
        { "text": "Exercise 2.4.2 — Room Redo Estimation Exercise", "level": 0, "bold": true },
        { "text": "Practice sizing and estimating with these 5 home improvement user stories:", "level": 0, "bold": false },
        { "text": "Story 1: Paint walls with 12-inch vertical stripes", "level": 1, "bold": true },
        { "text": "Story 2: Repair/repaint baseboards", "level": 1, "bold": true },
        { "text": "Story 3: Fix drywall", "level": 1, "bold": true },
        { "text": "Story 4: Install chair rail", "level": 1, "bold": true },
        { "text": "Story 5: Install new light fixture", "level": 1, "bold": true },
        { "text": "Steps:", "level": 0, "bold": true },
        { "text": "1. Assign a T-shirt size (XS through XXL) to each story", "level": 0, "bold": false },
        { "text": "2. Break each story into individual tasks", "level": 0, "bold": false },
        { "text": "3. Estimate hours for each task", "level": 0, "bold": false },
        { "text": "4. Total the hours and compare to your T-shirt sizing", "level": 0, "bold": false },
        { "text": "Reflection Questions:", "level": 0, "bold": true },
        { "text": "Were any assumptions made (e.g., tools already purchased)? Were there dependencies between stories? Was time estimated for physical activity only or wait time too? Could all the work be completed in one 3-day weekend?", "level": 0, "bold": false },
        { "text": "Guidewire Note: Lag time is not typically documented in tasks — teams just start another task while waiting.", "level": 0, "bold": true }
      ],
      "notes": "This is a team exercise (4-6 members) or can be done independently for self-study. Teams should spend 30 minutes breaking down and estimating, then present results.",
      "narration": "Let's put estimation into practice with something tangible — remodeling a room. Size each of these five stories, then break them into tasks and estimate hours. The reflection questions are key: they highlight common estimation pitfalls like forgetting dependencies, ignoring wait times, and making assumptions about resources. In Guidewire projects, we don't document lag time separately — when you're waiting for paint to dry, you start another task.",
      "hasTable": true,
      "hasChart": false,
      "hasImage": false,
      "tableData": [
        ["User Story", "Size", "Hours"],
        ["Paint walls with 12-inch vertical stripes", "", ""],
        ["Repair/repaint baseboards", "", ""],
        ["Fix drywall", "", ""],
        ["Install chair rail", "", ""],
        ["Install new light fixture", "", ""],
        ["TOTAL", "", ""]
      ],
      "mediaReferences": []
    }
  ],
  "videos": [],
  "hasNotes": true,
  "hasTables": true,
  "hasImages": false
}
