{
  "chapter": "ch08",
  "chapter_title": "PolicyCenter Product Model",
  "domain": "product configuration",
  "video_count": 27,
  "total_duration_seconds": 4464.44,
  "total_duration_formatted": "01:14:24.440",
  "total_words": 9920,
  "avg_confidence": 0.9151,
  "videos": [
    {
      "filename": "PP_02_01.mp4",
      "stem": "PP_02_01",
      "duration": "00:02:16.340",
      "words": 478,
      "confidence": 0.8965
    },
    {
      "filename": "PP_02_02.mp4",
      "stem": "PP_02_02",
      "duration": "00:01:30.960",
      "words": 147,
      "confidence": 0.8599
    },
    {
      "filename": "PP_03_01.mp4",
      "stem": "PP_03_01",
      "duration": "00:02:40.440",
      "words": 329,
      "confidence": 0.9117
    },
    {
      "filename": "PP_03_02.mp4",
      "stem": "PP_03_02",
      "duration": "00:02:21.640",
      "words": 334,
      "confidence": 0.916
    },
    {
      "filename": "PP_04_01.mp4",
      "stem": "PP_04_01",
      "duration": "00:03:36.760",
      "words": 531,
      "confidence": 0.9203
    },
    {
      "filename": "PP_04_02.mp4",
      "stem": "PP_04_02",
      "duration": "00:04:27.940",
      "words": 439,
      "confidence": 0.8978
    },
    {
      "filename": "PP_05_01.mp4",
      "stem": "PP_05_01",
      "duration": "00:03:19.140",
      "words": 542,
      "confidence": 0.9207
    },
    {
      "filename": "PP_06_01.mp4",
      "stem": "PP_06_01",
      "duration": "00:03:49.700",
      "words": 426,
      "confidence": 0.9437
    },
    {
      "filename": "PP_06_02.mp4",
      "stem": "PP_06_02",
      "duration": "00:03:57.320",
      "words": 652,
      "confidence": 0.8878
    },
    {
      "filename": "PP_06_03.mp4",
      "stem": "PP_06_03",
      "duration": "00:01:27.760",
      "words": 203,
      "confidence": 0.9044
    },
    {
      "filename": "PP_06_04.mp4",
      "stem": "PP_06_04",
      "duration": "00:04:52.680",
      "words": 708,
      "confidence": 0.8724
    },
    {
      "filename": "PP_07_01.mp4",
      "stem": "PP_07_01",
      "duration": "00:03:06.180",
      "words": 402,
      "confidence": 0.9377
    },
    {
      "filename": "PP_07_02.mp4",
      "stem": "PP_07_02",
      "duration": "00:02:27.860",
      "words": 254,
      "confidence": 0.8969
    },
    {
      "filename": "PP_08_01.mp4",
      "stem": "PP_08_01",
      "duration": "00:03:48.360",
      "words": 465,
      "confidence": 0.9398
    },
    {
      "filename": "PP_08_02.mp4",
      "stem": "PP_08_02",
      "duration": "00:01:41.000",
      "words": 188,
      "confidence": 0.9489
    },
    {
      "filename": "PP_08_03.mp4",
      "stem": "PP_08_03",
      "duration": "00:01:50.960",
      "words": 231,
      "confidence": 0.9489
    },
    {
      "filename": "PP_08_04.mp4",
      "stem": "PP_08_04",
      "duration": "00:01:40.040",
      "words": 376,
      "confidence": 0.8881
    },
    {
      "filename": "PP_09_01.mp4",
      "stem": "PP_09_01",
      "duration": "00:02:40.060",
      "words": 357,
      "confidence": 0.97
    },
    {
      "filename": "PP_09_02.mp4",
      "stem": "PP_09_02",
      "duration": "00:05:12.740",
      "words": 544,
      "confidence": 0.931
    },
    {
      "filename": "PP_10_01.mp4",
      "stem": "PP_10_01",
      "duration": "00:02:12.620",
      "words": 186,
      "confidence": 0.9258
    },
    {
      "filename": "PP_10_02.mp4",
      "stem": "PP_10_02",
      "duration": "00:01:52.280",
      "words": 264,
      "confidence": 0.895
    },
    {
      "filename": "PP_10_03.mp4",
      "stem": "PP_10_03",
      "duration": "00:02:00.120",
      "words": 269,
      "confidence": 0.9471
    },
    {
      "filename": "PP_11_01.mp4",
      "stem": "PP_11_01",
      "duration": "00:01:54.800",
      "words": 351,
      "confidence": 0.9361
    },
    {
      "filename": "PP_11_02.mp4",
      "stem": "PP_11_02",
      "duration": "00:02:43.280",
      "words": 376,
      "confidence": 0.9227
    },
    {
      "filename": "PP_12_01.mp4",
      "stem": "PP_12_01",
      "duration": "00:01:40.340",
      "words": 228,
      "confidence": 0.9097
    },
    {
      "filename": "PP_12_02.mp4",
      "stem": "PP_12_02",
      "duration": "00:01:56.820",
      "words": 223,
      "confidence": 0.9323
    },
    {
      "filename": "PP_13_01.mp4",
      "stem": "PP_13_01",
      "duration": "00:03:16.300",
      "words": 417,
      "confidence": 0.8948
    }
  ],
  "full_text": "--- PP_02_01 ---\nA location group is a collection of locations that link to different pages. AccountFile.PCF is a location group for the accounts. Some key properties include CanVisit, Menu Actions. The Info Bar and Tab Bar are also defined on the Properties tab. The Variables are on the Variables tab. The Entry Points tab displays entry points to the PCF file. Click on the Account File entry point to display its signature. Entry Points define the signature used by other widgets to navigate to the Location Group. The Location Group PCF file contains a list of location refs, which link to pages or child location groups. Let us select the Location Ref for Account File Summary. Control-click the Location link to navigate to the referenced PCF file. This opens the Account File Summary page PCF file. Open the Team Location Group. The CanVisit property of a Location Group controls whether the link to the Location Group is visible. The Team Location Group is a good example. The CanVisit field evaluates the View Team permission of a user. Log in as Alice Applegate. The Team tab is not visible because Alice does not have permission to view the team. Next, log in as Supervisor Steve Smith. The Team tab is now visible because the user does have permission to view the team. In Studio, open the tab bar.pcf file. The Search tab is a simple example to show how to navigate from a widget to a Location Group. The Action property of the Search tab is set to the entry point of the Search Location Group. Control-click the Action link Search to visit the PCF file. It opens the Location Group, Search.pcf. Go to the Entry Point properties of the Search Location Group. Click on the Entry Point to view its signature. Verify that the Entry Point signature matches that of the Action property on the Search tab. This ends the overview for Location Group's demonstration. Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of Filogy of the Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of \n\n--- PP_02_02 ---\nIn Studio, open the page account file summary PCF file. Note that the menu links and tab bars are visible, but they are not part of the physical PCF file. The following are items you can configure for a page. If CanEdit evaluates to true, the page has the edit slash update buttons. Otherwise it is read-only. If CanVisit evaluates to true, the link to the page is visible and clickable. The title is displayed. If CanEdit is true and Start in Edit Mode is false, the user must click the Edit button first to edit the page. Click the Entry Points tab. Click on the account file underscore summary entry point. The entry point with matching variables defined by the entry point with matching variables defined by the entry point. Open the signature of theountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountountount The corresponding page opens. This ends the overview for pages demonstration.\n\n--- PP_03_01 ---\nIn PolicyCenter Studio, open the Submission Wizard PCF file, which is associated with the submission job. The submission wizard has dependent steps in certain orders and independent steps. Each step points to a screen. If CanEdit evaluates to true, the submission job can be edited. If CanVisit evaluates to true, the job can be viewed. A bound submission is not editable but viewable. When CountIsWork is set to true, the edited wizard can be viewed. A bound submission is not editable but viewable. The wizard step is listed as unsaved work if navigating away without saving. The title for the group of independent steps is set at the wizard level. For example, Tools. There are also other key properties for the submission wizard, such as, Info Bar. Menu Actions. Tab Bar. The entry points and variables define the signature used by other widgets to navigate to the wizard. There could be multiple signatures for the entry points. Open Account File Underscore Summary.PCF. Double-click to go to the Open Policy Transactions section. Click the Transaction Number cell. The action is set to JobForward.Go. Control-click on JobForward. Select the line of code for submission. In the action field, Control-click on Go to Submission Wizard. In Job Helper, the GoSA function calls SubmissionWizard.Go to navigate to the Submission Wizard. Log into Policy Center as Alice Applegate. Open a Submission in Draft Mode. Note the different sections in the Submission Wizard. Navigate away from the wizard without saving after a change. Click the Unsaved Work icon at the top right. The wizard step is listed as Unsaved Work because the counts as Work is set to True in SubmissionWizard.PCF. Clicking on the link takes you to the step. Locate and enforce policy. Click on the Policy link. Go to the Independent Step, Policy Transactions. Find the bound submission. Click the Bound Submission. Click the Bound Submission. Click View Policy Transactions. The bound submission is not editable. This ends the overview for JobWizard demonstration.\n\n--- PP_03_02 ---\nIn Studio, open the SubmissionWizard.PCF file. It has a list of JobWizard steps, each of which is linked to a screen with the content. The JobWizard steps can be grouped together using WizardStepGroup. The PolicyContract is a group of steps and has a label. It contains a JobWizard step for policy info and a WizardStepSetRef pointing to a WizardStepSet. The WizardStepSet refuses modes to group different set of steps based on line of business. Selecting a different mode displays the WizardStepSet for that line of business. You can double-click to open it. The Dependent Steps are an ordered list of JobWizard steps, each of which maps to a single screen. Some steps may not be accessible until a given step is complete. The order effects where the Back and Next buttons navigate to. Each JobWizard step specifies the title of the screen. Control-click in the Screen property to visit the PCF file. The screen contains the Content, Wizard Buttons and Toolbars. The JobWizard toolbar contains Back and Next buttons to navigate through the JobWizard as well as other buttons relevant to the current step. Click the Mode for the WizardButtons. Select the appropriate JobType to display the WizardButtons for it. Go back to SubmissionWizard.PCF. The Tools section at the bottom contains the Independent Steps. Double-click to open the WizardStepSet for the Tools menu. They do not have a logical order and can be accessed at any time, regardless of what steps have been completed in the JobWizard. Click one of the steps. Each step has the Independent property set to True. The label and icon for the Independent Steps are set at the JobWizard level. Log into PolicyCenter as Alice Applegate. Open a Draft Submission. The Policy Contract is a JobWizard group and the Child Steps are indented. The Back and Next buttons navigate based on the order of Wizard Steps. Each step points to a different screen. This is the end of Overview for JobWizardState. This is the end of Overview for JobWizardState.\n\n--- PP_04_01 ---\nLog in as an underwriter Alice Applegate. Find an account, for example, Ray Newton. Click the Contacts link in the sidebar. It opens the Account File Contacts page. Selecting a contact from the list refreshes the details at the bottom. Separate tabs display the contact detail, roles, addresses, associated transactions and policies. Contacts are identified by the role they fill. There are predefined account contact roles and policy contact roles. One contact can fill multiple roles on the account or policy. The contact Ray Newton has three account contact roles, Account Holder, Driver, and Named Insured. A contact role may have additional fields as for Driver. A contact can be edited by clicking the Edit button on the right. We will just cancel the edit without saving. To add a new contact on the account, click Create New Contact at the top. Select the desired contact role, for example, Additional Insured, and select either Person or Company. Enter required fields on the Contact Detail tab. The role of Additional Insured is added by default. Save the new contact. The list of contacts can be filtered by role. Select the Driver role. There are five contacts with the Driver role on the account. Go back to the Account Summary page. Open an Inforce policy. Open an Inforce policy. The contacts on a policy are listed under Policy Tools, Contacts. Ray Newton has two policy contact roles, Primary named Insured and Driver. The contacts on the account can be reused on the policies. Open a draft submission for Personal, Auto, or Create a new submission. Go to the Driver's screen. Click Add. Select Existing Driver. It lists the five contacts with a driver role from the account. Select John Smith. It is added to the submission. To create a new contact on the policy, click Add again. Select New Person. Enter required fields. Save the new policy driver. Go to the Roles tab. Enter additional information for the driver role, such as Year First Licensed. After clicking Save Draft in the submission, the new policy contact Mike Smith is added at the policy level. Go back to the account. Go to the Account Contacts page. Verify that the new policy contact Mike Smith is added to the account automatically. This is the end of contacts overview. Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy                                                                          \n\n--- PP_04_02 ---\nWe will create a new contact role, the audit contact. First, create the entities that define the new subtypes for the audit contact role, which is applied at both the account and the policy level. In Studio, go to Configuration, Config, Extensions, Entity. Right-click Entity. Choose New, Entity. Enter the entity name. Click the entity type drop-down. Select subtype as the entity type. Enter description. Search for, or type in account contact role as the supertype. Create audit contact. Exit is a subtype of account contact role. Right-click Entity again. Click New, Entity. Create policy audit contact. Exit is a subtype of policy contact role. Next, update contact.org. Next, update ContactConfig plugin.gs to enable the new contact role. Press Ctrl plus N. Enter ContactConfig plugin. Open the GOSA file. In Default Config, add the new audit contact role for person type only. The first argument indicates whether the contact type is enabled. The second argument is a list of contact types. In this case, it is person only. The third argument is the account contact role type for the audit contact. The fourth argument is the policy audit contact role type. If there are additional policy contact roles that map to audit contact, add the roles to this argument. If you create a role that only exists at the account level, then omit the fourth argument. Next, create the entity name is the first argument. Next, create the entity name for the new entity. Go to ConfigurationConfig. Right-click Entity Names. Select New, Entity Name. Enter audit contact underscore ext in the Entity field. Select the entity. Click OK. Studio opens audit contact contact.ext.en for the default language. In the editor, enter the code in the Default tab. Hover over the display key in red and click Alt plus Enter. Select Create Display Key if it does not exist. Enter the value for the default language. Enter the value for the display key. Save the display key. Stop the server and restart the Policy Center server after any data model changes. Start the server in debug mode. Login to Policy Center as Alice Applegate. Go to an account. For example, Ray Newton. Go to the Contacts page. Click Create New Contact. The drop-down contains Audit Contact, with the option of New Person Only. Enter required fields and save the new audit contact. You can also edit an existing contact. Go to the Roles tab. Click Add Role. Audit Contact is displayed in the drop-down list. The Audit Contact Role is added to the existing contact. Save the changes. This is the end of demonstration for creating a new contact role.                                     \n\n--- PP_05_01 ---\nLog in as an underwriter Alice Applegate. Open a bound policy. The policy is effective from January 1 to July 1. A policy period is a version of the policy. Each policy job has a selected policy period associated with it. The F dated entities in the policy period keep their state over the effective time of a policy. Start a new policy change. The policy change is effective on March 1, which is after the policy term start date. Change some values on the policy. For example, go to Vehicles. Change the car's color from red to blue. Quote the policy. Issue policy. Click OK. Click OK. Go back to the policy. Click Actions. Start a second policy change. Set the effective date to be after the previous job, for example, May 1. Go to Vehicles. Change the same car's color to a different value. Filogy of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan of the plan specific date and effective time. When you request objects on the policy in slice mode, Policy Center automatically gets the correct version of each object as of the slice date. In the date field, select a date, February 1st, which is before the effective date of the first policy change. Go to Vehicles. The car's color is red on February 1st. Select a date, March 15th, which is after the first policy change and before the second policy change. A quick tip is to click somewhere outside of the date field to refresh the policy data. Go to Vehicles. The color is blue on March 15th. Select a date, May 30th, which is after the second policy change. Click somewhere outside of the date field to refresh the policy data. Go to Vehicles. The color is yellow on May 30th. The policy contract shows different data values on different date, because it retrieves the data in slice mode. This ends the slice mode demonstration. This ends the slice mode demonstration.   Filogy of the Filogy of the                                 \n\n--- PP_06_01 ---\nThe logged in user is a producer, Archie Armstrong. We will use a personal submission to give an overview of the underwriting issue process. One driver, John Newton, is 20 years old. Reckless Newton is an excluded driver as shown on the Rolls tab. The cost for the new vehicle is $200,000. Try to quote. The underwriting rule framework checks the policy data and raises underwriting issues that might block the transaction at certain points. In this example, the excluded driver underwriting issue blocks quote for the current user. Go to the risk analysis page to see more details. PolicyCenter displays underwriting issues on the UW issues tab. The Approve button is grayed out for the issue excluded driver. Agent must request approval if he does not have sufficient authority to approve the issues. A UW activity is created and assigned to the underwriter on the job by default. The agent enters details of the activity and submits the request. Note the assigned underwriter and the submission number. Log out. Log in as the underwriter. Go to the same submission. Type in the submission number. Click the search icon. Under UW Review appears on the info bar of the submission. Go to the risk analysis page. Approve the underwriting issue for excluded driver. On the risk approval details page, set allow edit to yes, which means the approval is effective even if the policy transaction is edited and the same issue will not be raised again. Click OK to confirm. The submission can now proceed beyond the previously blocked point. Edit policy transaction. Click OK. Go to vehicles. Go to vehicles. The underwriter found the cost new value was entered with an extra zero. Let's fix it. Quote again. Go to risk analysis. Underwriting issues are automatically removed when the condition goes away. In this example, the issue for high value vehicle that blocks bind was removed. Underwriting issues can be reopened after they are approved or rejected. You can also view the details of the issue. The risk approval details screen displays a history for each underwriting issue. Open the view issues block and drop down. Select view all. Auto-approvable issues provide automatic approval if the user has the appropriate authority. For example, state of garaging and total premium over authority are auto-approved for the underwriter. The underwriter must release the lock to let the agent proceed. A UW activity is created and assigned to the initial referrer who requested the approval. Click release. This is the end of the underwriting authority of view demonstration.\n\n--- PP_06_02 ---\nUnderwriting rules are managed in the user interface and contain fields related to define and approve the underwriting issues. Log in as SuperUser. Go to Administration. Select Business Settings, Business Rules, Underwriting Rules. Click Next to view the next page of Underwriting Rules. Clone, an existing underwriting rule to see the underwriting rules. See how the rule is defined. For example, PA, primary driver under 25. Click, Clone. On the Rule Details page, there are several fields that define the underwriting rule. Name identifies the underwriting rule in the user interface. Code must be unique and identifies the underwriting issue type. Select the Checking Set drop-down. Click the Checking Set drop-down. A Checking Set represents a point in a job at which conditions are checked to raise underwriting issues, such as pre-quote, bind or pre-issuance. Click the Blocking Point drop-down. A blocking point stops progress of the job until an issue is approved. In this example, the issue is raised at quote time but it blocks find. Default duration specifies the property on the new approval page and it indicates when an approval will expire. You can enter a description for the rule and a start and end date. In the applies to section, select which policy lines, jurisdictions, and policy transactions this rule applies to. The rule context provides policy data to be used by the rule. You can also create reusable variables. These are the list of predefined context for personal auto policies. This issue uses the context for each vehicle. In the rule conditions section, create the conditions for raising the underwriting issue. In this case, the primary driver's age on a vehicle is less than 25. You can add a new criteria. Click the expression field. The context objects based on the selected rule context can be used to create the left and right expressions. Click the arrow to select a mode for the expression. The list of modes contains formula, count, sum or lookup. There are also several options to choose for the operation. In the underwriting issue details section, the issue key can uniquely identify the underwriting issue once it is raised. The value is compared with authority grants to determine if the user can approve this issue. Short and long description are used to display the underwriting issues on the risk analysis page. Both are localized. Click cancel to go back to the underwriting rules page. The underwriting rule fields related to approval are covered in a separate demonstration. This is the end of demonstration for the underwriting rule fields related to define an issue. Filogy of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner of winner                                                                          \n\n--- PP_06_03 ---\nAs you already know, there are different rule contexts available based on the policy line selected in the underwriting rule. Click Left Expression. Once a context is selected, you can access the symbols in the context and the associated fields. For example, P, A, Driver. Open PolicyCenter Studio. The context definition classes are added in BizRules plugin. Control click to open one of them. In the context definition class, it defines a symbol to be used in the rule to reference the objects on the policy period. Here, the symbol P, A, Driver references all policy drivers on the personal auto line. The context definition is identified by the rule context definition key. The name of the rule context definition key is displayed in the context dropdown in the user interface. Open the parent class of the context definition. The method applies to policy lines determines which policy lines it applies to. The context definition keys must be added to the supported context in underwriter evaluator triggering point. Go back to the context definition class. Other context definitions are defined in the same package. This is the end of demonstration for rule context definition. The context definition is defined in the same package.\n\n--- PP_06_04 ---\nIn this demonstration, we create a new underwriting rule for buildings built before 1950, for a business owner's submission. It should be evaluated before quote time, and it blocks bind. First log in a super user. Go to Administration. Select Business Settings, Business Rules, Underwriting Rules. Click Add. Enter the required fields to define the rule on the Rule Details tab. You can configure the Advanced tab in the demonstration for approving underwriting issue later. Click the Code field. The code must be unique. Select Prequote as the checking set since it should be evaluated before quote time, and it will be a new underwriting. Select Blocked. Select Blocked. Select Blocked. Bind for Blocking Point. In the Applies to section, click Selected for Policy Lines. Two boxes and arrow buttons appear. Select Bob. Click the Right arrow to add it to the selected list on the right. Click the Context drop-down field. Select the Rule Details tab. Select the Rule Context business owner's policy for each building, which provides data and objects to the buildings on the policy. Click in the Expression field. The list of available objects are displayed for the selected Rule Context. Select the Object Bop Building. Type a dot to show the fields on the object. Select Building. Type a dot. Select Year Build. Select Year Build. Click the Operation drop-down field. In the Operation drop-down, select the Less Than sign. Click the Right Expression field. In the Right Expression field, type in the number 1950. Click anywhere outside to refresh the page. The error went away after the page is refreshed. Next, set Underwriting Issue Details. Use the syntax of $ and curly braces to wrap the policy objects. The fixed ID of an object is unique, so it can be used as the Issue Key to identify the Underwriter Issue once it is raised. The Value field is not visible, because Value Comparator on the Advanced tab is set as None. Enter the Short Description for the Underwriting Issue for all languages. Click the English Text field. Enter the Long Description for the Underwriting Issue for all languages. Enter the Long Description for the Underwriting Issue for all languages. Save the rule. Click the Gear icon. Log out. Log in as Producer Archie Armstrong. Create a Business Owner's Submission. Building 1 has the Year Built Set as 1940. Click on the row for Building 2. Building 2 has the Year Built Set as 1920. Click Quote. Go to Risk Analysis. The Underwriting Issue, Building Built before 1950 is created and it is blocking bind. The Year is not displayed with the issue, because we did not configure the Underwriting Rule to record the associated value. The Approve button is grayed out for the issue, because the agent does not have the authority. This is the end of the demonstration for creating a new Underwriting Rules with fields that define the issue. The winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner of the winner \n\n--- PP_07_01 ---\nLog in at SuperUser. Go to Underwriting Rules through Business Rules. Select the underwriting rule for BOP, Year Built. Modify the rule so that the user can only approve the issue with the year built no earlier than a limit. Let's review and configure the fields that are related to approving the underwriting issues. On the Rule Details tab, Default Duration specifies the property on the New Approval page, and it indicates when an approval will expire. Keep it as rescinded. Go to the Advanced tab. If Auto Approvable is set to Yes, the issue is automatically approved if the logged in user has the authority to approve it. Default Edit Before Bind corresponds to the property on the New Approval page. Yes indicates the issue will not be raised again if the policy transaction is edited after the issue has been approved. Default Approval Blocking Point. Default Approval Blocking Point specifies the default approval blocking point when an issue is opened for approval. Value Comparator defines how to compare the issue value to see if it is within the authority limit. Select At Least. Value Format Type defines which output format are to use. Keep it as unformatted. Default Value Assignment Type specifies how to compute a default approval value from the value of the issue. Policy Center uses this value if the comparator is set to At Least or At Most. Fixed. Fixed copies the issue value directly to the default approval value. Offset Amount or Offset Percentage adds to the issue value by an offset amount or percentage to produce the default approval value. Select Fixed. Go back to the Rule Details tab. In the Underwriting Issue Details section, the Value field is visible because Value Comparator is set as At Least. It is compared with Authority Grants to determine if the user can approve this issue. After entering the value, click outside of the box to refresh the page. Save the Rule. Click the Gear icon. Log Out. Log In as a Producer. Go back to the same submission that raised the issue for Building Built before 1950. Notice the year is not displayed. Edit Policy Transaction. Click OK to Warning. Click Quote. Go to Risk Analysis. The Year is displayed with the issue, because we configured the Underwriting Rule to record the value. This is the end of demonstration for the Underwriting Rule fields related to approval. \n\n--- PP_07_02 ---\nLog in as Superuser. Go to Administration. Select Users & Security, Authority Profiles. We will grant Agent 2 authority to approve issues for BOMPA building built before 1950 but at least 1930. Edit the profile. Add a new authority. Click the search icon. type in the name of the underwriting issue type. Click search. Select the desired underwriting issue type. Keep the comparator as at least. Enter a limit in the value field. We have granted the profile, Agent 2. to approve the issue for building built before 1950 but at least 1930. Click Update to save the changes. Ensure that the authority profile, Agent 2, is assigned to the user Archie Armstrong. Locate the user. Go to the UW Authority tab of the user. Verify that Agent 2 is listed on the page. Log in the UW Authority tab. Log out. Log in as Archie Armstrong. Find a business owner submission that raised the issue for building built before 1950 in the previous lesson. Go to Risk Analysis. The Approve button is now available for the issue raised for the building built in 1940 because we granted the authority to the issue. The Approval button is now available for the building built in 1920 because it is outside of the user's authority limit. On the Risk Approval Details page, the default value of the fields corresponds to those related to approvals defined in the underwriting rule. Click OK to approve the issue. This is the end of demonstration for approving the underwriting issue.\n\n--- PP_08_01 ---\nPolicyCenter uses validation classes to validate entities on the policy graph. Under configuration, GSRC, GW, Policy, there are the validation classes shared across all lines of business. For example, Policy Period Validation, Policy Line Validation, Policy Location Validation, etc. Line-specific validation classes are under configuration, GSRC, GW, etc. LOB, and in each line of business folder. For example, NBA for commercial auto. NPA for personal auto. So on and so forth. All validation classes implement the PC Validation interface or extend a base class that implements PC Validation. Entity validation classes extend PC Validation base, such as Business Vehicle Validation. The subclasses have a Validation method. Personal Vehicle Validation class is another example. Policy Line-specific validation classes extend Policy Line Validation, such as PA Line Validation or BOP Line Validation classes. The subclasses have a Do Validate method, which calls other validation methods. Control-click to open Vehicle Validation. Control-click to open Vehicle Validator.DoValidate method. The Validator class contains methods that test for a single issue, for example at least one vehicle method. Policy Center uses validation levels to verify entities at certain levels before continuing. In at least one vehicle method, it first checks if the PA Line has no vehicles in it, and the current level is default or higher, it creates an appropriate message. Then another check is done to see if the current level is at least quotable, it adds an error message, otherwise it adds a warning message. The result variable is an object of PC Validation results. Vehicles-Wizard-step is a static final variable defined with value Personal Vehicles, which is the ID of the Vehicles step in the Personal Auto Submission wizard. When the wizard step ID is supplied, it creates a link to that wizard step, when the validation is executed but the user is on another step. Log into Policy Center as Alice Applegate. Create a Personal Auto Submission that does not have a vehicle. On the Vehicles page, try to navigate away by clicking the Next button. A warning message is displayed, because the validation is performed at a level that is lower than quotable. Click the Quote button. An error message is displayed, because the validation is performed at the quotable level. There is no link on the message, since you are on the Vehicles page. Click Clear to get rid of the frame. Go to the policy review page. The warning is displayed again. It does not block navigation. Click policy review again. Click quote on the policy review page. An error is displayed with a link to the vehicle's step where the error occurred. Users can click on that link. It takes the users to the vehicle's page where they can fix the error. This is the end of demonstration for validation class space.\n\n--- PP_08_02 ---\nValidation chaining is the process of one validation class calling methods in another validation class to perform additional checks. Let's examine validation chaining in policy period validation.validateMV. Example 1, the policy contact role validation class gets called within a block to validate each contact role in the policy period. It is chaining to policy contact role validation.validateMV. Example 2, policy contact role for same contact validation performs validation on all policy contact roles that share the same contact. This also loops through all the shared contacts. It is chaining to policy contact role for same contact validation.validateMV. Example 3, Policy Location Validation gets called to validate each location. It also validates all territory codes on each policy location. In the Policy Location Validation's Validate Imple method, it calls Check Answers. Control-click to go to that method. In Check Answers method, it calls the answer validation to validate the location answers. Therefore it is another level of validation chaining. Control-click on Answer Validation. It is chaining to answer validation.validateimple. Use validation chaining to validate policy entities to meet the business requirement. This is the end of Validation Chaining Overview.\n\n--- PP_08_03 ---\nThe class-based validation can be invoked in many places. For example, in Submission Process, the bind method invokes JobProcessValidator, which checks data in the policy period. It eventually calls PolicyPeriodValidation.ValidatePeriod method. The class-based validation can also be invoked in a particular point in the user interface. One example is in the BeforeSave attribute of a JobWizardStep. In LineWizardStepSet.PersonalAuto, the JobWizardStepPersonalVehicles, the BeforeSave attribute invokes PAWizardStepHelper.OnVehiclesStepExit method. Control-click to open the function. It calls PA LineStep's validators validate all vehicles garaged in same state and validate vehicles step methods. In ValidateVehiclesStep method, it starts validation chaining with class-based validation, such as PA LineVehiclesValidator, AssignmentValidator, etc. In PolicyCenter, Add New Vehicle and Click Next. The logic in the BeforeSave attribute of the Vehicles step is executed to validate the vehicles. A warning message is displayed indicating there are no assigned drivers for vehicles. Another example is in the BeforeCommit attribute of a pop-up. In BOPBuildingPopUp, the BeforeCommit attribute invokes BOPBuildingValidation.ValidateBuilding method. Control-click to open the method. It calls class-based validation to perform many checks on the building, such as at least one base coverage. In PolicyCenter, add a new building in a business owner's submission without any base coverage. Click Update Building. The logic in the BeforeCommit attribute of the building pop-up is executed and it displays an error in the validation results. This is the end of demonstration for invoking class-based validation.\n\n--- PP_08_04 ---\nAdd a validation check to display a warning message that red cars result in higher premiums, when a red car is added. First, add a new or edit the appropriate validation class. In this example, the object whose color is to be checked is a personal vehicle, so this would be added to the personal vehicle validation class. The method Check Vehicle Color is added to check whether the color of the vehicle is red. If it is red, a warning is added at the default validation level. the vehicle, with the display key, with the vehicle's wizard step, where the problem occurs. The validate-ample method of any validation class calls all the methods in a logical sequence. Add Check Vehicle Color method to validate-ample. Save the changes. Normally, the next step is to invoke the class-based validation. For this example, we do not need to add extra code to the BeforeSave attribute of the vehicle wizard step, since OnVehicle step The exit method calls validate-ample. The exit method calls validate-vehicles step method, which starts validation chaining and eventually validates each vehicle in the Personal Vehicle Validation class. Reload changed classes or restart the server. Select Reload changed classes. Log into Policy Center as Alice Applegate. Add a vehicle with color red on the vehicle's step of a personal auto submission. Click Next. Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of the Filogy of Filogy of the Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy of Filogy \n\n--- PP_09_01 ---\nLet's look at the behaviors of contact data synchronization from the account to the policy. Amy Taylor called to get a personal auto policy for her car. Create a new person account for Amy with a home phone number. Create a new submission for personal auto. Go to the policy info page. Click the primary named insured link. Amy Taylor's information is the same as the account because new submission always copies the contact data from the account. Complete other steps like driver and vehicles. Quote and issue the policy. After two months, Amy called to inform that she had gotten married and would like to change her last name to King. Go to the account. Go to the account contacts page. Edit the contact. Change the contact's last name. She also has a new phone number. Save the changes. Open the previous policy. Go to the policy contacts page. The contact name is a revision field. So it is not synchronized from the account to the policy because it has been bound. The phone number on the policy, however, shows the same value as account since it is a shared field. The reason the name is revisioned and the phone number is not is because the name is part of the policy contract data, whereas the phone number is not, and they are configured accordingly. After three months, Amy called to renew the policy for six months. In the policy, click actions. Select renew policy. Go to the policy. Go to the policy info page. The name on the renewal job is the same as the account. To summarize, the shared data of a contact is always the same on both the account and the policy. If a revision contact field is changed on the account, it will not be synchronized to the bound policies. So that each policy can keep the history of contact data. New policy jobs copy the current contact data from the account, with the exception of a backdated policy change job, which keeps the original policy data. This is the end of demonstration for contact data synchronization from account to policy.\n\n--- PP_09_02 ---\nObserve how the contact information is updated for a future dated change on the policy. First, create a new person account for Jane Smith. Go to the Contacts page. Edit the contact. Update the contact to reflect that she is single and born on April 1, 1987. Create a new personal auto submission. Go to the Contacts page. Go to Drivers. Add Jane as the only driver. Enter Required fields. Go to Vehicles. Add a Vehicle. Quote the submission. Issue Policy. Go to the Policy File.  After a while, Jane calls to inform that she is getting married in a week and would like to add her husband John Doe as a driver on her policy. Start a Policy Change Transaction. Enter an effective date as two months after the policy's start date.  Enter a description. Enter a description. Click Next. Go to Drivers. Add a new driver for John Doe. Fill in the details as required and save the new driver. Click the row for Jane Smith. Jane would also like to change her last name to John Doe. Change her status to Married. Quote the Policy Change. Issue Policy. Go to the Account. On the Account, what is the last name of Jane? Why? The last name of Jane is Smith. Future dated contact data changes at the policy level do not flow back up to the account, because the contact at the account level is considered the current data and cannot be future dated. Press Alt plus Shift plus T. Navigate to Internal Tools. Select Testing System Clock. Set the clock to the effective date of the policy change job. Click Change Date. Go to Server Tools. Select Batch Process Info. Run the Batch Process Supply Pending Account Data Updates. In the top right corner of the window, click the Options menu. Click Return to Policy Center. Go to Jane's account. After advancing the system clock to the policy changes effective date and running the batch process, what is the last name of Jane on the account? Why? The last name of Jane is Doe. Because the batch process supply pending account data updates automatically updates the account contact data from the policy changes on the job effective date. Go to the Policy File. Now let's look at a backdated change of the contact information on the policy. After three months, Jane calls to inform that the birth year on her policy is wrong and needs to be corrected to 1985. Start a new policy change. This change should take effect from the beginning of the policy. It is a backdated change so you will get a warning about an out-of-sequence transaction. Click OK to continue. Go to Drivers. Change Jane's birth year to 1985. Click Quote. Issue Policy. Go to the Account. Go to Contacts. The backdated changes do not flow back up to the account. The contact birthdate is not updated in the account file. Activities are created on the account. The activities inform the user about the contact changes that may need to be updated on the account. Go to the Notes page. Notes are created for the contact changes as well. This is the end of the demonstration for future dated and backdated policy changes. The !\n\n--- PP_10_01 ---\nWe are adding a new permission to restrict users from editing the affinity group on the PolicyInfo page. In Studio, double-click the Shift key. Find and open the TypeListExtensionFileSystemPermissionType.ttx. Add a new type code. Enter a unique code. Enter the name and description. Save the file. Users must regenerate dictionaries to see new permissions listed within Security Dictionary. In Windows Explorer, pressing Shift and then right-click the PolicyCenter folder. Open a command window. Type GWB GEN DATA Dictionary. It also helps to validate the type list changes. Navigate to Build, Dictionary, Security. Open the index.html for the Security Dictionary. Go to the System Permissions page. The new permission is listed under System Permissions in the Security Dictionary. You must restart the server in Studio for the application to pick up the data model changes. In PolicyCenter, login as SuperUser. We will add the new permission to the Underwriter role. Go to Administration, Users, and Security, Roles. Select the Underwriter role. Edit the role. Click Add. Select the permission Added Affinity Group. Save the changes. This is the end of demonstration for creating a new system permission.                                    \n\n--- PP_10_02 ---\nWe will show you how to check the permissions using Gosu. On the Team Forward page, the CanVisit attribute checks if the user has the system permission, ViewDim to view the Team tab. If the expression evaluates to True, the Team tab is visible. Perm is a Gosu namespace used to create expressions that evaluate if current user has a given permission. In PolicyCenter, login is Alice Applegate. The Team tab is not available to Alice Applegate. because she does not have the ViewDim permissions. Log in a Supervisor Steve Smith. The Team tab is available to Steve Smith because he has the Underwriter Supervisor role and it has the ViewDim permission. In Studio, we will update the editability of the Affinity Group field with the new permission we created earlier. Open the PolicyInfo Input Set PCF file. Select the Affinity Group Input field. Select the Address. In the Editable property, type in the expression perm.system.editAffinityGroup underscore ext, which tests if the user has the new EditAffinityGroup permission. Save the file. Select the Address. Save the file. In PolicyCenter, press Alt plus Shift plus L to reload the PCF changes. Log in as an Underwriter Alice Applegate. Open a Policy Transaction in Draft Mode and go to the Policy Info page. User Alice Applegate has the Underwriter role and can edit the Affinity Group field. Log in as Dennis Wright. User Dennis Wright has the Underwriter Assistant role, which does not have the new permission, so he cannot edit the Affinity Group field. This is the end of demonstration for checking permissions using Gosu. \n\n--- PP_10_03 ---\nStatic-based permissions do not require an object as an argument, while object-based permissions always do. From tab bar.pcf, open the admin.pcf for the administration tab. System permissions are static, using the syntax perm.system.permission, with no arguments, where permission is the type code of the permission defined in the system permission type type list. The ConVisit property in admin.pcf has many static system permissions. Static permissions on the admin.pcf. entities can be defined as application permission keys using the static handlers in securityconfig.xml. An application permission key is a set of one or more system permissions defined in securityconfig.xml. For example, the static handler defines the perm key create on the account entity and maps it to the account create system permission. In tab bar.pcf, click the account dropdown. Select new account. The available property has the expression perm.account.create. The syntax for static permissions on entities is perm.entity.permission, where permission is the application permission key. Object-based permissions are application permission keys defined using custom handlers in securityconfig.xml. For example, the perm key edit is defined using the account producer code handler and checks the system permission added account summary in the producer code status. In account file.pcf, the can edit property is set of perm.account.edit.account. The syntax for object-based permission is perm.entity.permission object, where permission is the application permission key and object is the real object in memory. Here is another example. In submission wizard.pcf, can visit is set to perm.submission.view.submission. The perm key view submission is defined in securityconfig.xml, as well as many other object-based permissions for submission. This is the end of demonstration for static and object-based permission.\n\n--- PP_11_01 ---\nAn activity represents a task that someone must attend to or an issue that someone should be aware of. Log in as any user, for example, Alice Applegate. The activities assigned to a user are displayed on the user's desktop page and they can be filtered. Clicking on an activity opens the activity worksheet and it automatically opens the entity it is related to. In this case, the Premium Report. The user can take actions on the activity, such as Complete, Reassign, and Add a Note, etc. Click OK or Cancel to click on the activity. Close the worksheet if you do not want to complete it yet. The activities related to a job are all displayed on the work plan page in the Tools section. The user can create a new activity on the job by clicking Actions, New Activity. There are sets of predefined categories of activity patterns to use. For example, an auditor can create an activity for the underwriter to review the Premium Report. Click OK to create the activity. Go to the policy. Go to the policy. Go to the policy file. The activities related to a policy are all displayed on the policy summary page and include those from the associated policy transactions. The user can create a new activity on the policy by clicking Actions, New Activity. This time, create an activity to meet with the insured on the policy. An activity bubbles up from policy job to policy and to account. The activity bubbles up from policy job to policy and to account. The activity is related to an account. The activities related to an account are all displayed on the account summary page and include those from the associated policies and policy transactions. Similarly, the user can create a new activity on the account by clicking Actions, New Activity. Create an activity to get inspection for loss control and assign it to inspector. An activity bubbles up from policy job to policy and to account. It is always related to an account by default. This is the end of demonstration of activity-based. \n\n--- PP_11_02 ---\nActivity patterns are templates that standardize how activities are generated. They are typically managed by administrators. Log in as Super User. Go to the Administration tab. Select Business Settings, Activity Patterns. To view an existing activity pattern, click the name of the activity pattern in the list. For example, Get Credit Reports. Click Edit. Let's look at the fields on the Activity Pattern page. Short Subject is a brief description of the activity. Automated only indicates whether this pattern is not available for manually created activities and used only by rules and Gosu. Description specifies what is expected in the completion of this activity. Escalation days and hours specify how many days and hours before an activity will be escalated if not complete. Mandatory indicates whether you can skip this activity. The code field is a unique internal name for the pattern and is used to reference an activity pattern in Gosu. Recurring indicates whether the activity recurs on a regular schedule. Subject is the title of the activity pattern. Priority indicates the urgency of the activity. Type, Select General or Assignment Review. General activities are closed by being completed or skipped. Assignment Review Activity. The activities are added to a supervisor's pending assignment queue. Pattern Level indicates the levels at which the activity can be attached . Target Days and Hours are the target number of days and hours to complete this activity. Category. Category classifies patterns into related groups in the new activity screen action menu. Activity Class. Select Task or Event. A task can have a due date, but an event cannot. It is not. Escalation Start Point. Select when to begin calculating the escalation date or time. Target Start Point. Select when to begin calculating the target date. Escalation and target include days. Indicate whether to include business days or calendar days. Cancel the edit. Go back to the Activity Patterns page. To create a new activity pattern, click the New Activity Pattern button. It will be updated.  It will be updated. It will be updated. It will be updated. It will be updated.  It will be updated. It will be updated.    It will be updated. It will be updated.     It will be updated.    It will be updated.  It will be updated. \n\n--- PP_12_01 ---\nIn PolicyCenter, an activity is assigned in assignment rules, assignment classes or combination of both. In Studio, go to Configuration, Config, Rule Sets, Assignment. There are two activity assignment rules in the default configuration. Global Group Activity assignment rules is triggered when activity.au to assign is called. Expand the rule set. Let's look at the Underwriter activities rule as an example. If the activities pattern is one of these patterns, it assigns the activity to the Underwriter by calling the Assign by Job role or Assign by Container role method. Default Group Activity assignment rules is invoked when auto assign group, null, without a user ID is called, which is the case when an activity is assigned to a group in the application. In this rule, the activity is assigned to a user within the group using round robin. The activity assignment methods can also be called directly in the assignment classes. Go to Configuration, GSRC, GW, Assignment. Open Job Assignment Enhancement. The function Create role activity creates a job activity based on the activity pattern, and calls activity.assign, group, user. Control click on the Assign method. It opens the activity Java implementation class. There are many assignment methods with documentations in the activity class. You can select the right method that meets your requirement. This is the end of demonstration for activity assignment based on the activity. \n\n--- PP_12_02 ---\nLet's create a new activity to get credit reports and assign it to the producer, when a new submission is created for a business owner's line. In Studio, go to Configuration, GSRC, right-click and create a new package. Enter the package name. Click OK. Right-click the new package. Create a new Gosu enhancement. The name is Job Enhancement. It is an enhancement on the job entity. Search for it. Double-click to select it. Add a new function to create the activity to get credit reports and assign it to the producer. Press Alt plus Enter to create a display key for the description. This is the final code. Find the activity pattern by code credit underscore reports. Call Create Role Activity, which is defined in Job Assignment Enhancement. It creates and assigns the activity. Open submission process and invoke the new function at the end of the start method. Restart the server. Login to Policy Center as Alice Applegate. Open Account Ray Newton. Create a new submission. Select Business Owners. Go to Tools, Work Plan. The activity Get Credit Reports is created and assigned to the producer of the submission, Archie Armstrong. To check the producer on the job, go to Tools, Participants. The producer is Archie Armstrong. This is the end of demonstration for assigning activities. Filogy of the Filogy of the  \n\n--- PP_13_01 ---\nIn this demo, we will walk through the job lifecycle and show you some of the special job components in Studio. Jobs can be started by users, through the Actions menu. For example, start a new submission from the account. The job entity and its subtypes are instantiated by the screen that calls the job wizard. For example, selecting a product on the new submission screen. It forwards to the submission wizard. Open Studio. In newSubmission.PCF, double-click to open. The select button's action property calls newSubmissionUtil.Create1Submission. In the function, it creates the submission object and forwards to the submission wizard. In a policy file's Actions menu. Different actions are available depending on the state of the policy. For example, change policy. On the Start Policy Change screen, it initializes the policy change object. Click the Next button. It forwards to the button. It forwards to the policy change wizard. In Studio, open Start Policy Change.PCF. Go to the Variables tab. The new policy change object is created here. Let's examine the Next button element. It forwards to the Policy Change wizard. The job wizard.PCF. Go to the Job Wizard.PCF. Go to the Variables tab. The Job Wizard Helper class provides functionality for the job wizards. Its Gozu enhancement can be configured to add more functionality. In the Job Wizard, select any job step. Open the PCF file for the screen. Open the PCF file for the screen. In each job wizard, there is a set of relevant buttons. Select a mode. Let's open the button set for Policy Change. The button's visibility is based on the CAN methods in Job Process classes. For example, the Edit Policy Transaction button. The CAN methods return a Job Conditions object, which checks for error conditions. The buttons call business logic such as Edit Policy Transaction, Request Quote on object in the context. The job process and its subclasses, Submission Process, Policy Change Process, Renew Process, etc. contain methods for processing the job. Open Cancellation Process. The job process methods can call Workflows. In Finish Send Notices, it starts the workflow complete cancellations. Go to Config Workflows. Open the workflow. It waits to issue the cancellation on the cancellation date or ends the process if the cancellation is rescinded. Workflows can also call Job Process methods. In the bound step of the workflow, it calls Cancellation Process.issue cancellation from workflow. Job ends when the branch is bound, issued, withdrawn, or discarded. This is the end of demonstration for Job Life Cycle. ",
  "generated_at": "2026-02-13T12:31:05.161985"
}