{
  "lessonId": "ch11-l09",
  "chapterId": 11,
  "chapterSlug": "ch11",
  "lessonNumber": 9,
  "title": "SOAP Web Services",
  "subtitle": "Learn to integrate Guidewire applications with external systems using SOAP web services.",
  "synthesizedAt": "2026-02-16T18:56:11.605655+00:00",
  "estimatedMinutes": 100,
  "blocks": [
    {
      "type": "hook",
      "id": "hook-1",
      "scenario": "Imagine your Guidewire application needs to fetch real-time stock quotes from a financial service or send payment instructions to an external banking system. How do these disparate applications, potentially built with different technologies, communicate reliably and securely over a network?",
      "question": "What standardized mechanisms exist to enable seamless, structured data exchange between enterprise applications?"
    },
    {
      "type": "objectives",
      "id": "obj-1",
      "objectives": [
        "Define SOAP web services and their core components (SOAP, WSDL).",
        "Explain the role of WSDL binding styles, particularly Document/Literal.",
        "Describe how Guidewire applications can consume external SOAP web services.",
        "Outline the steps to configure and call an external SOAP web service from Gosu.",
        "Describe how Guidewire applications can publish internal SOAP web services.",
        "Outline the steps to create and expose a custom SOAP web service in Gosu.",
        "Explain how to test Guidewire-published SOAP web services locally and with external tools."
      ],
      "estimatedMinutes": 3
    },
    {
      "type": "activate",
      "id": "act-1",
      "priorKnowledge": "You've likely encountered APIs (Application Programming Interfaces) in various contexts, where one software component interacts with another. Many modern applications rely on exchanging data in structured formats like XML or JSON. This lesson builds on that understanding by focusing on a specific, widely-used protocol for web-based application integration.",
      "warmupQuestion": "Think about a time you've seen two different software systems communicate. What challenges might arise in ensuring they 'speak the same language' and understand each other's requests and responses?",
      "hint": "Consider data format, communication rules, and how each system knows what the other can do."
    },
    {
      "type": "concept",
      "id": "concept-1",
      "heading": "Understanding SOAP Web Services and WSDL",
      "narrative": "A **SOAP web service** acts as an interface, allowing one application to communicate with another, typically in a synchronous manner. While asynchronous options exist, synchronous communication is the convention for web services, and all web services hosted by Guidewire are synchronous. Web service names often end in 'API' (Application Programming Interface). For successful communication, consumers must understand the specific communication protocol, including command usage, error codes, and headers.\n\nThe web service protocol stack involves several layers:\n*   **Service Transport**: Responsible for moving messages between applications, often using protocols like HTTP.\n*   **XML Messaging**: Encodes messages in a common XML format for mutual understanding, with **SOAP (Simple Object Access Protocol)** being a prime example.\n*   **Service Description**: Defines the public interface of a web service, typically using **WSDL (Web Services Description Language)**.\n*   **Service Discovery**: Centralizes services into a registry for easy publishing and finding, such as UDDI.\n\n**SOAP** itself is an open-standard, XML-based protocol for exchanging information. It's designed for internet communication, extending HTTP for XML messaging, and provides data transport for web services. SOAP supports remote APIs that are both platform-neutral and language-neutral, allowing applications written in different languages (like Java or Gosu) to interact seamlessly. Guidewire supports both SOAP 1.1 and 1.2, with 1.2 being the recommended protocol. When a web service is imported into Guidewire, the Gosu language automatically handles object serialization, deserialization, basic authentication, and SOAP fault handling.\n\nA **WSDL** is an XML-based protocol that precisely defines the operations available for a web service, including the required input and output values. It's generated by the service 'publisher' and used by the 'consumer' to construct requests. A complete WSDL definition contains all the necessary information to invoke a web service, describing how messages are grouped into operations, operations into interfaces, and how bindings and endpoint addresses are defined. Key elements within a WSDL document include `Definition`, `Data types`, `Message`, `Operation`, `Port type`, `Binding`, `Port`, and `Service`.\n\nWSDL bindings describe how a SOAP web service is bound to a messaging protocol. There are two communication style models: **Document** and **Remote Procedure Call (RPC)**, and two encoding use models: **literal** and **encoded**. This results in four possible style/use combinations. Guidewire primarily supports the **Document/literal** (WS-I) binding style, which allows for flexible SOAP body structures validated by an XML schema (XSD). While Guidewire has deprecated support for RPC-encoded web services, external systems may still consume Guidewire services using RPC-E. For consuming external services, Gosu automatically converts RPC literal WSDLs to document literal mode for WS-I compliance.\n\nIn a typical integration scenario, Guidewire can act as both a consumer and a publisher. For instance, Guidewire might consume an external `CurrencyAPI` to get exchange rates, using a `CurrencyWSC` (Web Service Collection). Conversely, Guidewire could publish a `FinancialsAPI` web service that an external financial system consumes to make payments.",
      "keyPoints": [
        "SOAP web services enable application-to-application communication, typically synchronously.",
        "The web service protocol stack includes transport (HTTP), messaging (SOAP), description (WSDL), and discovery (UDDI).",
        "SOAP is an XML-based, platform- and language-neutral protocol for data exchange.",
        "WSDL is an XML document that describes a web service's operations, inputs, and outputs.",
        "Guidewire primarily supports the Document/literal (WS-I) WSDL binding style.",
        "Guidewire can both consume external SOAP web services and publish its own."
      ],
      "figures": [
        {
          "slideNumber": 3,
          "caption": "An overview of a SOAP web service, showing its role in application communication."
        },
        {
          "slideNumber": 4,
          "caption": "Detailed explanation of what a SOAP web service is and its underlying protocol stack."
        },
        {
          "slideNumber": 5,
          "caption": "Visual representation and definition of the Simple Object Access Protocol (SOAP)."
        },
        {
          "slideNumber": 6,
          "caption": "An example of a WSDL describing a CurrencyAPI service, with its methods and parameters."
        },
        {
          "slideNumber": 7,
          "caption": "Explanation of WSDL binding styles and Guidewire's support for Document/literal (WS-I)."
        },
        {
          "slideNumber": 8,
          "caption": "Illustrates Guidewire's dual role as both a consumer and publisher of SOAP web services for integration."
        }
      ],
      "callouts": [
        {
          "type": "best_practice",
          "title": "Naming Convention",
          "content": "By convention, web service names typically end in 'API' (Application Programming Interface)."
        },
        {
          "type": "warning",
          "title": "Asynchronous Calls",
          "content": "For asynchronous calls into Guidewire, consider using startable plugins instead of web services."
        },
        {
          "type": "best_practice",
          "title": "SOAP Protocol Version",
          "content": "Guidewire recommends using the SOAP 1.2 protocol as the preferred protocol."
        },
        {
          "type": "warning",
          "title": "Deprecated RPC-encoded",
          "content": "Guidewire has deprecated support for RPC-encoded web services and encourages upgrading to document literal encoding."
        }
      ]
    },
    {
      "type": "concept",
      "id": "concept-2",
      "heading": "Consuming External SOAP Web Services in Guidewire",
      "narrative": "To consume an external WS-I web service, Guidewire uses a **web service collection (WSC)**. A WSC is essentially a collection of references to an external web service, comprising one or more resources like primary WSDLs and XSDs, along with any other WSDLs and XSDs referenced by these primary files. Importantly, a WSC contains only one copy of each file, even if multiple files reference it.\n\nWhen Guidewire calls an external web service, it handles the complex processes of **serialization** and **deserialization**. This means converting local Gosu objects into the flattened, text-based format required by the SOAP protocol for sending, and then converting the text-based response back into local Gosu objects for your code to use. This abstraction simplifies integration development significantly.\n\nLet's walk through a common use case: consuming an external stock quote service. The steps involve:\n1.  **Create a package for the web service collection**: Following Guidewire's naming conventions, this typically looks like `gsrc.<company>.<app_code>.webservice.<functional_area>`, for example, `trn.ta.webservice.stocks`. You create this by right-clicking on the parent package in Studio and selecting 'New > Package'.\n2.  **Create a new web service collection**: Within your newly created package, right-click and select 'New > Web Service Collection'. It's best practice to use all lowercase for the WSC name and append `wsc` to it (e.g., `stockquotewsc`), as the name is case-sensitive when referenced in Gosu.\n3.  **Fetch the external resource**: In the WSC editor, click 'Add New Resource', specify the external web service's WSDL URL (e.g., `http://localhost:8890/ab/ws/externalapp/webservice/StockAPI?WSDL`), and click 'Fetch'. The external system must be running for this to succeed. After fetching, you must regenerate XML classes from the Codegen menu to ensure Gosu can properly work with the fetched XML schemas.\n4.  **Reference the web service collection in Gosu**: Once the WSC is set up, you can create an instance of the API in your Gosu code. The syntax is `new <package_path>.wscname.wsdlname.ServiceName()`. You'll typically need to configure properties like basic authentication (username, password) and `CallTimeout` to prevent indefinite waiting for a server response. The `Config` namespace on the API object allows you to set these properties, as well as options for encryption, digital signatures, and more. Gosu supports standard synchronous calls, one-way methods (synchronous request without response), and asynchronous round-trip methods.\n5.  **Deploy code changes**: Any new or modified web service collections or Gosu code require a server restart to deploy the changes. This can be done from Studio by stopping and then starting the server in Run or Debug mode.",
      "keyPoints": [
        "Web service collections (WSC) are used in Guidewire to consume external WS-I web services.",
        "Guidewire handles serialization and deserialization of Gosu objects to/from SOAP XML.",
        "Steps to consume: create package, create WSC, fetch WSDL, regenerate XML classes, reference in Gosu, deploy.",
        "API configuration (authentication, timeouts) is done via the `Config` namespace on the API instance.",
        "Server restart is required to deploy WSC changes."
      ],
      "figures": [
        {
          "slideNumber": 9,
          "caption": "An illustration of the process for consuming an external web service."
        },
        {
          "slideNumber": 10,
          "caption": "Explanation of web service collections and the serialization/deserialization process."
        },
        {
          "slideNumber": 11,
          "caption": "A use case diagram outlining the steps to consume an external stock quote web service."
        },
        {
          "slideNumber": 12,
          "caption": "Instructions for creating a package for a web service collection in Studio."
        },
        {
          "slideNumber": 13,
          "caption": "Instructions for creating a new web service collection in Studio."
        },
        {
          "slideNumber": 14,
          "caption": "Steps to fetch the external WSDL resource into the web service collection."
        },
        {
          "slideNumber": 15,
          "caption": "Gosu code example demonstrating how to reference and call a consumed web service."
        },
        {
          "slideNumber": 16,
          "caption": "Screenshot showing how to restart the server in Studio to deploy code changes."
        }
      ],
      "callouts": [
        {
          "type": "best_practice",
          "title": "Package Naming",
          "content": "Use lowercase for the package path. Avoid `com.guidewire` and `gw` root packages as they are reserved."
        },
        {
          "type": "best_practice",
          "title": "WSC Naming",
          "content": "Use lowercase for the web service collection name and append `wsc` (e.g., `stockquotewsc`) to avoid case-sensitivity issues in Gosu."
        },
        {
          "type": "definition",
          "title": "CallTimeout",
          "content": "The `CallTimeout` property prevents a device from endlessly waiting for a server response, marking the task as incomplete or failed if the timeout occurs."
        },
        {
          "type": "tip",
          "title": "Authentication and Encryption",
          "content": "For encryption, authentication, or digital signatures, modify options on the API object's `Config` namespace. Refer to the Integration Guide for details."
        }
      ],
      "codeExamples": [
        {
          "language": "gosu",
          "title": "Referencing and Calling a Consumed Web Service",
          "code": "uses trn.ta.webservice.stocks.stockquotewsc.stockapi.StockAPI\n\nvar api = new StockAPI()\n\napi.Config.Http.Authentication.Basic.Username = \"externalappuser\"\napi.Config.Http.Authentication.Basic.Password = \"gw\"\napi.Config.CallTimeout = 30000\n\nvar stockQuote = api.getQuote(\"GWRE\")\nprint (stockQuote)",
          "explanation": "This Gosu code demonstrates how to instantiate an external `StockAPI` web service, configure basic authentication and a call timeout, and then invoke the `getQuote` method with a stock symbol, printing the XML response."
        }
      ]
    },
    {
      "type": "demo",
      "id": "demo-1",
      "videoIndex": 0,
      "context": "This demonstration will walk you through the practical steps of consuming an external SOAP web service within a Guidewire application. Pay close attention to how the web service collection is created, the WSDL is fetched, and the Gosu code is written to interact with the external service.",
      "transcriptSummary": "The demo illustrates creating a Gosu package, defining a new web service collection, fetching an external WSDL, regenerating XML classes, and finally writing Gosu code to call the external service, including setting authentication and timeout properties. It concludes with deploying the changes and observing the output."
    },
    {
      "type": "concept",
      "id": "concept-3",
      "heading": "Publishing Guidewire SOAP Web Services",
      "narrative": "Guidewire applications can also publish their own SOAP web services, allowing external systems to interact with them. These services are ideal for integration points where external requests are synchronous and use the SOAP protocol. While Guidewire provides a set of base application SOAP web services (e.g., `MaintenanceToolsAPI`), it's often a **best practice** to create custom SOAP web services for manipulating business data. Custom services allow precise control over the data exchanged, leading to significant performance improvements by transferring only necessary data.\n\nConsider a use case where you need to publish a SOAP web service exposing contact information to an external resource. The process involves:\n1.  **Create a package for the web service API**: Similar to consuming, follow Guidewire naming conventions, e.g., `trainingapp.webservice.contact`.\n2.  **Create a new API Gosu class**: This class will implement your web service. It **must** include the `@WsiWebService` annotation to declare it as a SOAP web service. Optional annotations include `@WsiPermissions` to specify required user permissions (defaulting to `soapadmin` if omitted) and `@WsiAvailability` to define the minimum system run level for the service (defaulting to `MAINTENANCE`). Method-level annotations override class-level ones.\n3.  **Define SOAP web service methods**: Methods can accept and/or return simple values (booleans, numbers, strings, lists, arrays) or custom Gosu objects. A crucial point is that a WS-I SOAP web service **cannot return an instance of a Guidewire data model entity** directly. For methods that check for existence (e.g., `doesContactExist`), it's recommended to use a Gosu query and check the `Empty` property of the result, which is the most resource-efficient approach.\n4.  **Create a Gosu class for return types (if necessary)**: If your web service methods return custom objects, these Gosu classes must be marked with the `@WsiExportable` annotation (to ensure XML serialization) and the `final` keyword (to prevent subtyping, which can introduce complexity).\n5.  **Using bundles for data modification**: If your SOAP web service methods need to commit data to the database, you must create a new bundle using `gw.transaction.Transaction.runWithNewBundle()`. This method takes a block argument, and at its closure, the application executes an implicit commit using the username provided by the SOAP web service call for authentication. **Do not explicitly commit a bundle** within a `runWithNewBundle` block.\n6.  **Restart server to deploy changes**: As with consuming services, any new or modified API classes require a server restart.",
      "keyPoints": [
        "Guidewire can publish SOAP web services for external systems, suitable for synchronous SOAP requests.",
        "Custom SOAP web services are recommended for business data manipulation to control data exchange and improve performance.",
        "A Gosu class becomes a SOAP web service with the `@WsiWebService` annotation.",
        "Optional annotations like `@WsiPermissions` and `@WsiAvailability` control access and availability.",
        "SOAP web service methods can return simple values or custom `@WsiExportable final` Gosu classes, but not Guidewire data model entities.",
        "Database modifications in web services require using `gw.transaction.Transaction.runWithNewBundle()` for bundle management.",
        "Server restart is necessary to deploy new or modified API classes."
      ],
      "figures": [
        {
          "slideNumber": 20,
          "caption": "Diagram illustrating an InsuranceSuite SOAP web service interacting with an external system."
        },
        {
          "slideNumber": 21,
          "caption": "A use case diagram outlining the steps to publish a SOAP web service exposing contact information."
        },
        {
          "slideNumber": 22,
          "caption": "Gosu code snippet showing required and optional annotations for a SOAP web service class."
        },
        {
          "slideNumber": 23,
          "caption": "Examples of SOAP web service methods, including one returning a boolean and one returning a custom object."
        },
        {
          "slideNumber": 24,
          "caption": "Gosu class definition for a SOAP web service return type, showing `@WsiExportable` and `final`."
        },
        {
          "slideNumber": 25,
          "caption": "Gosu code demonstrating the use of `runWithNewBundle` for committing data in a SOAP web service method."
        }
      ],
      "callouts": [
        {
          "type": "best_practice",
          "title": "API Naming",
          "content": "SOAP web services should have names that end in `API` (e.g., `ContactAPI`)."
        },
        {
          "type": "best_practice",
          "title": "Custom vs. Base Services",
          "content": "For business data, create custom SOAP web services to ensure correct data exchange and performance. For system data, use base application services like `MaintenanceToolsAPI`."
        },
        {
          "type": "definition",
          "title": "@WsiPermissions",
          "content": "Specifies the permissions a user needs to invoke a web service. Defaults to `soapadmin`. Can be an empty array if no permission is required."
        },
        {
          "type": "definition",
          "title": "@WsiAvailability",
          "content": "Specifies the minimum system run level (e.g., `MULTIUSER`, `DAEMONS`, `MAINTENANCE`) when a web service becomes available. Defaults to `MAINTENANCE`."
        },
        {
          "type": "warning",
          "title": "Data Model Entities as Return Types",
          "content": "A WS-I SOAP web service cannot return an instance of a Guidewire data model entity directly. Use custom Gosu classes instead."
        },
        {
          "type": "best_practice",
          "title": "Existence Checks",
          "content": "When writing 'does...Exist()' methods, query for the object using a unique identifier and check the `Empty` property of the result for efficiency."
        },
        {
          "type": "warning",
          "title": "Explicit Bundle Commit",
          "content": "Do not explicitly commit a bundle (e.g., `bundle.commit()`) within a `runWithNewBundle` block, as an implicit commit occurs at the block's closure."
        }
      ],
      "codeExamples": [
        {
          "language": "gosu",
          "title": "Gosu Class for SOAP Web Service",
          "code": "package acme.ta.webservice.contact\n\nuses gw.xml.ws.annotation.WsiWebService\nuses gw.xml.ws.annotation.WsiPermissions\nuses gw.xml.ws.annotation.WsiAvailability\n\n@WsiWebService\n@WsiPermissions({\"soapadmin\"})\n@WsiAvailability(MAINTENANCE)\nclass ContactAPI {\n    function doesContactExist(publicId : String) : boolean {\n        var queryObj = gw.api.database.Query.make(ABContact)\n        queryObj.compare(\"PublicID\", Equals, publicId)\n        return not queryObj.select().Empty\n    }\n\n    function getContactInfo(publicId : String) : ContactInfo {\n        // ... implementation to retrieve contact and map to ContactInfo ...\n        return new ContactInfo()\n    }\n\n    function setContactEmail(publicId : String, email : String) : void {\n        gw.transaction.Transaction.runWithNewBundle(\\ newBundle -> {\n            var queryObj = gw.api.database.Query.make(ABContact)\n            queryObj.compare(\"PublicID\", Equals, publicId)\n            var targetContact = queryObj.select().AtMostOneRow\n            if (targetContact != null) {\n                newBundle.add(targetContact)\n                targetContact.EmailAddress1 = email\n            }\n        })\n    }\n}",
          "explanation": "This example shows a `ContactAPI` Gosu class declared as a SOAP web service with annotations for web service declaration, permissions, and availability. It includes methods for checking contact existence, retrieving contact information (returning a custom `ContactInfo` object), and setting a contact's email using a bundle for database modification."
        },
        {
          "language": "gosu",
          "title": "Gosu Class for SOAP Web Service Return Type",
          "code": "package acme.ta.webservice.contact\n\nuses gw.xml.ws.annotation.WsiExportable\n\n@WsiExportable\nfinal class ContactInfo {\n    var _contactName : String as ContactName\n    var _contactType : String as ContactType\n    var _primaryPhone : String as PrimaryPhone\n    var _email : String as Email\n}",
          "explanation": "This `ContactInfo` Gosu class is designed as a return type for a SOAP web service. The `@WsiExportable` annotation ensures it can be serialized to XML, and the `final` keyword prevents it from being subtyped, maintaining architectural stability."
        }
      ]
    },
    {
      "type": "demo",
      "id": "demo-2",
      "videoIndex": 1,
      "context": "This demonstration will guide you through the process of publishing a custom SOAP web service from Guidewire. Pay attention to the annotations used on the Gosu class, how methods are defined, and how data modification is handled using bundles.",
      "transcriptSummary": "The demo covers creating a Gosu package, defining a new API Gosu class with `@WsiWebService` and other annotations, implementing methods that return simple types and custom objects, creating a custom return type class with `@WsiExportable` and `final`, and demonstrating data modification using `runWithNewBundle`. It concludes with restarting the server and preparing for testing."
    },
    {
      "type": "concept",
      "id": "concept-4",
      "heading": "Testing Guidewire SOAP Web Services",
      "narrative": "After publishing a Guidewire SOAP web service, thorough testing is essential. You can test these services in two primary ways: locally within a single Guidewire instance or using an external system.\n\n**Local Testing**: For local testing, your Guidewire instance acts as both the publisher and the consumer. The key additional step is to generate a local WSDL that your Gosu test code can use. This is done by running the command `gwb genWsiLocal` from the command line. This command generates local WSDLs for all web services under `gsrc.wsi.local...`. After generation, you must restart the Guidewire application. In your Gosu test code, you can then create an API instance using the syntax `new wsi.local.<package_path>.class.Service()`. You'll still configure authentication (e.g., `su`/`gw`) and other API properties as needed. This approach is efficient for unit testing and initial validation without needing a separate external system.\n\n**External System Testing**: For more comprehensive testing, especially in a production-like environment, you'll use an external system (like SoapUI) to consume your Guidewire-published web service. First, the integration developer working with the external system needs to access the WSDL for your Guidewire SOAP web service. You can find the URL for any Guidewire-published WSDL by navigating to `http://<machine>:<port>/<appcode>/ws` while the application server is running. Expand the 'Document/Literal Web Services' node, locate your web service, click its name to load the XSD, and then copy the URL. Tools like SoapUI (`www.soapui.org`) are highly recommended for external testing, as they allow you to easily construct and send SOAP requests and inspect responses.\n\nWhether testing locally or externally, remember that any changes to your API classes require a server restart to be deployed. This ensures that the latest version of your web service is available for testing.",
      "keyPoints": [
        "Guidewire SOAP web services can be tested locally or using an external system.",
        "Local testing involves generating a local WSDL using `gwb genWsiLocal` and referencing it in Gosu test code.",
        "External testing requires accessing the Guidewire-published WSDL URL (found at `http://<machine>:<port>/<appcode>/ws`) and using tools like SoapUI.",
        "A server restart is always required to deploy new or modified API classes for testing."
      ],
      "figures": [
        {
          "slideNumber": 26,
          "caption": "Diagram illustrating the concept of testing a SOAP web service by playing both publisher and consumer roles."
        },
        {
          "slideNumber": 27,
          "caption": "Screenshot showing the `gwb genWsiLocal` command and the directory structure for generated local WSDLs."
        },
        {
          "slideNumber": 28,
          "caption": "Gosu code example for testing a Guidewire-published SOAP web service locally using the generated WSDL."
        },
        {
          "slideNumber": 29,
          "caption": "Screenshot of the Guidewire web services page, showing how to locate and copy a WSDL URL for external testing."
        },
        {
          "slideNumber": 30,
          "caption": "Screenshot showing how to restart the server in Studio to deploy code changes for testing."
        }
      ],
      "callouts": [
        {
          "type": "tip",
          "title": "Code Completion for Local Tests",
          "content": "When testing a Guidewire web service locally, use code completion to easily determine the class and service names. It's not necessary to create a web service collection for local tests."
        },
        {
          "type": "best_practice",
          "title": "External Testing Tool",
          "content": "SoapUI is highly recommended for external testing of SOAP web services due to its robust features for constructing and analyzing SOAP messages."
        }
      ],
      "codeExamples": [
        {
          "language": "gosu",
          "title": "Local Test Example for Published Web Service",
          "code": "uses wsi.local.trainingapp.webservice.contact.contactapi.ContactAPI\n\nvar localAPI = new ContactAPI()\nlocalAPI.Config.Http.Authentication.Basic.Username = \"su\"\nlocalAPI.Config.Http.Authentication.Basic.Password = \"gw\"\n\nlocalAPI.setContactEmail(\"ab:5\", \"test@guidewire.com\")\nvar contactExist = localAPI.doesContactExist (\"ab:5\")\nvar contactInfo = localAPI.getContactInfo(\"ab:5\")",
          "explanation": "This Gosu code demonstrates how to test a locally published `ContactAPI` web service. It instantiates the local API, sets authentication, and then calls methods to set an email, check for contact existence, and retrieve contact information."
        }
      ]
    },
    {
      "type": "knowledge_check",
      "id": "kc-1",
      "question": "What is a WSDL? What does it describe?",
      "referenceAnswer": "AWSDL is an XML document that describes how an external system can interact with\na web service.",
      "questionKey": "slide-33"
    },
    {
      "type": "knowledge_check",
      "id": "kc-2",
      "question": "What type of files can be included as resources in a SOAP web service\nPa collection?",
      "referenceAnswer": "collection?\nWSDLs and XSDs",
      "questionKey": "slide-35"
    },
    {
      "type": "knowledge_check",
      "id": "kc-3",
      "question": "You have an API instance named “conversionAPI\". Under what\nPa circumstances would you set properties on conversionAPI .Config?",
      "referenceAnswer": "timeouts, or custom SOAP headers.",
      "questionKey": "slide-37"
    },
    {
      "type": "knowledge_check",
      "id": "kc-4",
      "question": "What must be added to a Gosu class in order to make it:\n\no A) AGuidewire SOAP web service?\n\nB) Avalid return type for Guidewire SOAP web service methods?",
      "referenceAnswer": "B) The @WsiExportable annotation and the keyword \"final\".",
      "questionKey": "slide-39"
    },
    {
      "type": "knowledge_check",
      "id": "kc-5",
      "question": "___ Identify if the following are true or false about a Guidewire WS web\n7’ service API:\n, A) Itcan return a simple value, such as a boolean or string.\nB) Itcan return an instance of any Guidewire data model entity.\nC) The WSDL gets generated when you save the class.\nD) Itcan list a set of permissions required to use the API.\n\nE) Itcan modify Guidewire data.",
      "referenceAnswer": "fa\n\nIdentify if the following are true or false about a Guidewire WS-I web\n~ service API:\n\nA) It can return a simple value, such as a boolean or string. True\n\nB) It can return an instance of any Guidewire data model entity. False — Instances\nof Guidewire data model entities cannot be returned from WS-I web service\nmethods\n\nC) The WSDL gets generated when you save the class. False - The WSDL is\ngenerated when an external system requests it.\n\nD) It can list a set of permissions required to use the API. True\nE) It can modify Guidewire data model. False",
      "questionKey": "slide-41"
    },
    {
      "type": "summary",
      "id": "summary-1",
      "keyTakeaways": [
        "SOAP web services provide a standardized, XML-based mechanism for application-to-application communication.",
        "WSDL defines the interface of a web service, outlining its operations, inputs, and outputs.",
        "Guidewire can consume external SOAP web services using Web Service Collections (WSCs), handling serialization and deserialization automatically.",
        "To consume, create a package, WSC, fetch the WSDL, regenerate XML classes, and reference the API in Gosu, configuring authentication and timeouts.",
        "Guidewire can publish its own SOAP web services by creating Gosu classes with `@WsiWebService` and other annotations.",
        "Published web service methods can return simple types or custom `@WsiExportable final` Gosu classes, but not Guidewire data model entities.",
        "Database modifications in published services require `gw.transaction.Transaction.runWithNewBundle()` for proper transaction management.",
        "Both consumed and published web services require a server restart to deploy changes.",
        "Testing can be done locally using `gwb genWsiLocal` or externally with tools like SoapUI by accessing the published WSDL URL."
      ],
      "realWorldConnection": "SOAP web services are fundamental to integrating Guidewire applications with the broader enterprise ecosystem. Whether it's connecting to policy administration systems, claims management platforms, financial systems, or third-party data providers, SOAP provides a robust and reliable framework for structured data exchange. Mastering these concepts is crucial for building scalable and maintainable integrations in real Guidewire projects.",
      "nextLessonPreview": "In the next lesson, we will explore RESTful web services, a more lightweight and flexible alternative to SOAP, and how Guidewire interacts with them."
    },
    {
      "type": "assignment",
      "id": "assign-1",
      "description": "In this hands-on exercise, you will apply the concepts learned in this lesson to both consume an external SOAP web service and publish a Guidewire SOAP web service. You will configure a web service collection to fetch data from a simulated external service and then create a custom Guidewire API to expose specific contact information, testing both integrations.",
      "objectives": [
        "Create a Gosu package and a Web Service Collection (WSC).",
        "Fetch an external WSDL and regenerate XML classes.",
        "Write Gosu code to consume and call an external SOAP web service.",
        "Create a custom Guidewire SOAP web service class with appropriate annotations.",
        "Define methods for the custom web service, including a custom return type.",
        "Implement data modification using `runWithNewBundle` within a web service method.",
        "Test the Guidewire-published web service locally."
      ]
    }
  ],
  "videos": [
    {
      "index": 1,
      "filename": "In_09_01.mp4",
      "path": "/academy/guidewire/videos/ch11/In_09_01.mp4"
    },
    {
      "index": 2,
      "filename": "In_09_02.mp4",
      "path": "/academy/guidewire/videos/ch11/In_09_02.mp4"
    }
  ]
}