{
  "lessonId": "ch04-l05",
  "chapterId": 4,
  "chapterSlug": "ch04",
  "lessonNumber": 5,
  "title": "Full Application Submission",
  "sourceFile": "In_policy_06_ Full Application Submission.pptx",
  "sourceFolder": "In_policy_05",
  "totalSlides": 35,
  "estimatedMinutes": 105,
  "slides": [
    {
      "slideNumber": 1,
      "title": "Introduction to Full Application Submission",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Welcome to the lesson on Full Application Submission in Guidewire PolicyCenter. This session will guide you through the process of creating a comprehensive submission, from account setup to policy issuance.",
      "narration": "Welcome to our exploration of the Full Application Submission process in Guidewire PolicyCenter. As developers, understanding how to navigate the submission workflow is crucial for creating efficient insurance solutions. Today, we’ll delve into the intricacies of building a robust policy from the ground up, setting the stage for a seamless policy lifecycle.",
      "ocrText": "Full Application Submission",
      "ocrWordCount": 3,
      "ocrConfidence": 95.6,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "title"
    },
    {
      "slideNumber": 2,
      "title": "Full Application Submission Overview",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Dive into the key steps involved in a full application submission. We will break down the workflow into manageable segments, ensuring you understand each phase from account creation to policy issuance.",
      "narration": "Now, let's lay the groundwork by examining the full application submission process. This approach involves several critical steps, such as selecting a product, entering detailed policy information, and navigating through underwriting. It's these steps that transform basic inputs into a binding insurance contract. Our journey will cover each phase, ensuring you grasp the complete picture.",
      "ocrText": "Lesson\nobjectives\n\n• Explain how the submission process works\n\nDescribe how submissions vary across lines\nof business\n\nCreate full application submissions\n\nBind and issue a policy\n\nDescribe asynchronous quoting and two-step\nquoting",
      "ocrWordCount": 32,
      "ocrConfidence": 95.81,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "objectives"
    },
    {
      "slideNumber": 3,
      "title": "Understanding the Learner Story",
      "bodyParagraphs": [],
      "originalNotes": "Learner story\nIn a project, the user story for a typical submission is: EAs a PolicyCenter user with the role of Agent, Customer Service Representative ( CSR), Underwriter, or Manager, I want to be able to create a new submission or quote from an account in PolicyCenter-\"",
      "notes": "Learner story\nIn a project, the user story for a typical submission is: EAs a PolicyCenter user with the role of Agent, Customer Service Representative ( CSR), Underwriter, or Manager, I want to be able to create a new submission or quote from an account in PolicyCenter-\"",
      "narration": "Imagine you’re an agent or a CSR in PolicyCenter, aiming to create a new submission or quote. This learner story is pivotal as it encapsulates the user journey, emphasizing the roles involved in initiating a policy. This perspective helps us align the development with real-world usage, ensuring the application meets user expectations.",
      "ocrText": "i =\nConfiguration y\n\nDeveloper\n\n| want to see how the submission process\nworks so that | can determine my\norganization’s best approach to configuration\n\nMarcus\nBusiness\nAnalyst\n\n| would like to see this as\nwell. As a Business Analyst,\nthis is important to my job\nrole.",
      "ocrWordCount": 47,
      "ocrConfidence": 91.71,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 4,
      "title": "Kickstarting a New Submission",
      "bodyParagraphs": [],
      "originalNotes": "Submissions\nIn order to create a new submission, you need an account. If you are not sure how to get an account , refer to the Accounts lesson.\n\nAfter you create an account and start the new submission process, relevant information can be entered via the submission wizard to present a policyholderwith a quote. You can then move forward from a quote to the binding and issuing of a policy. In this lesson, you will learn how each step looks in PolicyCenter, and what details are required to get a quote or fully bound policy.\n\nWhen creating a new submission, you have the option of either creating a quick quote or a full application submission.\n\n• Quick Quote gathers the minimal information needed to generate a quote.\n• Full Application gathers a complete set of information needed to apply for a bindable quote.\n\nWe will focus on the Full Application submission in this lesson. For information about the Quick Quote submission, refer to PolicyCenter documentation",
      "notes": "Submissions\nIn order to create a new submission, you need an account. If you are not sure how to get an account , refer to the Accounts lesson.\n\nAfter you create an account and start the new submission process, relevant information can be entered via the submission wizard to present a policyholderwith a quote. You can then move forward from a quote to the binding and issuing of a policy. In this lesson, you will learn how each step looks in PolicyCenter, and what details are required to get a quote or fully bound policy.\n\nWhen creating a new submission, you have the option of either creating a quick quote or a full application submission.\n\n• Quick Quote gathers the minimal information needed to generate a quote.\n• Full Application gathers a complete set of information needed to apply for a bindable quote.\n\nWe will focus on the Full Application submission in this lesson. For information about the Quick Quote submission, refer to PolicyCenter documentation",
      "narration": "To kickstart a submission, you first need an account. Once that's set, the submission wizard takes you through entering essential details to offer quotes and ultimately issue policies. We'll focus on the Full Application, which requires comprehensive data entry, as opposed to a Quick Quote. Understanding these distinctions is key to tailoring solutions for diverse client needs.",
      "ocrText": "| Submissions Gi\n\nthe policy holder.\n\n| —— The goal of the submission process is for the producer\n| or insurer to create a policy and get acceptance from\n\nSubmission Wizard",
      "ocrWordCount": 31,
      "ocrConfidence": 89.94,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 5,
      "title": "Exploring the Submission Workflow",
      "bodyParagraphs": [],
      "originalNotes": "Policy submission: full application\nBefore examining the details of each step, let's take a look at the submission workflow process.\n\nA full application is a complete set of information needed to issue a policy. The •completen set includes the product selection, the specific offering, basic policy information, coverables, coverages and modifiers for the specific line of business (LOB), and underwriting details related to risk analysis. After the user enters the full information, they can generate a quote for the policyholder. Ifthe quote is acceptable, the policy can be issued and bound, becoming a legal contract. To reach the Bind and Issue step in this diagram, first the quote must exist. Each of these steps will be covered in the demo. You can edit and change details about the policy (\"Modify quote\" bracket) any time before the Quote is created.\n\nMultiple submissions are permitted. In the default application, no more than five submissions can be made per LOB. For example, an insuredowns several homes and wants to have a home owner's policy for each home.",
      "notes": "Policy submission: full application\nBefore examining the details of each step, let's take a look at the submission workflow process.\n\nA full application is a complete set of information needed to issue a policy. The •completen set includes the product selection, the specific offering, basic policy information, coverables, coverages and modifiers for the specific line of business (LOB), and underwriting details related to risk analysis. After the user enters the full information, they can generate a quote for the policyholder. Ifthe quote is acceptable, the policy can be issued and bound, becoming a legal contract. To reach the Bind and Issue step in this diagram, first the quote must exist. Each of these steps will be covered in the demo. You can edit and change details about the policy (\"Modify quote\" bracket) any time before the Quote is created.\n\nMultiple submissions are permitted. In the default application, no more than five submissions can be made per LOB. For example, an insuredowns several homes and wants to have a home owner's policy for each home.",
      "narration": "Here's where it gets interesting—analyzing the submission workflow. In a full application, each step from product selection to policy issuance is crucial. Before generating a quote, modifications can be made, offering flexibility. PolicyCenter allows multiple submissions per line of business, accommodating scenarios like insuring multiple properties. This flexibility is embedded in the data model and workflow orchestration.",
      "ocrText": "| Policy submission: full application Gi\n\n—\n| Risk Analysis | | Risk Analysis |\nPolicy Review\nFull ae\nae\n\naS Policy Contract\n\nLOB Specific steps\n\nModify quote",
      "ocrWordCount": 28,
      "ocrConfidence": 78.0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 6,
      "title": "Full Application Demonstration",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Prepare to view a demonstration of the submission process using Ray Newton's account in the Personal Auto line of business.",
      "narration": "Get ready for a demonstration of the submission process using Ray Newton’s account. This practical example will showcase how to complete a full application, including adding drivers and vehicles. Pay attention to the data inputs and how they flow through the system, highlighting key elements like offerings and underwriting.",
      "ocrText": "In the next a few slides, select the\n-----45 demonstration for the line of business that\nrelates to your work",
      "ocrWordCount": 20,
      "ocrConfidence": 95.89,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 7,
      "title": "Personal Auto Submission Demo",
      "bodyParagraphs": [],
      "originalNotes": "Demonstration\nRun through the Personal Auto demo (refer to Instructor Guide). Use Ray Newton’s account and show the students how to complete a full application and submit significant pieces of required information. Show students how to add new drivers and vehicles, and point out the requirements for the number of accidents- The following information applies to each policy demo, regardless of LOB.\n\nOfferings: An offering allows insurers to define different product types based on existing base product definitions. Offerings can also be used for marketing\nprograms, which are which are targeted versions of an insurance policy intended for a specific market segment. A marketing program is intended for a particular type of business, producer or region.\n\nPre-Qualification: The next step in the submission process is to answer a series of pre-qualification questions. These questions are used as an early indicator to reveal if an applicant qualifies for the type of insurance being sought. Filtered questions are tied to a specific answer. During Qualification, underwriting issues may arise based on the applicant’s responses. These issues will appear in the Risk Analysis review.\n\nPolicy Info: Captures basic information about the primary named insured, the producer, policy details, and theselected underwriting company.\n\nUnderwriting: Large insurers license subsidiaries to underwrite policies on their behalf to accommodate state regulatory requirements. Many states do not allow insurers to have more than one set of rates per underwriting company. If insurers want to offer multiple sets of rates in that state, they must file each set under a separate underwriting company for that state. Underwriters may profile an account to determine its market segment to determine which underwriting company can underwrite the policy. The rates are determined for the account through this profiling method. In the example, there are three possible segments: low, medium and high- This selection influences the rating of the policy and the policy's cost More details about underwriting are available in other training lessons as well as PolicyCenter documentation.\n\nCoverages: Coverage patterns were first mentioned with respect to the Product Model- Examples of Personal Auto ( PA) coverage include collision or liability coverages.\n\nModifiers: Decreases or increases premiums based on specific factors. More details on modifiers are available in the Product DesJgner discussiom Risk Analysis: This section is where any underwriting concerns appear during the submission process. Underwriters have the option to remove or maintain any issues that are blocking the issuance of a policy- Underwriting issues may appear in Risk Analysis based on pre-qualification answers.\n\nPolicy Review: The full application summary is available here.\n\nQuote: When you select Quote, all the policy information is fed into a rating engine to calculate the premium. After the Quote returns, both Forms and Payments become available. This is in preparation for the binding an issuance of the policy\n\nForms: These are discussed in a later lessom\n\nPayments: Before binding or issuing a policy, the payment screen provides an in-depth look at the different payment options, making it easy to switch between the different plans. The payment information comes from an integrated billing system. Specifics about payment configuration are available in PolicyCenter documentation or a supplemental education lesson.\n\nBind: Makes the policy a legal contract insuring the applicant PolicyCenter sends information to the billing system- No documents are printed after the Bind Only selection. The submission status changes to \"Bound.“\n\nIssue: When the \"Issue Policy\" menu item is selected, PolicyCenter sends information to the billing system and PolicyCenter sends information to the printing system to provide hard copy documents to the insured. The base application Issue Policy option also binds the policy. The resulting status is \"Issued\". Configured versions of PolicyCenter may require additional steps prior to binding.\n\nPolicyCenter makes a distinction between binding and issuing a submission. Binding means that the insured and the insurer have agreed to terms and price, , and a policy is in force. If the insured has a car accident one hour after the submission is bound, the policy covers the incident even though the insured has not received oficial documentation. Issuing means that a submission may be bound, but its policy documents have not yet been issued. Perhaps the insurer needed to collect or verify additional information, , so the policy issuance occurs after the information is added is added to the policy.",
      "notes": "Demonstration\nRun through the Personal Auto demo (refer to Instructor Guide). Use Ray Newton’s account and show the students how to complete a full application and submit significant pieces of required information. Show students how to add new drivers and vehicles, and point out the requirements for the number of accidents- The following information applies to each policy demo, regardless of LOB.\n\nOfferings: An offering allows insurers to define different product types based on existing base product definitions. Offerings can also be used for marketing\nprograms, which are which are targeted versions of an insurance policy intended for a specific market segment. A marketing program is intended for a particular type of business, producer or region.\n\nPre-Qualification: The next step in the submission process is to answer a series of pre-qualification questions. These questions are used as an early indicator to reveal if an applicant qualifies for the type of insurance being sought. Filtered questions are tied to a specific answer. During Qualification, underwriting issues may arise based on the applicant’s responses. These issues will appear in the Risk Analysis review.\n\nPolicy Info: Captures basic information about the primary named insured, the producer, policy details, and theselected underwriting company.\n\nUnderwriting: Large insurers license subsidiaries to underwrite policies on their behalf to accommodate state regulatory requirements. Many states do not allow insurers to have more than one set of rates per underwriting company. If insurers want to offer multiple sets of rates in that state, they must file each set under a separate underwriting company for that state. Underwriters may profile an account to determine its market segment to determine which underwriting company can underwrite the policy. The rates are determined for the account through this profiling method. In the example, there are three possible segments: low, medium and high- This selection influences the rating of the policy and the policy's cost More details about underwriting are available in other training lessons as well as PolicyCenter documentation.\n\nCoverages: Coverage patterns were first mentioned with respect to the Product Model- Examples of Personal Auto ( PA) coverage include collision or liability coverages.\n\nModifiers: Decreases or increases premiums based on specific factors. More details on modifiers are available in the Product DesJgner discussiom Risk Analysis: This section is where any underwriting concerns appear during the submission process. Underwriters have the option to remove or maintain any issues that are blocking the issuance of a policy- Underwriting issues may appear in Risk Analysis based on pre-qualification answers.\n\nPolicy Review: The full application summary is available here.\n\nQuote: When you select Quote, all the policy information is fed into a rating engine to calculate the premium. After the Quote returns, both Forms and Payments become available. This is in preparation for the binding an issuance of the policy\n\nForms: These are discussed in a later lessom\n\nPayments: Before binding or issuing a policy, the payment screen provides an in-depth look at the different payment options, making it easy to switch between the different plans. The payment information comes from an integrated billing system. Specifics about payment configuration are available in PolicyCenter documentation or a supplemental education lesson.\n\nBind: Makes the policy a legal contract insuring the applicant PolicyCenter sends information to the billing system- No documents are printed after the Bind Only selection. The submission status changes to \"Bound.“\n\nIssue: When the \"Issue Policy\" menu item is selected, PolicyCenter sends information to the billing system and PolicyCenter sends information to the printing system to provide hard copy documents to the insured. The base application Issue Policy option also binds the policy. The resulting status is \"Issued\". Configured versions of PolicyCenter may require additional steps prior to binding.\n\nPolicyCenter makes a distinction between binding and issuing a submission. Binding means that the insured and the insurer have agreed to terms and price, , and a policy is in force. If the insured has a car accident one hour after the submission is bound, the policy covers the incident even though the insured has not received oficial documentation. Issuing means that a submission may be bound, but its policy documents have not yet been issued. Perhaps the insurer needed to collect or verify additional information, , so the policy issuance occurs after the information is added is added to the policy.",
      "narration": "In this demo, observe how a full application unfolds in the Personal Auto line. Notice how offerings are defined and how pre-qualification questions help streamline underwriting. As you watch, consider how these components interconnect within the data model, from policy info to modifiers, impacting the final quote and binding process.",
      "ocrText": "D trati\n| emonstration GG\nPersonal Auto submission\n\nclick here\n\nNote: The demonstration opens a new tab in your browser. When the demonstration ends, the\noriginal course launch window appears. Return to this window to continue this presentation.",
      "ocrWordCount": 38,
      "ocrConfidence": 94.21,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_instruction",
      "demoVideoIndex": 0
    },
    {
      "slideNumber": 8,
      "title": "Businessowners Submission Demo",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Demonstrate a full application using Wright Construction's account. Focus on adding buildings and locations, and explain premium basis determination.",
      "narration": "Next, let’s explore a Businessowners submission with Wright Construction. Here, you'll see how to add new buildings and locations, crucial for determining premiums. This scenario underscores the importance of capturing detailed property information, which feeds into the rating engine to drive accurate premium calculations.",
      "ocrText": "",
      "ocrWordCount": 0,
      "ocrConfidence": 0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_video"
    },
    {
      "slideNumber": 9,
      "title": "Rating and Quoting Performance Improvements",
      "bodyParagraphs": [],
      "originalNotes": "Demonstration\nRun through the Businessowners demo (referto Instructor Guide). Use Wright Construction's account and show the students how to complete a full application and submit significant pieces of required information- Show students how to add new buildings and locations, and point out how the premium basis amount is determined. The following information applies to each policy demo, regardless of LOB.\n\nOfferings: An offering allows insurers to define different product types based onexisting base product definitions. Offerings can also be used for marketing programs, which are which are targeted versions of an insurance policy intended for a specific market segment. A marketing program is intended for a particular type of business, producer or region.\n\nPre-Qualification: The next step in the submission process is to answer a series of pre-qualification questions. These questions are used as an early indicator to reveal if an applicant qualifies for the type of insurance being sought. Filtered questions are tied to a specific answer. During Qualification, underwriting issues may arise based on the applicant’s responses. These issues will appear in the Risk Analysis review.\n\nPolicy Info: Captures basic information about the primary named insured, the producer, policy details, and the selected underwriting company.\n\nUnderwriting: Large insurers license subsidiaries to underwrite policies on their behalf to accommodate state regulatory requirements. Many states do not allow insurers to have more than one set of rates per underwriting company. If insurers want to offer multiple sets of rates in that state, they must file each set under a separate underwriting company for that state. Underwriters may profile an account to determine its market segment to determine which underwriting company can underwrite the policy. The rates are determined for the account through this profiling method. In the example, there are three possible segments: low, medium and high- This selection influences the rating of the policy and the policy's cost. More details about underwriting are available in other training lessons as well as PolicyCenter documentation.\n\nCoverages: Coverage patterns were first mentioned with respect to the Product Model- Examples of Personal Auto ( PA) coverage include collision or liability coverages\n\nModifiers: Decreases or increases premiums based on specific factors. More details on modifiers are available in the Product Desygner discussiom\n\nRisk Analysis: This section is where any underwriting concerns appear during the submission process. Underwriters have the option to remove or maintain any issues that are blocking the issuance of a policy- Underwriting issues may appear in Risk Analysis based on pre-qualification answers.\n\nPolicy Review: The full application summary is available here. Quote: When you select Quote, all the policy information is fed into a rating engine to calculate the premium. After the Quote returns, both Forms andPayments become available. This is in preparation for the binding an issuance of the Policy\n\nForms: These are discussed in a later lessom\n\nPayments: Before binding or issuing a policy, the payment screen provides an in-depth look at the different payment options, making it easy to switch between the different plans. The payment information comes from an integrated billing system. Specifics about pavment configuration are available in PolicyCenter documentation or a supplemental education lesson.\n\nBind: Makes the policy a legal contract insuring theapplicant PolicyCenter sends information to the billing system- No documents are printed after the Bind Only selection. The submission status changes to \"Bound.“\n\nIssue: When the \"Issue Policy\" menu item is selected, PolicyCenter sends information to the billing system and PolicyCenter sends information to the printing system to provide hard copy documents to the insured. The base application Issue Policy option also binds the policy. The resulting status is \"Issued\". Configured versions of PolicyCenter may require additional steps prior to binding.\n\nPolicyCenter makes a distinction between binding and issuing a submission. Binding means that the insured and the insurer have agreed to terms and price, , and a policy is in force. If the insured has a car accident one hour after the submission is bound, the policy covers the incident even though the insured has not received offcial documentation. Issuing means that a submission may be bound, but its policy documents have not yet been issued. Perhaps the insurer needed to collect or verify additional information, , so the policy issuance occurs after the information is added is added to the policy.",
      "notes": "Demonstration\nRun through the Businessowners demo (referto Instructor Guide). Use Wright Construction's account and show the students how to complete a full application and submit significant pieces of required information- Show students how to add new buildings and locations, and point out how the premium basis amount is determined. The following information applies to each policy demo, regardless of LOB.\n\nOfferings: An offering allows insurers to define different product types based onexisting base product definitions. Offerings can also be used for marketing programs, which are which are targeted versions of an insurance policy intended for a specific market segment. A marketing program is intended for a particular type of business, producer or region.\n\nPre-Qualification: The next step in the submission process is to answer a series of pre-qualification questions. These questions are used as an early indicator to reveal if an applicant qualifies for the type of insurance being sought. Filtered questions are tied to a specific answer. During Qualification, underwriting issues may arise based on the applicant’s responses. These issues will appear in the Risk Analysis review.\n\nPolicy Info: Captures basic information about the primary named insured, the producer, policy details, and the selected underwriting company.\n\nUnderwriting: Large insurers license subsidiaries to underwrite policies on their behalf to accommodate state regulatory requirements. Many states do not allow insurers to have more than one set of rates per underwriting company. If insurers want to offer multiple sets of rates in that state, they must file each set under a separate underwriting company for that state. Underwriters may profile an account to determine its market segment to determine which underwriting company can underwrite the policy. The rates are determined for the account through this profiling method. In the example, there are three possible segments: low, medium and high- This selection influences the rating of the policy and the policy's cost. More details about underwriting are available in other training lessons as well as PolicyCenter documentation.\n\nCoverages: Coverage patterns were first mentioned with respect to the Product Model- Examples of Personal Auto ( PA) coverage include collision or liability coverages\n\nModifiers: Decreases or increases premiums based on specific factors. More details on modifiers are available in the Product Desygner discussiom\n\nRisk Analysis: This section is where any underwriting concerns appear during the submission process. Underwriters have the option to remove or maintain any issues that are blocking the issuance of a policy- Underwriting issues may appear in Risk Analysis based on pre-qualification answers.\n\nPolicy Review: The full application summary is available here. Quote: When you select Quote, all the policy information is fed into a rating engine to calculate the premium. After the Quote returns, both Forms andPayments become available. This is in preparation for the binding an issuance of the Policy\n\nForms: These are discussed in a later lessom\n\nPayments: Before binding or issuing a policy, the payment screen provides an in-depth look at the different payment options, making it easy to switch between the different plans. The payment information comes from an integrated billing system. Specifics about pavment configuration are available in PolicyCenter documentation or a supplemental education lesson.\n\nBind: Makes the policy a legal contract insuring theapplicant PolicyCenter sends information to the billing system- No documents are printed after the Bind Only selection. The submission status changes to \"Bound.“\n\nIssue: When the \"Issue Policy\" menu item is selected, PolicyCenter sends information to the billing system and PolicyCenter sends information to the printing system to provide hard copy documents to the insured. The base application Issue Policy option also binds the policy. The resulting status is \"Issued\". Configured versions of PolicyCenter may require additional steps prior to binding.\n\nPolicyCenter makes a distinction between binding and issuing a submission. Binding means that the insured and the insurer have agreed to terms and price, , and a policy is in force. If the insured has a car accident one hour after the submission is bound, the policy covers the incident even though the insured has not received offcial documentation. Issuing means that a submission may be bound, but its policy documents have not yet been issued. Perhaps the insurer needed to collect or verify additional information, , so the policy issuance occurs after the information is added is added to the policy.",
      "narration": "Let's dive into some performance enhancements in PolicyCenter. Parallel rating, for instance, boosts efficiency by processing coverables using multiple threads. This is particularly relevant in complex commercial policies. We'll also discuss asynchronous and two-step quoting, both pivotal in optimizing quote generation and improving user experience.",
      "ocrText": "Demonstration\nGi\nBusinessowners submission\n\nclick here\n\nNote: The demonstration opens a new tab in your browser. When the demonstration ends, the\noriginal course launch window appears. Return to this window to continue this presentation.",
      "ocrWordCount": 34,
      "ocrConfidence": 94.59,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_instruction",
      "demoVideoIndex": 1
    },
    {
      "slideNumber": 10,
      "title": "Understanding Asynchronous Quoting",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "To enable asynchronous quoting, set the AsynchronousQuotingEnabled parameter to true. It triggers when coverables exceed a threshold, enhancing performance.",
      "narration": "Asynchronous quoting is a game-changer in managing complex policies. By enabling the AsynchronousQuotingEnabled parameter, PolicyCenter processes quotes in the background, enhancing user experience by freeing up the interface. This is particularly useful when dealing with a large number of coverables, ensuring smooth and efficient operations.",
      "ocrText": "",
      "ocrWordCount": 0,
      "ocrConfidence": 0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_video"
    },
    {
      "slideNumber": 11,
      "title": "Asynchronous Quoting Flow",
      "bodyParagraphs": [],
      "originalNotes": "Demonstration\nRun through the Homeowners demo (refer to Instructor Guide)- Use Ray Newton's account and show the students how to complete a full application and submit significant pieces of required information. Show students how to add a new dwelling, and point out the dwelling details. The following information applies to each policy demo, regardless of LOB.\n\nOfferings: An offering allows insurers to define different product types based on existing base product definitions. Offerings can also be used for marketing programs, which are which are targeted versions of an insurance policy intended for a specific market segment. A marketing program is intended for a particular type of business, producer or region.\n\nPre-Qualification: The next step in the submission process is to answer a series of pre-qualification questions. These questions are used as an early indicator to reveal if an applicant qualifies for the type of insurance being sought. Filtered questions are tied to a specific answer. During Qualification, underwriting issues may arise based on the applicant’s responses. These issues will appear in the Risk Analysis review.\n\nPolicy Info: Captures basic information about the primary named insured, the producer, policy details, and the selected underwriting company\n\nUnderwriting: Large insurers license subsidiaries to underwrite policies on their behalf to accommodate state regulatory requirements. Many states do not allow insurers to have more than one set of rates per underwriting company. If insurers want to offer multiple sets of rates in that state, they must file each set under a separate underwriting company for that state. Underwriters may profile an account to determine its market segment to determine which underwriting company can underwrite the policy. The rates are determined for the account through this profiling method. In the example,there are three possible segments: low, medium and high- This selection influences the rating of the policy and the policy's cost. More details about underwriting are available in other training lessons as well as PolicyCenter documentation.\n\nCoverages: Coverage patterns were first mentioned with respect to the Product Model- Examples of Personal Auto ( PA) coverage include collision or liability coverages.\n\nModifiers: Decreases or increases premiums based on specific factors. More details on modifiers are available in the Product Desygner discussiom\n\nRisk Analysis: This section is where any underwriting concerns appear during the submission process. Underwriters have the option to remove or maintain any issues that are blocking the issuance of a policy- Underwriting issues may appear in Risk Analysis based on pre-qualification answers.\n\nPolicy Review: The full application summary is available here. Quote: When you select Quote, all the policy information is fed into a rating engine to calculate the premium. After the Quote returns, both Forms andPayments become available. This is in preparation for the binding an issuance of the Policy\n\nForms: These are discussed in a later lessom\n\nPayments: Before binding or issuing a policy, the payment screen provides an in-depth look at the different payment options, making it easy to switch between the different plans. The payment information comes from an integrated billing system. Specifics about pavment configuration are available in PolicyCenter documentation or a supplemental education lesson.\n\nBind: Makes the policy a legal contract insuring theapplicant PolicyCenter sends information to the billing system- No documents are printed after the Bind Only selection. The submission status changes to \"Bound.“\n\nIssue: When the \"Issue Policy\" menu item is selected, PolicyCenter sends information to the billing system and PolicyCenter sends information to the printing system to provide hard copy documents to the insured. The base application Issue Policy option also binds the policy. The resulting status is \"Issued\". Configured versions of PolicyCenter may require additional steps prior to binding.\n\nPolicyCenter makes a distinction between binding and issuing a submission. Binding means that the insured and the insurer have agreed to terms and price, , and a policy is in force. If the insured has a car accident one hour after the submission is bound, the policy covers the incident even though the insured has not received offcial documentation. Issuing means that a submission may be bound, but its policy documents have not yet been issued. Perhaps the insurer needed to collect or verify additional information, , so the policy issuance occurs after the information is added is added to the policy-",
      "notes": "Demonstration\nRun through the Homeowners demo (refer to Instructor Guide)- Use Ray Newton's account and show the students how to complete a full application and submit significant pieces of required information. Show students how to add a new dwelling, and point out the dwelling details. The following information applies to each policy demo, regardless of LOB.\n\nOfferings: An offering allows insurers to define different product types based on existing base product definitions. Offerings can also be used for marketing programs, which are which are targeted versions of an insurance policy intended for a specific market segment. A marketing program is intended for a particular type of business, producer or region.\n\nPre-Qualification: The next step in the submission process is to answer a series of pre-qualification questions. These questions are used as an early indicator to reveal if an applicant qualifies for the type of insurance being sought. Filtered questions are tied to a specific answer. During Qualification, underwriting issues may arise based on the applicant’s responses. These issues will appear in the Risk Analysis review.\n\nPolicy Info: Captures basic information about the primary named insured, the producer, policy details, and the selected underwriting company\n\nUnderwriting: Large insurers license subsidiaries to underwrite policies on their behalf to accommodate state regulatory requirements. Many states do not allow insurers to have more than one set of rates per underwriting company. If insurers want to offer multiple sets of rates in that state, they must file each set under a separate underwriting company for that state. Underwriters may profile an account to determine its market segment to determine which underwriting company can underwrite the policy. The rates are determined for the account through this profiling method. In the example,there are three possible segments: low, medium and high- This selection influences the rating of the policy and the policy's cost. More details about underwriting are available in other training lessons as well as PolicyCenter documentation.\n\nCoverages: Coverage patterns were first mentioned with respect to the Product Model- Examples of Personal Auto ( PA) coverage include collision or liability coverages.\n\nModifiers: Decreases or increases premiums based on specific factors. More details on modifiers are available in the Product Desygner discussiom\n\nRisk Analysis: This section is where any underwriting concerns appear during the submission process. Underwriters have the option to remove or maintain any issues that are blocking the issuance of a policy- Underwriting issues may appear in Risk Analysis based on pre-qualification answers.\n\nPolicy Review: The full application summary is available here. Quote: When you select Quote, all the policy information is fed into a rating engine to calculate the premium. After the Quote returns, both Forms andPayments become available. This is in preparation for the binding an issuance of the Policy\n\nForms: These are discussed in a later lessom\n\nPayments: Before binding or issuing a policy, the payment screen provides an in-depth look at the different payment options, making it easy to switch between the different plans. The payment information comes from an integrated billing system. Specifics about pavment configuration are available in PolicyCenter documentation or a supplemental education lesson.\n\nBind: Makes the policy a legal contract insuring theapplicant PolicyCenter sends information to the billing system- No documents are printed after the Bind Only selection. The submission status changes to \"Bound.“\n\nIssue: When the \"Issue Policy\" menu item is selected, PolicyCenter sends information to the billing system and PolicyCenter sends information to the printing system to provide hard copy documents to the insured. The base application Issue Policy option also binds the policy. The resulting status is \"Issued\". Configured versions of PolicyCenter may require additional steps prior to binding.\n\nPolicyCenter makes a distinction between binding and issuing a submission. Binding means that the insured and the insurer have agreed to terms and price, , and a policy is in force. If the insured has a car accident one hour after the submission is bound, the policy covers the incident even though the insured has not received offcial documentation. Issuing means that a submission may be bound, but its policy documents have not yet been issued. Perhaps the insurer needed to collect or verify additional information, , so the policy issuance occurs after the information is added is added to the policy-",
      "narration": "When you initiate a quote, PolicyCenter informs you that the process will occur in the background. This flow includes creating a work item and placing it in a queue, providing flexibility to continue other tasks. Upon completion, an activity is generated, showing whether the quote succeeded or encountered issues, ensuring transparency and ease of management.",
      "ocrText": "Demonstration\nGi\nHomeowners submission\n\nclick here\n\nNote: The demonstration opens a new tab in your browser. When the demonstration ends, the\noriginal course launch window appears. Return to this window to continue this presentation.",
      "ocrWordCount": 34,
      "ocrConfidence": 94.76,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_instruction",
      "demoVideoIndex": 2
    },
    {
      "slideNumber": 12,
      "title": "Homeowners Submission Demo",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Demonstrate the process for a Homeowners policy using Ray Newton's account. Highlight dwelling details and policy specifics.",
      "narration": "In this Homeowners policy demo, observe how to add a new dwelling and capture its specifics. This step is vital for accurate risk assessment and premium calculation. As you watch, consider the integration of these details within the broader policy framework, reinforcing the importance of comprehensive data capture.",
      "ocrText": "",
      "ocrWordCount": 0,
      "ocrConfidence": 0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_video"
    },
    {
      "slideNumber": 13,
      "title": "Introducing Two-Step Quoting",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Learn about two-step quoting, where a Rate button replaces Quote initially. Rating occurs first, followed by quoting.",
      "narration": "Two-step quoting is an efficient way to manage complex policies. Initially, the Rate button calculates the premium, elevating the policy to Rated status. Once rated, you can proceed with quoting, bringing the policy to Quoted status. This separation allows for more granular control over the quoting process, enhancing flexibility.",
      "ocrText": "Gi\n\nMarci ; &\nConfiguration \\ Vas\n\nFor certain lines of business, generating quotes\n\ncan take a long time (for example, a commercial\n\nproperty policy with a large number of buildings).\n} d How does PolicyCenter optimize quoting\nperformance?\n\nDeveloper",
      "ocrWordCount": 40,
      "ocrConfidence": 88.38,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 14,
      "title": "Two-Step Quoting Demonstration",
      "bodyParagraphs": [],
      "originalNotes": "Rating and quoting performance improvements\nParallel rating can improve the performance of generating quotes on policies with large numbers of coverables by rating coverables in parallel using multiple threads. Implementation requires Guidewire Rating Management. In the base configuration, parallel rating is enabled by default, and parallel rating is implemented in the commercial property line of business. We will focus on asynchronous quoting and two step quoting in this lesson.",
      "notes": "Rating and quoting performance improvements\nParallel rating can improve the performance of generating quotes on policies with large numbers of coverables by rating coverables in parallel using multiple threads. Implementation requires Guidewire Rating Management. In the base configuration, parallel rating is enabled by default, and parallel rating is implemented in the commercial property line of business. We will focus on asynchronous quoting and two step quoting in this lesson.",
      "narration": "In this demonstration, see two-step quoting in action. Notice how the Rate button facilitates an initial premium calculation, setting the stage for subsequent quoting. This approach not only streamlines the process but also allows for more detailed analysis of each step, ensuring accuracy and efficiency in policy handling.",
      "ocrText": "| Rating and quoting performance improvements\n\n• Parallel rating\n* Rates coverables in parallel using multiple threads\n•« Asynchronous quoting\n« Runs the quote process in the background\n* Two-step quoting\n* The first step validates the policy data and rates the policy\n\n* The second step completes post-rating tasks, such as generating forms and raising\nunderwriting issues",
      "ocrWordCount": 58,
      "ocrConfidence": 89.64,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 15,
      "title": "Summary and Next Steps",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Summarize key learnings from the full application submission process and preview the upcoming lesson on Policy Tools.",
      "narration": "We've covered a lot in our deep dive into the full application submission process—from understanding the workflow to exploring advanced quoting techniques. These insights are crucial for effective policy management in PolicyCenter. Next, we'll shift focus to Policy Tools, where we'll learn how to leverage various utilities to enhance your PolicyCenter experience. Stay tuned for more insights!",
      "ocrText": "Tanya\n\nCustomer\n\nService\nRepresentative\n\nGreat! With asynchronous quoting, | can\nnavigate to other screens and work while\nPolicyCenter is generating the quote, and | can\nbe notified when the quote process is complete.",
      "ocrWordCount": 33,
      "ocrConfidence": 95.38,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 16,
      "title": "Asynchronous quoting",
      "bodyParagraphs": [],
      "originalNotes": "Asynchronous quoting\nTo use asynchronous quoting, AsynchronousQuotingEnabled must be enabled, and the parameter set to true. By default, it is disabled, however, it has been enabled for training purposes.\n\nIn the base configuration, asynchronous quoting is available in the commercial lines of business and all policy transactions. Through configuration, asynchronous quoting can be modified to meet your needs and be added to other lines of business. The base configuration, PolicyCenter triggers asynchronous quoting when the number of coverables exceeds the configurable threshold of three. The table shows the coverables that trigger asynchronous quoting in the base configuration The default threshold is 30 coverables. For training purpose, the threshold for the Commercial Auto and Businessowners lines has been changed to 3 in gw/lob/common/AsyncQuoteCov erableThresholdByLine.gs.",
      "notes": "Asynchronous quoting\nTo use asynchronous quoting, AsynchronousQuotingEnabled must be enabled, and the parameter set to true. By default, it is disabled, however, it has been enabled for training purposes.\n\nIn the base configuration, asynchronous quoting is available in the commercial lines of business and all policy transactions. Through configuration, asynchronous quoting can be modified to meet your needs and be added to other lines of business. The base configuration, PolicyCenter triggers asynchronous quoting when the number of coverables exceeds the configurable threshold of three. The table shows the coverables that trigger asynchronous quoting in the base configuration The default threshold is 30 coverables. For training purpose, the threshold for the Commercial Auto and Businessowners lines has been changed to 3 in gw/lob/common/AsyncQuoteCov erableThresholdByLine.gs.",
      "narration": "",
      "ocrText": "| Asynchronous quoting\n\nOccurs under these conditions\n\n+ Asynchronous quoting is enabled (AsynchronousQuotingEnabled = true in config.xml)\n* The number of coverables exceeds a threshold\n\n* The line supports it\n\nCommercial auto Vehicles\nBusiness owners Buildings\nCommercial property Buildings\nGeneral liability Exposures\nInland marine Signs\n\nWorkers’ compensation Covered employees",
      "ocrWordCount": 49,
      "ocrConfidence": 92.18,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 17,
      "title": "Asynchronous quoting flow",
      "bodyParagraphs": [],
      "originalNotes": "Asynchronous quoting flow\n1. When you select Quote, PolicyCenter displays an alert informing you informing you that quoting will be processed in the background. To proceed, select 0K\na) PolicyCenter creates a work item for the quote and places it in a work queue for the Asynchronous Quoting work queue to process-\nb) Until asynchronous quoting completes, PolicyCenter displays a message at the top of the policy transaction screens indicating that the quote is being processed.\n\n2. The policy transaction is locked and cannot be edited- Only . Only the Back and Next buttons are available. You can view the current policy transaction and navigate to other screens to do other work.\n\n3. When quoting completes, PolicyCenter:\na) Unlocks the policy transaction-\nb) Creates an activity that the quote completed. The activity subject indicates whether the quote completed successfully or completed with warnings or errors.\n\n4. Navigate to Desktop—My Activities, and click the activity Subject to view the activity and the associated quote. PolicyCenter displays the Quote screen for the policy transaction and the associated activity in the Activity tab. If the quote has warnings or errors, they can be viewed viewed in the Validation Results tab next to the Activity tab. More issues, such as rating or unexpected errors, will appear on the policy transaction screen. A quote with only informational messages will not have a Validation Results tab.",
      "notes": "Asynchronous quoting flow\n1. When you select Quote, PolicyCenter displays an alert informing you informing you that quoting will be processed in the background. To proceed, select 0K\na) PolicyCenter creates a work item for the quote and places it in a work queue for the Asynchronous Quoting work queue to process-\nb) Until asynchronous quoting completes, PolicyCenter displays a message at the top of the policy transaction screens indicating that the quote is being processed.\n\n2. The policy transaction is locked and cannot be edited- Only . Only the Back and Next buttons are available. You can view the current policy transaction and navigate to other screens to do other work.\n\n3. When quoting completes, PolicyCenter:\na) Unlocks the policy transaction-\nb) Creates an activity that the quote completed. The activity subject indicates whether the quote completed successfully or completed with warnings or errors.\n\n4. Navigate to Desktop—My Activities, and click the activity Subject to view the activity and the associated quote. PolicyCenter displays the Quote screen for the policy transaction and the associated activity in the Activity tab. If the quote has warnings or errors, they can be viewed viewed in the Validation Results tab next to the Activity tab. More issues, such as rating or unexpected errors, will appear on the policy transaction screen. A quote with only informational messages will not have a Validation Results tab.",
      "narration": "",
      "ocrText": "| Asynchronous quoting flow\n\noo\n&\n\nClicks quote\n\nAlert\nmessage\n\n°\n\nQuoting runs in the\nbackground, and the\npolicy transaction is\nlocked\n\n‘@)\n=\n\nwe\n\nQuoting\ncompletes,\nunlocks, and\ncreates activity\n\nClicking the\nactivity subject\ndisplays the quote\npage, if successful",
      "ocrWordCount": 41,
      "ocrConfidence": 90.02,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 18,
      "title": "Demonstration",
      "bodyParagraphs": [],
      "originalNotes": "Demonstration\nRun through the Homeowners demo (refer to Instructor Guide)- Use Ray Newton's account and show the students how to complete a full application and submit significant pieces of required information. Show students how to add a new dwelling, and point out the dwelling details. The following information applies to each policy demo, regardless of LOB.\n\nOfferings: An offering allows insurers to define different product types based on existing base product definitions. Offerings can also be used for marketing programs, which are which are targeted versions of an insurance policy intended for a specific market segment. A marketing program is intended for a particular type of business, producer or region.\n\nPre-Qualification: The next step in the submission process is to answer a series of pre-qualification questions. These questions are used as an early indicator to reveal if an applicant qualifies for the type of insurance being sought. Filtered questions are tied to a specific answer. During Qualification, underwriting issues may arise based on the applicant’s responses. These issues will appear in the Risk Analysis review.\n\nPolicy Info: Captures basic information about the primary named insured, the producer, policy details, and the selected underwriting company\n\nUnderwriting: Large insurers license subsidiaries to underwrite policies on their behalf to accommodate state regulatory requirements. Many states do not allow insurers to have more than one set of rates per underwriting company. If insurers want to offer multiple sets of rates in that state, they must file each set under a separate underwriting company for that state. Underwriters may profile an account to determine its market segment to determine which underwriting company can underwrite the policy. The rates are determined for the account through this profiling method. In the example,there are three possible segments: low, medium and high- This selection influences the rating of the policy and the policy's cost. More details about underwriting are available in other training lessons as well as PolicyCenter documentation.\n\nCoverages: Coverage patterns were first mentioned with respect to the Product Model- Examples of Personal Auto ( PA) coverage include collision or liability coverages.\n\nModifiers: Decreases or increases premiums based on specific factors. More details on modifiers are available in the Product Desygner discussiom\n\nRisk Analysis: This section is where any underwriting concerns appear during the submission process. Underwriters have the option to remove or maintain any issues that are blocking the issuance of a policy- Underwriting issues may appear in Risk Analysis based on pre-qualification answers.\n\nPolicy Review: The full application summary is available here. Quote: When you select Quote, all the policy information is fed into a rating engine to calculate the premium. After the Quote returns, both Forms andPayments become available. This is in preparation for the binding an issuance of the Policy\n\nForms: These are discussed in a later lessom\n\nPayments: Before binding or issuing a policy, the payment screen provides an in-depth look at the different payment options, making it easy to switch between the different plans. The payment information comes from an integrated billing system. Specifics about pavment configuration are available in PolicyCenter documentation or a supplemental education lesson.\n\nBind: Makes the policy a legal contract insuring theapplicant PolicyCenter sends information to the billing system- No documents are printed after the Bind Only selection. The submission status changes to \"Bound.“\n\nIssue: When the \"Issue Policy\" menu item is selected, PolicyCenter sends information to the billing system and PolicyCenter sends information to the printing system to provide hard copy documents to the insured. The base application Issue Policy option also binds the policy. The resulting status is \"Issued\". Configured versions of PolicyCenter may require additional steps prior to binding.\n\nPolicyCenter makes a distinction between binding and issuing a submission. Binding means that the insured and the insurer have agreed to terms and price, , and a policy is in force. If the insured has a car accident one hour after the submission is bound, the policy covers the incident even though the insured has not received offcial documentation. Issuing means that a submission may be bound, but its policy documents have not yet been issued. Perhaps the insurer needed to collect or verify additional information, , so the policy issuance occurs after the information is added is added to the policy-",
      "notes": "Demonstration\nRun through the Homeowners demo (refer to Instructor Guide)- Use Ray Newton's account and show the students how to complete a full application and submit significant pieces of required information. Show students how to add a new dwelling, and point out the dwelling details. The following information applies to each policy demo, regardless of LOB.\n\nOfferings: An offering allows insurers to define different product types based on existing base product definitions. Offerings can also be used for marketing programs, which are which are targeted versions of an insurance policy intended for a specific market segment. A marketing program is intended for a particular type of business, producer or region.\n\nPre-Qualification: The next step in the submission process is to answer a series of pre-qualification questions. These questions are used as an early indicator to reveal if an applicant qualifies for the type of insurance being sought. Filtered questions are tied to a specific answer. During Qualification, underwriting issues may arise based on the applicant’s responses. These issues will appear in the Risk Analysis review.\n\nPolicy Info: Captures basic information about the primary named insured, the producer, policy details, and the selected underwriting company\n\nUnderwriting: Large insurers license subsidiaries to underwrite policies on their behalf to accommodate state regulatory requirements. Many states do not allow insurers to have more than one set of rates per underwriting company. If insurers want to offer multiple sets of rates in that state, they must file each set under a separate underwriting company for that state. Underwriters may profile an account to determine its market segment to determine which underwriting company can underwrite the policy. The rates are determined for the account through this profiling method. In the example,there are three possible segments: low, medium and high- This selection influences the rating of the policy and the policy's cost. More details about underwriting are available in other training lessons as well as PolicyCenter documentation.\n\nCoverages: Coverage patterns were first mentioned with respect to the Product Model- Examples of Personal Auto ( PA) coverage include collision or liability coverages.\n\nModifiers: Decreases or increases premiums based on specific factors. More details on modifiers are available in the Product Desygner discussiom\n\nRisk Analysis: This section is where any underwriting concerns appear during the submission process. Underwriters have the option to remove or maintain any issues that are blocking the issuance of a policy- Underwriting issues may appear in Risk Analysis based on pre-qualification answers.\n\nPolicy Review: The full application summary is available here. Quote: When you select Quote, all the policy information is fed into a rating engine to calculate the premium. After the Quote returns, both Forms andPayments become available. This is in preparation for the binding an issuance of the Policy\n\nForms: These are discussed in a later lessom\n\nPayments: Before binding or issuing a policy, the payment screen provides an in-depth look at the different payment options, making it easy to switch between the different plans. The payment information comes from an integrated billing system. Specifics about pavment configuration are available in PolicyCenter documentation or a supplemental education lesson.\n\nBind: Makes the policy a legal contract insuring theapplicant PolicyCenter sends information to the billing system- No documents are printed after the Bind Only selection. The submission status changes to \"Bound.“\n\nIssue: When the \"Issue Policy\" menu item is selected, PolicyCenter sends information to the billing system and PolicyCenter sends information to the printing system to provide hard copy documents to the insured. The base application Issue Policy option also binds the policy. The resulting status is \"Issued\". Configured versions of PolicyCenter may require additional steps prior to binding.\n\nPolicyCenter makes a distinction between binding and issuing a submission. Binding means that the insured and the insurer have agreed to terms and price, , and a policy is in force. If the insured has a car accident one hour after the submission is bound, the policy covers the incident even though the insured has not received offcial documentation. Issuing means that a submission may be bound, but its policy documents have not yet been issued. Perhaps the insurer needed to collect or verify additional information, , so the policy issuance occurs after the information is added is added to the policy-",
      "narration": "",
      "ocrText": "| Demonstration G\n\nCommercial Auto submission with\n—_ asynchronous quoting\nclick here\n\nNote: The demonstration opens a new tab in your browser. When the demonstration ends, the\noriginal course launch window appears. Return to this window to continue this presentation.",
      "ocrWordCount": 40,
      "ocrConfidence": 94.2,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_instruction",
      "demoVideoIndex": 3
    },
    {
      "slideNumber": 19,
      "title": "",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "",
      "ocrWordCount": 0,
      "ocrConfidence": 0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_video"
    },
    {
      "slideNumber": 20,
      "title": "Simone",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Simone\nAgent\n\nGi\n\nWith two-step quoting, | can generate the quote\nand let the clients know the premium first and\nthen complete the post-rating tasks if they are\nsatisfied with the quote.",
      "ocrWordCount": 32,
      "ocrConfidence": 93.97,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 21,
      "title": "Two-step quoting",
      "bodyParagraphs": [],
      "originalNotes": "Two-step quoting\nWhen two-step quoting is enabled in PolicyCenter, insteadof a Quote button, a Rate button appears in the policy transaction when the policy period is in Draft status. Click Rate to generate the premium for the policy and elevate it to Rated status. After rating is completed, execute post- rating tasks by clicking Quote to bring the policy to Quoted status",
      "notes": "Two-step quoting\nWhen two-step quoting is enabled in PolicyCenter, insteadof a Quote button, a Rate button appears in the policy transaction when the policy period is in Draft status. Click Rate to generate the premium for the policy and elevate it to Rated status. After rating is completed, execute post- rating tasks by clicking Quote to bring the policy to Quoted status",
      "narration": "",
      "ocrText": "| Two-step quoting Gi\n\nImprove the quote time by splitting the quote process into two parts so that the part\nrequired to finish the quote is run after the price is finalized\n\nSync Product Model Infer forms\nValidate Check reinsurance\nCheck UW Issues Check UW Issues\n\n(pre-quote checking set) (Quote release checking set)\nRate",
      "ocrWordCount": 54,
      "ocrConfidence": 94.65,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 22,
      "title": "Demonstration",
      "bodyParagraphs": [],
      "originalNotes": "Demonstration\nRun through the Homeowners demo (refer to Instructor Guide)- Use Ray Newton's account and show the students how to complete a full application and submit significant pieces of required information. Show students how to add a new dwelling, and point out the dwelling details. The following information applies to each policy demo, regardless of LOB.\n\nOfferings: An offering allows insurers to define different product types based on existing base product definitions. Offerings can also be used for marketing programs, which are which are targeted versions of an insurance policy intended for a specific market segment. A marketing program is intended for a particular type of business, producer or region.\n\nPre-Qualification: The next step in the submission process is to answer a series of pre-qualification questions. These questions are used as an early indicator to reveal if an applicant qualifies for the type of insurance being sought. Filtered questions are tied to a specific answer. During Qualification, underwriting issues may arise based on the applicant’s responses. These issues will appear in the Risk Analysis review.\n\nPolicy Info: Captures basic information about the primary named insured, the producer, policy details, and the selected underwriting company\n\nUnderwriting: Large insurers license subsidiaries to underwrite policies on their behalf to accommodate state regulatory requirements. Many states do not allow insurers to have more than one set of rates per underwriting company. If insurers want to offer multiple sets of rates in that state, they must file each set under a separate underwriting company for that state. Underwriters may profile an account to determine its market segment to determine which underwriting company can underwrite the policy. The rates are determined for the account through this profiling method. In the example,there are three possible segments: low, medium and high- This selection influences the rating of the policy and the policy's cost. More details about underwriting are available in other training lessons as well as PolicyCenter documentation.\n\nCoverages: Coverage patterns were first mentioned with respect to the Product Model- Examples of Personal Auto ( PA) coverage include collision or liability coverages.\n\nModifiers: Decreases or increases premiums based on specific factors. More details on modifiers are available in the Product Desygner discussiom\n\nRisk Analysis: This section is where any underwriting concerns appear during the submission process. Underwriters have the option to remove or maintain any issues that are blocking the issuance of a policy- Underwriting issues may appear in Risk Analysis based on pre-qualification answers.\n\nPolicy Review: The full application summary is available here. Quote: When you select Quote, all the policy information is fed into a rating engine to calculate the premium. After the Quote returns, both Forms andPayments become available. This is in preparation for the binding an issuance of the Policy\n\nForms: These are discussed in a later lessom\n\nPayments: Before binding or issuing a policy, the payment screen provides an in-depth look at the different payment options, making it easy to switch between the different plans. The payment information comes from an integrated billing system. Specifics about pavment configuration are available in PolicyCenter documentation or a supplemental education lesson.\n\nBind: Makes the policy a legal contract insuring theapplicant PolicyCenter sends information to the billing system- No documents are printed after the Bind Only selection. The submission status changes to \"Bound.“\n\nIssue: When the \"Issue Policy\" menu item is selected, PolicyCenter sends information to the billing system and PolicyCenter sends information to the printing system to provide hard copy documents to the insured. The base application Issue Policy option also binds the policy. The resulting status is \"Issued\". Configured versions of PolicyCenter may require additional steps prior to binding.\n\nPolicyCenter makes a distinction between binding and issuing a submission. Binding means that the insured and the insurer have agreed to terms and price, , and a policy is in force. If the insured has a car accident one hour after the submission is bound, the policy covers the incident even though the insured has not received offcial documentation. Issuing means that a submission may be bound, but its policy documents have not yet been issued. Perhaps the insurer needed to collect or verify additional information, , so the policy issuance occurs after the information is added is added to the policy.",
      "notes": "Demonstration\nRun through the Homeowners demo (refer to Instructor Guide)- Use Ray Newton's account and show the students how to complete a full application and submit significant pieces of required information. Show students how to add a new dwelling, and point out the dwelling details. The following information applies to each policy demo, regardless of LOB.\n\nOfferings: An offering allows insurers to define different product types based on existing base product definitions. Offerings can also be used for marketing programs, which are which are targeted versions of an insurance policy intended for a specific market segment. A marketing program is intended for a particular type of business, producer or region.\n\nPre-Qualification: The next step in the submission process is to answer a series of pre-qualification questions. These questions are used as an early indicator to reveal if an applicant qualifies for the type of insurance being sought. Filtered questions are tied to a specific answer. During Qualification, underwriting issues may arise based on the applicant’s responses. These issues will appear in the Risk Analysis review.\n\nPolicy Info: Captures basic information about the primary named insured, the producer, policy details, and the selected underwriting company\n\nUnderwriting: Large insurers license subsidiaries to underwrite policies on their behalf to accommodate state regulatory requirements. Many states do not allow insurers to have more than one set of rates per underwriting company. If insurers want to offer multiple sets of rates in that state, they must file each set under a separate underwriting company for that state. Underwriters may profile an account to determine its market segment to determine which underwriting company can underwrite the policy. The rates are determined for the account through this profiling method. In the example,there are three possible segments: low, medium and high- This selection influences the rating of the policy and the policy's cost. More details about underwriting are available in other training lessons as well as PolicyCenter documentation.\n\nCoverages: Coverage patterns were first mentioned with respect to the Product Model- Examples of Personal Auto ( PA) coverage include collision or liability coverages.\n\nModifiers: Decreases or increases premiums based on specific factors. More details on modifiers are available in the Product Desygner discussiom\n\nRisk Analysis: This section is where any underwriting concerns appear during the submission process. Underwriters have the option to remove or maintain any issues that are blocking the issuance of a policy- Underwriting issues may appear in Risk Analysis based on pre-qualification answers.\n\nPolicy Review: The full application summary is available here. Quote: When you select Quote, all the policy information is fed into a rating engine to calculate the premium. After the Quote returns, both Forms andPayments become available. This is in preparation for the binding an issuance of the Policy\n\nForms: These are discussed in a later lessom\n\nPayments: Before binding or issuing a policy, the payment screen provides an in-depth look at the different payment options, making it easy to switch between the different plans. The payment information comes from an integrated billing system. Specifics about pavment configuration are available in PolicyCenter documentation or a supplemental education lesson.\n\nBind: Makes the policy a legal contract insuring theapplicant PolicyCenter sends information to the billing system- No documents are printed after the Bind Only selection. The submission status changes to \"Bound.“\n\nIssue: When the \"Issue Policy\" menu item is selected, PolicyCenter sends information to the billing system and PolicyCenter sends information to the printing system to provide hard copy documents to the insured. The base application Issue Policy option also binds the policy. The resulting status is \"Issued\". Configured versions of PolicyCenter may require additional steps prior to binding.\n\nPolicyCenter makes a distinction between binding and issuing a submission. Binding means that the insured and the insurer have agreed to terms and price, , and a policy is in force. If the insured has a car accident one hour after the submission is bound, the policy covers the incident even though the insured has not received offcial documentation. Issuing means that a submission may be bound, but its policy documents have not yet been issued. Perhaps the insurer needed to collect or verify additional information, , so the policy issuance occurs after the information is added is added to the policy.",
      "narration": "",
      "ocrText": "| Demonstration G\n\nCommercial Property submission with two step\n—_ quoting\nclick here\n\nNote: The demonstration opens a new tab in your browser. When the demonstration ends, the\noriginal course launch window appears. Return to this window to continue this presentation.",
      "ocrWordCount": 41,
      "ocrConfidence": 94.22,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_instruction",
      "demoVideoIndex": 4
    },
    {
      "slideNumber": 23,
      "title": "",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "",
      "ocrWordCount": 0,
      "ocrConfidence": 0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_video"
    },
    {
      "slideNumber": 24,
      "title": "Knowledge Check",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Question\nBased only on the submission wizard, what is the main screen which will\ni likely trigger an underwriting issue first?\n•\n•\nSoS oD DD DDS De Say\nGi",
      "ocrWordCount": 32,
      "ocrConfidence": 74.12,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question",
      "questionData": {
        "question": "Based only on the submission wizard, what is the main screen which will likely trigger an underwriting issue first?",
        "answer": "Pre-Qualification is the screen that will likely trigger an underwriting issue first. Other\nissues may be triggered later. (All underwriting issues appear on the Risk Analysis\nScreen - UW Issues tab.)"
      }
    },
    {
      "slideNumber": 25,
      "title": "Answer",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Answer Gi\nBased only on the submission wizard, what is the main screen which will\n/’ _ likely trigger an underwriting issue first?\n•\n•\nPre-Qualification is the screen that will likely trigger an underwriting issue first. Other\nissues may be triggered later. (All underwriting issues appear on the Risk Analysis\nScreen - UW Issues tab.)\nSop DD DD SDSS oe",
      "ocrWordCount": 61,
      "ocrConfidence": 84.63,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 26,
      "title": "Knowledge Check",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Question\nWhere do users specify modifiers?\n•\n•\nSoS oD DD DDS De Say",
      "ocrWordCount": 17,
      "ocrConfidence": 57.16,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question",
      "questionData": {
        "question": "Where do users specify modifiers?",
        "answer": "In the LOB-specific section. For example, the Commercial Auto line has a dedicated\nmodifier page."
      }
    },
    {
      "slideNumber": 27,
      "title": "Answer",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Answer\n•\n•\n•\nSop DD DD SDSS oe\nWhere do users specify modifiers?\nIn the LOB-specific section. For example, the Commercial Auto line has a dedicated\nmodifier page.",
      "ocrWordCount": 30,
      "ocrConfidence": 77.38,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 28,
      "title": "Knowledge Check",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Question\nIn which screen does an underwriter review issues raised during the\n7’ submission process?\n•\n•\nSoS oD DD DDS De Say\nGi",
      "ocrWordCount": 24,
      "ocrConfidence": 67.38,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question",
      "questionData": {
        "question": "In which screen does an underwriter review issues raised during the submission process?",
        "answer": "Underwriters review the issues in the Risk Analysis screen, Underwriting Issues tab."
      }
    },
    {
      "slideNumber": 29,
      "title": "Answer",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Answer\n•\n•\n•\nSop DD DD SDSS oe\nIn which screen does an underwriter review issues raised during the\nsubmission process?\nUnderwriters review the issues in the Risk Analysis screen, Underwriting Issues tab.\nGi",
      "ocrWordCount": 36,
      "ocrConfidence": 79.34,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 30,
      "title": "Question",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Question G\nWhat conditions trigger asynchronous quoting?\n•\n•\nAsynchronous quoting must be enabled in the PolicyCenter installation\nWhen the number of coverables exceeds the threshold\nIf the current line of business supports asynchronous quoting\nA, B, and C\nAandC\nmoo 8 >\nSoS oD DD DDS De Say",
      "ocrWordCount": 52,
      "ocrConfidence": 78.45,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question",
      "questionData": {
        "question": "What conditions trigger asynchronous quoting?\nAsynchronous quoting must be enabled in the PolicyCenter installation\nWhen the number of coverables exceeds the threshold\nIf the current line of business supports asynchronous quoting\nA, B, and C\nA and C",
        "answer": "Correct answer: D"
      }
    },
    {
      "slideNumber": 31,
      "title": "Answer",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Answer Gi\nWhat conditions trigger asynchronous quoting?\n•\n•\n•\nAsynchronous quoting must be enabled in the PolicyCenter installation\nWhen the number of coverables exceeds the threshold\nIf the current line of business supports asynchronous quoting\nA, B, and C\nAandC\nmoom >\nCorrect answer: D\nSop DD DD SDSS oe",
      "ocrWordCount": 53,
      "ocrConfidence": 81.28,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 32,
      "title": "Knowledge Check",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Question\nIn the base configuration, for which line of business is two-step quoting\nenabled?\n• A.\nSoS oD DD DDS De Say\nCommercial property\nB. Commercial auto\nC.\nD\nE\nBusinessowners\n. General liability\n. Allofthem\nGi",
      "ocrWordCount": 39,
      "ocrConfidence": 78.22,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question",
      "questionData": {
        "question": "In the base configuration, for which line of business is two-step quoting enabled?\nA. Commercial property\nB. Commercial auto\nC. Businessowners\nD. General liability\nE. All of them",
        "answer": "A. Commercial property"
      }
    },
    {
      "slideNumber": 33,
      "title": "Answer",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Answer\nSop DD DD SDSS oe\nIn the base configuration, for which line of business is two-step quoting\nenabled?\nCommercial property\nCommercial auto\nBusinessowners\nGeneral liability\nAll of them\nmoom >\nCorrect answer: A\nGi",
      "ocrWordCount": 36,
      "ocrConfidence": 84.05,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 34,
      "title": "Key Takeaways",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Lesson\nobjectives\nreview\n\n• Explain how the submission process works\n\nDescribe how submissions vary across lines\nof business\n\nCreate full application submissions\n\nBind and issue a policy\n\nDescribe asynchronous quoting and two-step\nquoting",
      "ocrWordCount": 33,
      "ocrConfidence": 95.84,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "objectives_review"
    },
    {
      "slideNumber": 35,
      "title": "Student Exercise",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "| Student exercise\n\nFull Application Submission —\nCreating a full application submission",
      "ocrWordCount": 12,
      "ocrConfidence": 95.0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "exercise"
    }
  ],
  "videos": [
    {
      "index": 1,
      "filename": "In_policy_06_01.mp4",
      "path": "/academy/guidewire/videos/ch04/In_policy_06_01.mp4"
    },
    {
      "index": 2,
      "filename": "In_policy_06_02.mp4",
      "path": "/academy/guidewire/videos/ch04/In_policy_06_02.mp4"
    },
    {
      "index": 3,
      "filename": "In_policy_06_03.mp4",
      "path": "/academy/guidewire/videos/ch04/In_policy_06_03.mp4"
    },
    {
      "index": 4,
      "filename": "In_policy_06_04.mp4",
      "path": "/academy/guidewire/videos/ch04/In_policy_06_04.mp4"
    },
    {
      "index": 5,
      "filename": "In_policy_06_05.mp4",
      "path": "/academy/guidewire/videos/ch04/In_policy_06_05.mp4"
    }
  ],
  "hasNotes": true,
  "hasTables": false,
  "hasImages": true,
  "ocrMetadata": {
    "totalWords": 1080,
    "avgConfidence": 87.2,
    "extractedAt": "2026-02-13T12:04:04.052234"
  }
}
