{
  "lessonId": "ch04-l06",
  "chapterId": 4,
  "chapterSlug": "ch04",
  "lessonNumber": 6,
  "title": "Policy Tools",
  "sourceFile": "In_policy_07_ Policy Tools.pptx",
  "sourceFolder": "In_policy_06",
  "totalSlides": 15,
  "estimatedMinutes": 45,
  "slides": [
    {
      "slideNumber": 1,
      "title": "Welcome to Policy Tools",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Introduction to Policy Tools in PolicyCenter.",
      "narration": "Welcome to our exploration of Policy Tools in Guidewire PolicyCenter. This lesson will delve into the suite of tools available to manage and analyze policy files effectively. As a PolicyCenter developer, understanding these tools is crucial for customizing and optimizing policy management workflows. We're setting the stage for a deeper dive into how these tools interact with the PolicyCenter data model and user interface.",
      "ocrText": "Policy Tools",
      "ocrWordCount": 2,
      "ocrConfidence": 95.5,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "title"
    },
    {
      "slideNumber": 2,
      "title": "Overview of Policy Tools",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "An overview of the functionalities provided by Policy Tools.",
      "narration": "Policy Tools in PolicyCenter offers a comprehensive suite for accessing key policy file details. From viewing policy summaries to managing financial transactions, these tools are designed to streamline policy management. As we go through each tool, consider how they integrate with PolicyCenter's core entities and processes, enhancing both user experience and data accuracy.",
      "ocrText": "Lesson\nobjectives\n\n¢ Describe the purpose of the Policy Tools\n\n* Give examples of how Policy Tools can\nprovide assistance resolving business\nproblems",
      "ocrWordCount": 23,
      "ocrConfidence": 89.39,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "objectives"
    },
    {
      "slideNumber": 3,
      "title": "Key Functional Areas",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Highlight the key areas covered by Policy Tools.",
      "narration": "The key functional areas within Policy Tools include policy summaries, billing information, contact management, and risk analysis, among others. Each of these areas interacts with specific entities and data relationships within PolicyCenter. As we explore these functionalities, think about how you can leverage these tools to improve policy handling and decision-making processes in your implementations.",
      "ocrText": "Simone\n\nAgent\n\n| might want to view the notes or a policy’s\ngeneral history in order to better assist a\ncustomer. Where can | find those details about a\n\npolicy?",
      "ocrWordCount": 30,
      "ocrConfidence": 94.03,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 4,
      "title": "Detailed Look at Policy Tools",
      "bodyParagraphs": [],
      "originalNotes": "Policy tools\nThe Policy Tools provides access to many Policy File details.\n\nSummary provides concise information about the entire Policy File. The screen includes information about current activities, completed andpending policy transactions.\nBilling allows you to view the overall balance orbalances for individual policy periods.\nContacts screen lists all of the contacts associated with a policy. For each contact, you can view basic contact information and the role the contact plays on the policy.\nParticipants screen lists the users interacting withthe policy by the role thatthey perform on the policy. In addition, the assigned group that the user belongs to is shown . You can add, remove, or change participants.\nPolicy transaction displays summary information about all policy transactions that have occurred on the policy. This list includes jobs that have modified the policy, as well as jobs that are in-progress, withdrawn, not taken or non-renewed. \nNotes screen allows you to search and review notes related to the policy transaction or policy.\nDocuments screen allows you to search and view any attached documents related to the policy transaction or policy.\nRisk Analysis displays issues that may affect the policy. Underwriting issues, which are notesabout an issue relevant to the creation or renewal of a policy, may cause the carrier to deny the policy or raise the premium- It also displays claims, prior policies, prior losses, or contingencies.\nReinsurance is insurance risk transferred to another insurance company for all or part of an assumed liability.\nHistory allows you to search and view historical events pertaining to the policy.\nFinancial Transactions screen is an internal tool used for rating while developing the application. Users with the internaltools permission\n     can access this screen.",
      "notes": "Policy tools\nThe Policy Tools provides access to many Policy File details.\n\nSummary provides concise information about the entire Policy File. The screen includes information about current activities, completed andpending policy transactions.\nBilling allows you to view the overall balance orbalances for individual policy periods.\nContacts screen lists all of the contacts associated with a policy. For each contact, you can view basic contact information and the role the contact plays on the policy.\nParticipants screen lists the users interacting withthe policy by the role thatthey perform on the policy. In addition, the assigned group that the user belongs to is shown . You can add, remove, or change participants.\nPolicy transaction displays summary information about all policy transactions that have occurred on the policy. This list includes jobs that have modified the policy, as well as jobs that are in-progress, withdrawn, not taken or non-renewed. \nNotes screen allows you to search and review notes related to the policy transaction or policy.\nDocuments screen allows you to search and view any attached documents related to the policy transaction or policy.\nRisk Analysis displays issues that may affect the policy. Underwriting issues, which are notesabout an issue relevant to the creation or renewal of a policy, may cause the carrier to deny the policy or raise the premium- It also displays claims, prior policies, prior losses, or contingencies.\nReinsurance is insurance risk transferred to another insurance company for all or part of an assumed liability.\nHistory allows you to search and view historical events pertaining to the policy.\nFinancial Transactions screen is an internal tool used for rating while developing the application. Users with the internaltools permission\n     can access this screen.",
      "narration": "The Policy Tools provide a granular view of the policy file, offering sections like Summary, Billing, Contacts, and Participants. For example, the Contacts screen displays associated entities and their roles, crucial for maintaining accurate party relationships. The Risk Analysis section is particularly important for underwriting, as it flags issues that could impact policy decisions. Understanding how these tools map to PolicyCenter's data model entities such as 'Policy', 'Contact', and 'Activity' can guide your customization efforts.",
      "ocrText": "] Policy tools G\n\n'\nFinancial\nTransactions\n\n(29>\n\nPolicy Transaction Reinsurance\n\nBilling Participants Documents Risk Analysis History\n\n3. ODS de\n\nse\nNS",
      "ocrWordCount": 22,
      "ocrConfidence": 78.33,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 5,
      "title": "Billing and Financial Transactions",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Focus on billing information and financial transactions.",
      "narration": "Billing and Financial Transactions sections are critical for managing the monetary aspects of policies. These tools allow users to view balances, financial histories, and transaction details, interfacing with PolicyCenter's billing entities. This integration ensures seamless financial operations and accurate record-keeping, which are pivotal for policy management and customer satisfaction.",
      "ocrText": "| Policy Tools menu\n\nactions\n\nCA pPolicy File {FP eusinessowners WrightConstruction Account # 000212105 Policy # 4261479065 _ In Force (Exp. 05/08/2019)\n\nPolicy Summary: 4261479065\n\nPolicy Number 4261479065 Effective Date ‘Account Name\n35 /08/2 Wright Construction\nproduct 05/08/2018 a\nBusinessowners Expiration Date ‘Account Number\n05/08/2019 co00212105\noffering\nTerm Number 2 Business Address\nPrimary Named Insured ‘846 Yount Ln.\nWright Construction First issued Date Floor 0000\n. Developer Unit Habitation Cube #0000\nUnderwriter Bruce Baker 8/08/2088 Hollywood, CA 91357\nUnderwriting Company In Force Premium\n‘Acme Low Hazard Insurance $56,530.00\nIn Force Policy Count 3\n\nOpen Claims Count °\nTerm Financials\n\nalculate Loss\n\n7 Notes New Note\n\nPremium",
      "ocrWordCount": 106,
      "ocrConfidence": 78.57,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 6,
      "title": "Demonstration: Navigating Policy Tools",
      "bodyParagraphs": [],
      "originalNotes": "Demonstration\nThe Tools menu provides an easy way to get to several important pieces of supporting information for a policy file.\n\nTake a look at the Tools menu for an In Force policy.",
      "notes": "Demonstration\nThe Tools menu provides an easy way to get to several important pieces of supporting information for a policy file.\n\nTake a look at the Tools menu for an In Force policy.",
      "narration": "In this demonstration, observe how to efficiently navigate the Tools menu for an In Force policy. Pay attention to how the menu organizes access to different policy details and supporting information. This structure is designed to streamline the user experience, reducing the time needed to retrieve and analyze policy data.",
      "ocrText": "| Demonstration G\n\nPolicy Tools\n\nclick here\n\nNote: The demonstration opens a new tab in your browser. When the demonstration ends, the\noriginal course launch window appears. Return to this window to continue this presentation.",
      "ocrWordCount": 35,
      "ocrConfidence": 95.43,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_instruction"
    },
    {
      "slideNumber": 7,
      "title": "Contacts and Participants",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Understanding the role of Contacts and Participants in policy management.",
      "narration": "Managing Contacts and Participants is integral to maintaining accurate policy records. The Contacts section outlines the roles and relationships of entities involved with the policy. Meanwhile, Participants highlight the users and groups interacting with the policy, offering insights into role-based access and permissions. These components are vital for ensuring data integrity and security within PolicyCenter.",
      "ocrText": "",
      "ocrWordCount": 0,
      "ocrConfidence": 0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_video"
    },
    {
      "slideNumber": 8,
      "title": "Policy Transactions Overview",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Explore the summary information about all policy transactions.",
      "narration": "The Policy Transactions section provides a summary of all activities that have modified the policy, including jobs that are in-progress, withdrawn, or completed. This area is crucial for tracking policy lifecycle changes and understanding how each transaction impacts the overall policy status. As a developer, consider how transaction data can be leveraged for reporting and analytics purposes.",
      "ocrText": "Question\n\n_~ — What is the main purpose of “Tools” in PolicyCenter?\n\n4\n¢\n¢\n\nSoS oD DD DDS De Say",
      "ocrWordCount": 21,
      "ocrConfidence": 61.13,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question"
    },
    {
      "slideNumber": 9,
      "title": "Risk Analysis and Reinsurance",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Delve into Risk Analysis and Reinsurance functionalities.",
      "narration": "Risk Analysis and Reinsurance tools are pivotal for assessing policy risks and managing liability. Risk Analysis identifies underwriting issues and historical claims that could affect policy renewals or premiums. Reinsurance, on the other hand, allows for the transfer of insurance risk, offering additional layers of financial protection. Both these tools are essential for comprehensive risk management and strategic decision-making.",
      "ocrText": "Answer\n\nae What is the main purpose of “Tools” in PolicyCenter?\n\n¢\n¢\n\nThe Tools menu provides an easy way to obtain several important pieces of\nsupporting information for a policy file.\n\nSop DD DD SDSS oe",
      "ocrWordCount": 37,
      "ocrConfidence": 82.13,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 10,
      "title": "Historical Events and Notes",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Historical events and notes provide insights into policy history.",
      "narration": "The History and Notes sections offer critical insights into past policy events and communications. These tools are invaluable for understanding the policy's evolution, decisions made, and any noted issues. This historical context aids in making informed decisions about future policy actions and adjustments, emphasizing the importance of detailed record-keeping in PolicyCenter.",
      "ocrText": "Question\n\n,~ — Where in the Tools would you be able to access the record of a\n¢ PolicyCenter user’s thinking or strategy when working on a policy?\n\n¢\n\nSoS oD DD DDS De Say",
      "ocrWordCount": 35,
      "ocrConfidence": 78.08,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question"
    },
    {
      "slideNumber": 11,
      "title": "Documents Management",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Manage documents attached to policy transactions.",
      "narration": "Document management is a key feature within Policy Tools, allowing users to search and view documents related to policy transactions. This functionality ensures all necessary documentation is easily accessible and organized, which is crucial for compliance and audit purposes. As a developer, consider how you might enhance document workflows to improve efficiency and accessibility.",
      "ocrText": "Answer\n\n,~ — Where in the Tools would you be able to access the record of a\n¢ PolicyCenter user’s thinking or strategy when working on a policy?\n\n¢\n\nNotes\n\nSop DD DD SDSS oe",
      "ocrWordCount": 35,
      "ocrConfidence": 80.69,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 12,
      "title": "Internal Tools for Developers",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Financial Transactions screen is an internal tool used for rating during development.",
      "narration": "The Financial Transactions screen is a specialized tool primarily used during development for rating purposes. Accessible with the appropriate permissions, it offers developers insights into the financial aspects of policies. This tool can be leveraged to test and refine rating algorithms and ensure they align with business requirements.",
      "ocrText": "Question\n\n,~ — Which Tools option provides a way to access electronic or physical files\n\nx that are associated with a policy, but are not necessarily part of the\n: contract?\n\nSoS oD DD DDS De Say\n\nGi",
      "ocrWordCount": 38,
      "ocrConfidence": 78.79,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question"
    },
    {
      "slideNumber": 13,
      "title": "Practical Implementation of Policy Tools",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Consider practical scenarios for implementing Policy Tools.",
      "narration": "When implementing Policy Tools, it's essential to consider practical scenarios such as optimizing user workflows, enhancing data accuracy, and integrating with other systems. Think about how these tools can be customized to meet specific business needs, whether through configuration or code. The goal is to create a seamless and efficient user experience that supports business objectives.",
      "ocrText": "Answer\n\n,~ — Which Tools option provides a way to access electronic or physical files\nx that are associated with a policy, but are not necessarily part of the\n? contract?\n\nDocuments. Note that Documents are not the same as Forms.\n\nSop DD DD SDSS oe\n\nGi",
      "ocrWordCount": 47,
      "ocrConfidence": 84.12,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 14,
      "title": "Best Practices for Customization",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Discuss best practices for customizing Policy Tools.",
      "narration": "Customizing Policy Tools requires a solid understanding of Guidewire's data model and configuration points. Best practices include maintaining consistency with out-of-the-box functionality, ensuring customizations are scalable, and thoroughly testing changes. These practices help maintain system integrity and ensure long-term sustainability and ease of upgrades.",
      "ocrText": "Lesson\nobjectives ¢ Describe the purpose of the Policy Tools\n\nreview * Give examples of how Policy Tools can\nprovide assistance resolving business\n\nproblems",
      "ocrWordCount": 24,
      "ocrConfidence": 89.62,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "objectives_review"
    },
    {
      "slideNumber": 15,
      "title": "What's Next: Policy Changes and Preemption",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Summary and preview of the next lesson on Policy Changes and Preemption.",
      "narration": "We've covered the essentials of Policy Tools and their role in managing policy files effectively. In our next lesson, we'll explore Policy Changes and Preemption, diving into the mechanisms for handling policy modifications and conflicts. This will build on your understanding of Policy Tools, providing you with a comprehensive toolkit for managing policy lifecycles in PolicyCenter.",
      "ocrText": "| Student exercise\n\nPolicy Tools",
      "ocrWordCount": 5,
      "ocrConfidence": 95.83,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "exercise"
    }
  ],
  "videos": [
    {
      "index": 1,
      "filename": "In_Policy_07_01.mp4",
      "path": "/academy/guidewire/videos/ch04/In_Policy_07_01.mp4"
    }
  ],
  "hasNotes": true,
  "hasTables": false,
  "hasImages": true,
  "ocrMetadata": {
    "totalWords": 460,
    "avgConfidence": 84.4,
    "extractedAt": "2026-02-13T12:04:10.079779"
  }
}