{
  "lessonId": "ch04-l01",
  "chapterId": 4,
  "chapterSlug": "ch04",
  "lessonNumber": 1,
  "title": "Accounts",
  "sourceFile": "PC_Intro_01_Accounts.pptx",
  "sourceFolder": "In_policy_01",
  "totalSlides": 23,
  "estimatedMinutes": 69,
  "slides": [
    {
      "slideNumber": 1,
      "title": "PolicyCenter Introduction: Accounts",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Title slide for PolicyCenter Introduction, Lesson 1: Accounts. This lesson covers the fundamentals of account management in Guidewire PolicyCenter, including account creation, name clearance, producer codes, and the Account Summary Dashboard.",
      "narration": "Welcome to PolicyCenter Introduction. This is Lesson 1, and we're starting with one of the most fundamental concepts you'll work with as a Guidewire developer: Accounts. Accounts are the cornerstone of the PolicyCenter data model. Everything starts here, from quoting to binding policies, managing renewals, and tracking customer relationships. By the end of this lesson, you'll understand how accounts relate to policies, how name clearance works, and how to navigate the Account Summary Dashboard. Let's get started.",
      "ocrText": "Accounts",
      "ocrWordCount": 1,
      "ocrConfidence": 95.33,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "title"
    },
    {
      "slideNumber": 2,
      "title": "Learning Objectives",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Learning objectives for this lesson: Understand the purpose of accounts in PolicyCenter, distinguish between person and company accounts, explain the account-to-policy relationship, describe the name clearance process, identify producer codes and organizations, and navigate the Account Summary Dashboard.",
      "narration": "Here are our learning objectives for this lesson. By the end, you should be able to explain the purpose of accounts in PolicyCenter and why they exist separately from policies. You'll understand the difference between person and company accounts, how accounts relate to policies through the insured relationship, and how the name clearance process prevents duplicate accounts. We'll also cover producer codes and organizations, and you'll get hands-on with the Account Summary Dashboard. These are foundational concepts that will come up repeatedly throughout your Guidewire career.",
      "ocrText": "Lesson\nobjectives\n\n* Define an Account as it is used in\nPolicyCenter\n\n¢ Explain who can have an Account in\nPolicyCenter\n\n* Describe how accounts and policies relate to\neach other",
      "ocrWordCount": 31,
      "ocrConfidence": 88.42,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "objectives"
    },
    {
      "slideNumber": 3,
      "title": "What is an Account?",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "An account in PolicyCenter represents a customer relationship. It is the top-level entity that groups together all policies, contacts, activities, and documents associated with a particular customer. Think of it as the container for everything related to a single customer or business.",
      "narration": "So what exactly is an account in PolicyCenter? Think of an account as the container for an entire customer relationship. It's the top-level entity in the data model that groups together everything about a customer: their policies, contacts, activities, documents, and billing information. This separation between the account and individual policies is a deliberate design decision. It gives insurers the flexibility to manage the customer relationship holistically, rather than on a policy-by-policy basis. As a developer, understanding this distinction is critical because it impacts how you query data, build UI components, and implement business logic.",
      "ocrText": "Tanya\nCustomer\nService\nRepresentative\n\n~\n\nGi\n\nWhen a customer calls, | need to determine details\n\nabout their policy, but | am confused about what an\nAccount has to do with their policies.\n\nWhat is the purpose of an Account in PolicyCenter?\nWho can hold an Account in PolicyCenter?",
      "ocrWordCount": 48,
      "ocrConfidence": 92.27,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 4,
      "title": "Accounts vs. Policies",
      "bodyParagraphs": [],
      "originalNotes": "Accounts provide the ability to keep customer information separate from policies. An account gives PolicyCenter users the flexibility to create and manage a customer's account independent of any policies that may be associated with the account. The ability to manage an account separately from a policy is useful when providing both policies and accounts visibility to different types of users.",
      "notes": "Accounts provide the ability to keep customer information separate from policies. An account gives PolicyCenter users the flexibility to create and manage a customer's account independent of any policies that may be associated with the account. The ability to manage an account separately from a policy is useful when providing both policies and accounts visibility to different types of users.",
      "narration": "This is a key architectural concept. Accounts and policies are separate entities in the data model, and that's intentional. An account represents the customer, while a policy represents a specific insurance contract. By keeping them separate, PolicyCenter gives users the flexibility to manage customer information independently of any specific policy. Think about why this matters in practice: a customer service rep might need to update a customer's address, and that change should propagate to all their policies. Or an underwriter might need to see all policies under one commercial account to assess overall risk. This separation also enables different permission models. You can give certain users access to account-level data without exposing specific policy details, or vice versa.",
      "ocrText": "| Accounts G\n\nPolicyCenter organizes policies using Accounts [p=\n\nAccount Policies",
      "ocrWordCount": 11,
      "ocrConfidence": 90.91,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 5,
      "title": "Account Holder Types",
      "bodyParagraphs": [],
      "originalNotes": "A person or a company may be an account holder.",
      "notes": "A person or a company may be an account holder. Person accounts represent individual customers, while company accounts represent business entities. The account holder type determines which fields are available and how the account is displayed throughout the application.",
      "narration": "An account holder can be either a person or a company. This is a fundamental distinction in the data model. A person account represents an individual customer, such as someone buying a personal auto or homeowner's policy. A company account represents a business entity, like a construction firm or a retail chain. The account holder type matters because it determines the fields available on the account. A person account has fields like first name, last name, and date of birth. A company account has fields like company name, FEIN, and industry code. From a developer perspective, you'll encounter this distinction in the entity model, the UI configuration, and validation rules. The underlying entity uses subtypes to handle this polymorphism.",
      "ocrText": "| Accounts\n\nWho can have an account?\n\nAccount\n\nPerson\n\nCompany",
      "ocrWordCount": 10,
      "ocrConfidence": 93.09,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 6,
      "title": "Multiple Accounts per Contact",
      "bodyParagraphs": [],
      "originalNotes": "Different accounts have different purposes. A single contact may hold multiple accounts.",
      "notes": "Different accounts have different purposes. A single contact may hold multiple accounts. For example, an individual might have a personal auto account and a separate commercial account for their small business. Each account serves a distinct purpose and may be managed by different producers.",
      "narration": "Here's something that often surprises new developers: a single contact can hold multiple accounts. Different accounts serve different purposes. For example, imagine John Smith. He might have a personal auto account managed by his local State Farm agent, and a separate commercial account for his landscaping business managed by a commercial lines broker. Each account can have its own producer, its own set of policies, and its own billing arrangements. This many-to-one relationship between accounts and contacts is important to understand when you're building search functionality or reporting. You need to be aware that finding a contact doesn't mean you've found all their accounts, and vice versa.",
      "ocrText": "| Accounts - People G\n\nOne person may\ne e e be associated with\nmultiple accounts\n\nBusiness Accounts\n\nPersonal Account e099 CC)\n\nu",
      "ocrWordCount": 23,
      "ocrConfidence": 78.09,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 7,
      "title": "Account-to-Policy Relationship",
      "bodyParagraphs": [],
      "originalNotes": "An account can have zero, one or many associated policies. An account with at least one policy is referred to as •the insured\". An account may have many separate, distinct \"insureds“ aggregated within it as a related account. For example, General Motors could be an account with separate insureds (Chevy, Buick, GMC, and Pontiac) and separate policies for each insured. However, a policy can belong to only one account.",
      "notes": "An account can have zero, one or many associated policies. An account with at least one policy is referred to as \"the insured\". An account may have many separate, distinct \"insureds\" aggregated within it as a related account. For example, General Motors could be an account with separate insureds (Chevy, Buick, GMC, and Pontiac) and separate policies for each insured. However, a policy can belong to only one account.",
      "narration": "Let's look at how accounts and policies relate to each other. An account can have zero, one, or many associated policies. An account with no policies is perfectly valid. Maybe a quote was started but never bound, or the customer is in the process of being set up. Once an account has at least one active policy, the account holder is referred to as the insured. Now here's where it gets interesting for commercial lines. An account can contain multiple distinct insureds as related accounts. Take General Motors as an example. GM could be the parent account, with separate insureds for Chevy, Buick, GMC, and Pontiac, each with their own policies. However, and this is important, a policy can belong to only one account. It's a many-to-one relationship: many policies to one account, never the reverse.",
      "ocrText": "| Accounts - Policies\n\nAccounts can have zero, one, or many\nassociated policies\n\nAccount\n\nS\n\nPolicies",
      "ocrWordCount": 16,
      "ocrConfidence": 89.17,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 8,
      "title": "Name Clearance",
      "bodyParagraphs": [],
      "originalNotes": "When you try to create a new account in PolicyCenter, the application will search for a pre- existing account first by checking the name against one or more producer or account databases. PolicyCenter goes through name clearance to ensure that a person or company is not already an existing account, and that another producer does not represent them for the given policy type.\n\nName clearance is a relevant issue when the same account requests quotes or policies at different times while providing slightly different names(such as a company known as \"Demo Deliveries\", \"Demo Deliveries Inc.\", and \"Demo Delivers\"). PolicyCenter executes name clearance to determine if the named account exists. Based on the customer's business need, the end user can choose an existing account (if found) or create a new account.",
      "notes": "When you try to create a new account in PolicyCenter, the application will search for a pre-existing account first by checking the name against one or more producer or account databases. PolicyCenter goes through name clearance to ensure that a person or company is not already an existing account, and that another producer does not represent them for the given policy type.\n\nName clearance is a relevant issue when the same account requests quotes or policies at different times while providing slightly different names (such as a company known as \"Demo Deliveries\", \"Demo Deliveries Inc.\", and \"Demo Delivers\"). PolicyCenter executes name clearance to determine if the named account exists. Based on the customer's business need, the end user can choose an existing account (if found) or create a new account.",
      "narration": "Name clearance is one of the most important processes in account management, and it's something you'll likely need to customize as a developer. When a user tries to create a new account, PolicyCenter doesn't just create it immediately. It first searches for pre-existing accounts by checking the name against producer and account databases. This prevents duplicates. Think about why this matters. The same customer might request quotes at different times with slightly different names. A company known as Demo Deliveries might also be entered as Demo Deliveries Inc. or even Demo Delivers. Name clearance catches these variations and presents potential matches to the user. The user then decides whether to use an existing account or create a new one. From a configuration standpoint, you can customize the name clearance search criteria, the matching algorithm, and the UI that presents results. This is a common customization point for implementations.",
      "ocrText": "| Accounts - Creating\n\nAccount\n\nPolicyCenter executes name clearance\nto determine if an account already exists",
      "ocrWordCount": 16,
      "ocrConfidence": 93.47,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 9,
      "title": "Organizations and Producer Codes",
      "bodyParagraphs": [],
      "originalNotes": "When creating an account in PolicyCenter, you will need to provide an organization and a producer code. A producer is a generic term for a third party bringing business to the insurer. An organization is the group that a producer belongs to, and a producer code is a unique identifier assigned to the producer responsible for a policy or account. By including this information during account creation, the insurer can track the agent and agency that originally opened the account.\n\nSometimes, producers can pre- qualify an applicant. In PolicyCenter, producers are specified in the account information using a producer code, which is entered when creating the account. You can learn more about organizations and producers in the PolicyCenter Community Model Refer to the lesson, \"Users, Groups, and Organizations\".",
      "notes": "When creating an account in PolicyCenter, you will need to provide an organization and a producer code. A producer is a generic term for a third party bringing business to the insurer. An organization is the group that a producer belongs to, and a producer code is a unique identifier assigned to the producer responsible for a policy or account. By including this information during account creation, the insurer can track the agent and agency that originally opened the account.\n\nSometimes, producers can pre-qualify an applicant. In PolicyCenter, producers are specified in the account information using a producer code, which is entered when creating the account. You can learn more about organizations and producers in the PolicyCenter Community Model. Refer to the lesson, \"Users, Groups, and Organizations\".",
      "narration": "When creating an account, you must provide an organization and a producer code. Let me break these down. A producer is a generic term for any third party that brings business to the insurer, typically an insurance agent or broker. An organization is the group that producer belongs to, like an agency or brokerage firm. And a producer code is the unique identifier assigned to that specific producer. This information is captured at account creation so the insurer can always track which agent and agency originated the business. This drives commission calculations, book-of-business reporting, and producer management workflows. As a developer, you'll work with the producer model extensively. Producers can also pre-qualify applicants in certain configurations. We'll dive deeper into organizations and producer codes in a later lesson on Users, Groups, and Organizations, but for now, just understand that every account is linked to a producer.",
      "ocrText": "| Accounts - Producers\n\nInsurer\n\nProducer\n\nA third party who brings\nbusiness to the insurer\n\nInsured",
      "ocrWordCount": 16,
      "ocrConfidence": 93.89,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 10,
      "title": "Supporting Account Information",
      "bodyParagraphs": [],
      "originalNotes": "PolicyCenter provides a wide range of supporting information about the Account. This slide shows several, but not all, of the types of supporting Account\ninformation.",
      "notes": "PolicyCenter provides a wide range of supporting information about the Account. This slide shows several, but not all, of the types of supporting Account information. This includes contacts, locations, activities, notes, documents, billing summaries, claims history, and policy transaction history.",
      "narration": "PolicyCenter provides a rich set of supporting information for each account, and as you can see on this slide, there's quite a lot. Beyond the basic account details, you'll find contacts associated with the account, locations, activities that need attention, notes from underwriters and service reps, attached documents, billing summaries, claims history, and a full policy transaction history. Each of these represents a tab or section in the Account workspace. From a developer perspective, this supporting information is loaded through the account's entity graph, and you'll often need to configure which sections appear, what data they display, and how they're ordered. We'll explore each of these in more detail throughout this chapter.",
      "ocrText": "| Supporting Information\n\nLocations Participants Transac tions\n\nManager",
      "ocrWordCount": 8,
      "ocrConfidence": 83.0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 11,
      "title": "Account Summary Dashboard",
      "bodyParagraphs": [],
      "originalNotes": "The Account Summary Dashboard provides several information panels that are important to customer service representatives, agents, and underwriters in addition to other insurance personnel. The Account Summary provides details about the account holder, a general overview of the account, billing details, current activities, and a list of all policies for the account Policy transactions, claims, related accounts, producers and locations are also on the Account Summary page.\n.\nThe Billing section graphic shows aggregated information for accounts that are stored in the billing system. Information related to the next invoice and the last payment is also displayed per account.",
      "notes": "The Account Summary Dashboard provides several information panels that are important to customer service representatives, agents, and underwriters in addition to other insurance personnel. The Account Summary provides details about the account holder, a general overview of the account, billing details, current activities, and a list of all policies for the account. Policy transactions, claims, related accounts, producers and locations are also on the Account Summary page.\n\nThe Billing section graphic shows aggregated information for accounts that are stored in the billing system. Information related to the next invoice and the last payment is also displayed per account.",
      "narration": "The Account Summary Dashboard is the central hub for account management. This is typically the first screen users see when they open an account, and it's designed to give a complete picture at a glance. The dashboard includes panels for account holder details, a general overview, billing information, current activities, and a list of all associated policies. You'll also find policy transactions, claims history, related accounts, producer information, and locations. Pay attention to the Billing section. It shows aggregated billing data pulled from BillingCenter through the integration layer. You'll see the next invoice date, the last payment received, and the overall billing status. This integration between PolicyCenter and BillingCenter is something you'll work with frequently in real implementations.",
      "ocrText": "| Account Summary Dashboard\n\nACTIONS\n\nAccount Summary: Ray Newton\n\nDetails CD\ney Newton ffi\nAccount # oo21210s ssw\n\n- Developer Unit Habitation Cube\n\nHollywood, cA31357\n\nCurrent Activities\n\nDueDate Subject Priority Assigned\n\n1009/2017 Review Submision Normal Alice Applegate\n\n1/09/2018 Anew audithasbeenassigned Normal Ace Applegate\n\n06/0772018 Premiumreportoverdve Nawal Ale Applegate\naxysa0is Review Submision Normal Alice Applegate\n1/09p2018 Review Submission Normal Alice Applegate\n\nReinsurance +\n\nTeam > Administration HER oO\n\nPolicy\nase\n\nProduct\nWorkers’ Compensat\nWorkers’ Compensat.\nGeneral uabilty\nGeneral ability\n\nGeneral usb\n\n$77,676 $39,427 519\n\n201 years)\n\nbiting Fons |",
      "ocrWordCount": 88,
      "ocrConfidence": 60.36,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 12,
      "title": "Demo: Creating a New Account",
      "bodyParagraphs": [],
      "originalNotes": "Show learners how to create an account, begin at the Desktop, and select Actions -> New Account and continue down the path of creating an account for a new person with a Billing Address.",
      "notes": "Demonstration walkthrough: Creating a new account in PolicyCenter. Navigate to the Desktop, select Actions, then New Account. Follow the path of creating an account for a new person with a Billing Address. This demonstrates name clearance, account holder type selection, and basic account setup.",
      "narration": "Now let's walk through creating a new account step by step. We'll start from the PolicyCenter Desktop. From the top menu, select Actions, then New Account. This launches the account creation workflow. The first thing PolicyCenter does is prompt you for search criteria, and this is the name clearance process we just discussed. Enter the person's name, and PolicyCenter will search for existing matches. If no matches are found, or if you determine the matches aren't the same customer, you proceed to create a new account. You'll select the account holder type, in this case a person, and then fill in the basic information including name, address, and contact details.",
      "ocrText": "Demonstration\n| Gi\nCreating a new account\n\nclick here\n\nNote: The demonstration opens a new tab in your browser. When the demonstration ends, the\noriginal course launch window appears. Return to this window to continue this presentation.",
      "ocrWordCount": 37,
      "ocrConfidence": 94.19,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_instruction",
      "demoVideoIndex": 0
    },
    {
      "slideNumber": 13,
      "title": "",
      "bodyParagraphs": [],
      "originalNotes": "Show learners how to create an account, begin at the Desktop, and select Actions -> New Account and continue down the path of creating an account for a new person with a Billing Address.",
      "notes": "Show learners how to create an account, begin at the Desktop, and select Actions -> New Account and continue down the path of creating an account for a new person with a Billing Address.",
      "narration": "",
      "ocrText": "",
      "ocrWordCount": 0,
      "ocrConfidence": 0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_video"
    },
    {
      "slideNumber": 14,
      "title": "Demo: Account Creation Walkthrough",
      "bodyParagraphs": [],
      "originalNotes": "Show learners how to create an account, begin at the Desktop, and select Actions -> New Account and continue down the path of creating an account for a new person with a Billing Address.",
      "notes": "Embedded demonstration video showing a walkthrough of the account creation process in PolicyCenter, including form fields, name clearance results, and completing the new account setup.",
      "narration": "This short walkthrough shows the complete account creation flow from start to finish. Watch how the underwriter navigates through each step: entering the account holder's information, reviewing name clearance results, selecting the account type, and completing the setup. Pay attention to the required fields and how PolicyCenter validates the data at each step.",
      "ocrText": "",
      "ocrWordCount": 0,
      "ocrConfidence": 0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_video",
      "demoVideoIndex": 1
    },
    {
      "slideNumber": 15,
      "title": "Demo: Supporting Account Information",
      "bodyParagraphs": [],
      "originalNotes": "Search for the Wright Construction account and show students the supporting account information, including the sample data's information about Billing. Claims does not have sample data, so you will need to describe how that screen gets populated when PolicyCenter is integrated with ClaimsCenter.",
      "notes": "Demonstration: Search for the Wright Construction account and explore the supporting account information, including billing data from BillingCenter. When PolicyCenter is integrated with ClaimCenter, the claims section would also show relevant claims history.",
      "narration": "Now let's explore an existing account with more data. Search for the Wright Construction account in the sample data. Once you open it, take a look at the Account Summary Dashboard. You'll see the supporting information we discussed earlier, including billing data pulled from BillingCenter. The billing section shows aggregated payment and invoice information. If PolicyCenter were integrated with ClaimCenter in this environment, you'd also see claims history here. In a production implementation, this integration is standard, and the claims data flows through the integration layer automatically. Explore the different tabs and sections to get familiar with the layout.",
      "ocrText": "D trati\n| emonstration G\nSupporting Account Information\n\nclick here\n\nNote: The demonstration opens a new tab in your browser. When the demonstration ends, the\noriginal course launch window appears. Return to this window to continue this presentation.",
      "ocrWordCount": 38,
      "ocrConfidence": 94.0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_instruction",
      "demoVideoIndex": 2
    },
    {
      "slideNumber": 16,
      "title": "",
      "bodyParagraphs": [],
      "originalNotes": "Search for the Wright Construction account and show students the supporting account information, including the sample data's information about Billing. Claims does not have sample data, so you will need to describe how that screen gets populated when PolicyCenter is integrated with ClaimsCenter.",
      "notes": "Search for the Wright Construction account and show students the supporting account information, including the sample data's information about Billing. Claims does not have sample data, so you will need to describe how that screen gets populated when PolicyCenter is integrated with ClaimsCenter.",
      "narration": "",
      "ocrText": "",
      "ocrWordCount": 0,
      "ocrConfidence": 0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_video"
    },
    {
      "slideNumber": 17,
      "title": "Knowledge Check",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "PolicyCenter provides multiple ways to search for accounts. Users can search by account number, account holder name, phone number, or address. The search functionality supports partial matches and wildcard searches. Search results display key account information to help users identify the correct account.",
      "narration": "Let's talk about account search, which is another area you'll frequently customize. PolicyCenter provides multiple ways to find an account. You can search by account number, account holder name, phone number, or address. The search supports partial matches, so entering just a few characters of the name will return potential results. Search results display key information like the account name, number, status, and producer to help users quickly identify the right account. From a developer perspective, the search functionality is highly configurable. You can add custom search criteria, modify the result columns, and even implement custom search algorithms for specific business requirements.",
      "ocrText": "Question G\n\n_- — Whatis the purpose of an account?\n\n¢\n¢\n¢\n\n-S SS 55 555-555 -=5--—",
      "ocrWordCount": 18,
      "ocrConfidence": 72.07,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question",
      "questionData": {
        "question": "What is the purpose of an account?",
        "answer": "An account gives PolicyCenter users the flexibility to create and manage a customer's account independent of policies with which the account may be associated. The ability to manage an account separately from a policy can be useful when assigning policy and account visibility to different types of users.\n\nIn addition, PolicyCenter utilizes the name clearance function to ensure that a person or company is not an existing account and that they are not represented by another producer for the given policy type."
      }
    },
    {
      "slideNumber": 18,
      "title": "",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Answer G\n\n_- — Whatis the purpose of an account?\n\n4\n¢\n¢\n\nAn account gives PolicyCenter users the flexibility to create and manage a customer's\naccount independent of policies with which the account may be associated. The ability\nto manage an account separately from a policy can be useful when assigning policy\nand account visibility to different types of users.\n\nIn addition, PolicyCenter is utilizes the name clearance function to ensure that a\nperson or company is not an existing account and that they are not represented by\nanother producer for the given policy type.\n\n-S SS 55 555-55 --=5--—",
      "ocrWordCount": 101,
      "ocrConfidence": 90.69,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 19,
      "title": "Knowledge Check",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Locations on an account represent physical addresses associated with the customer. Locations are used for rating, territory determination, and policy-level address requirements. Account-level locations can be reused across multiple policies, ensuring consistency and reducing data entry.",
      "narration": "Locations are another important piece of the account puzzle. They represent the physical addresses associated with the customer, such as business premises, mailing addresses, or insured property locations. Locations serve several critical functions in PolicyCenter. They're used for rating calculations, territory determination, and meeting policy-level address requirements. A key design principle is that account-level locations can be reused across multiple policies under that account. So if a commercial customer has ten locations, you enter them once at the account level, and then reference them from each policy that needs them. This reduces data entry and ensures consistency. As a developer, you'll work with location entities when configuring coverages, building rating algorithms, and customizing the submission workflow.",
      "ocrText": "Question G\n\n,- — Howmany accounts can a policy be attached to?\n\n¢\n¢\n¢\n\n-S SS 55 555-555 -=5--—",
      "ocrWordCount": 20,
      "ocrConfidence": 75.76,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question",
      "questionData": {
        "question": "How many accounts can a policy be attached to?",
        "answer": "A policy can belong to only one account."
      }
    },
    {
      "slideNumber": 20,
      "title": "",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Answer Gi\n\n,- — Howmany accounts can a policy be attached to?\n\n4\n¢\n¢\n\nA policy can belong to only one account.\n\n-S SS 55 555-55 --=5--—",
      "ocrWordCount": 28,
      "ocrConfidence": 73.67,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 21,
      "title": "Key Takeaways",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Summary of key concepts covered in this lesson: accounts are separate from policies for flexibility, person and company account types use subtypes, one account maps to many policies (but not reverse), name clearance prevents duplicates, producer codes track business origination, and the Account Summary Dashboard is the central workspace.",
      "narration": "Let's recap the key takeaways from this lesson. First, accounts and policies are intentionally separate in the data model. This gives insurers flexibility to manage customer relationships independent of specific policies. Second, accounts come in two types, person and company, implemented through entity subtypes. Third, the account-to-policy relationship is one-to-many: one account can have many policies, but a policy belongs to only one account. Fourth, name clearance is the process that prevents duplicate accounts during creation. Fifth, producer codes link accounts to the agents and agencies that originated the business. And finally, the Account Summary Dashboard is the central workspace for managing all account information. These concepts form the foundation for everything else we'll learn in PolicyCenter.",
      "ocrText": "Lesson\nobjectives * Define an Account as it is used in\nreview PolicyCenter\n\n¢ Explain who can have an Account in\nPolicyCenter\n\n* Describe how accounts and policies relate to\neach other",
      "ocrWordCount": 32,
      "ocrConfidence": 88.62,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "objectives_review"
    },
    {
      "slideNumber": 22,
      "title": "Lab Environment Setup",
      "bodyParagraphs": [],
      "originalNotes": "Virtual Machine Instructions\ncontains a link and instructions to start your VM- Start the VM now  Once the VM has started, follow these steps to start the PolicyCenter application:\n\n1. Locate the PolicyCenter Shortcuts folder on the Desktop\n2. Open the PolicyCenter Shortcuts folder\n3. From the file list double- click on Start PolicyCenter This will open a command prompt window. Several messages related to PolicyCenter's startup appear in the window. When the steps are finished, you will see the following message in the command prompt window.\n******PolicyCenter\nready*\nLeave the command window open (minimize if needed)- It is easy to miss the \"ready“ message since PolicyCenter continues to process activities after displaying the notice. If you have waited three minutes or more without seeing the message, go to step 4 and open Chrome. The percentage will remain at 0%, it may be disregarded.\n4. Open Chrome from the bottom bar of the VM\n5. In the browser, connect to the following URL: http://localhost:8180/pc/PolicyCenter.do\n6. When you are finished working on training for the day, you must manually  top the application server.",
      "notes": "Virtual Machine Instructions: Contains a link and instructions to start your VM. Start the VM now. Once the VM has started, follow these steps to start the PolicyCenter application:\n\n1. Locate the PolicyCenter Shortcuts folder on the Desktop\n2. Open the PolicyCenter Shortcuts folder\n3. From the file list double-click on Start PolicyCenter. This will open a command prompt window. Several messages related to PolicyCenter's startup appear in the window. When the steps are finished, you will see the following message in the command prompt window: PolicyCenter ready.\nLeave the command window open (minimize if needed). It is easy to miss the ready message since PolicyCenter continues to process activities after displaying the notice. If you have waited three minutes or more without seeing the message, go to step 4 and open Chrome. The percentage will remain at 0%, it may be disregarded.\n4. Open Chrome from the bottom bar of the VM\n5. In the browser, connect to the following URL: http://localhost:8180/pc/PolicyCenter.do\n6. When you are finished working on training for the day, you must manually stop the application server.",
      "narration": "Now it's time to get hands-on. You should have access to a virtual machine with PolicyCenter pre-installed. Follow the instructions on this slide to start your lab environment. First, locate the PolicyCenter Shortcuts folder on your desktop and double-click Start PolicyCenter. A command prompt window will open with startup messages. Wait for the PolicyCenter ready message, which typically appears within two to three minutes. Once it's ready, open Chrome and navigate to localhost port 8180 slash pc slash PolicyCenter.do. Log in and try what we've covered today: search for existing accounts, explore the Wright Construction account, and create a new account from scratch. Getting comfortable navigating the Account workspace will prepare you for the next lesson on Policy Transactions.",
      "ocrText": "| Virtual Machine Instructions G\n\nA If you have access to a VM, start the PolicyCenter application in the VM now.\n4\n\nStart PolicyCenter\n— — - emule ***** PolicyCenter Ready ****\n\nOpen the PolicyCenter Before starting Allow the startup Look out for the message\nShortcuts folder on exercises, Start process to run. indicating that the\nthe Desktop. PolicyCenter application server is ready.\n\n— //ocalhost:8180/pc/PolicyCenter.do Tima\n\nConnect to the application URL. After finishing\nexercises, Stop\nPolicyCenter",
      "ocrWordCount": 76,
      "ocrConfidence": 87.21,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "vm_instructions"
    },
    {
      "slideNumber": 23,
      "title": "Student Exercise: Accounts",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "End of PolicyCenter Introduction, Lesson 1: Accounts. Next lesson: Policy Transactions.",
      "narration": "That wraps up Lesson 1 on Accounts. You now have a solid understanding of how accounts work in PolicyCenter, from the data model relationships to the practical workflows of creating and managing accounts. In our next lesson, we'll build on this foundation and dive into Policy Transactions, where you'll learn how submissions, quotes, and policy changes flow through the system. See you there.",
      "ocrText": "| Student exercise\n\nAccounts\n\n1. Searching for an Account\n2. Creating a new account\n\n3. Account related information",
      "ocrWordCount": 18,
      "ocrConfidence": 94.21,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "exercise"
    }
  ],
  "videos": [
    {
      "index": 1,
      "filename": "In_policy_01_01.mp4",
      "path": "/academy/guidewire/videos/ch04/In_policy_01_01.mp4"
    },
    {
      "index": 2,
      "filename": "PC_Intro_01_Accounts_01.mp4",
      "path": "/academy/guidewire/videos/ch04/PC_Intro_01_Accounts_01.mp4"
    },
    {
      "index": 3,
      "filename": "In_policy_01_02.mp4",
      "path": "/academy/guidewire/videos/ch04/In_policy_01_02.mp4"
    }
  ],
  "hasNotes": true,
  "hasTables": false,
  "hasImages": true,
  "ocrMetadata": {
    "totalWords": 636,
    "avgConfidence": 86.42,
    "extractedAt": "2026-02-13T12:03:10.781838"
  }
}