{
  "lessonId": "ch04-l23",
  "chapterId": 4,
  "chapterSlug": "ch04",
  "lessonNumber": 23,
  "title": "policy Holds and Underwriting referral Reasons",
  "sourceFile": "In_policy_24 policy Holds and Underwriting referral Reasons.pptx",
  "sourceFolder": "In_policy_23",
  "totalSlides": 17,
  "estimatedMinutes": 51,
  "slides": [
    {
      "slideNumber": 1,
      "title": "Introduction to Policy Holds and Underwriting Referral Reasons",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Introduction to the lesson focusing on policy holds and underwriting referral reasons in PolicyCenter.",
      "narration": "Welcome to this lesson on policy holds and underwriting referral reasons in PolicyCenter. As we dive into these concepts, we'll explore how they impact policy transactions and the underwriting process. Understanding these elements is crucial for managing policy workflows effectively. Let's get started by examining the function of policy holds in maintaining accurate coverage forms and rates.",
      "ocrText": "Policy Holds and Underwriting Referral Reasons",
      "ocrWordCount": 6,
      "ocrConfidence": 95.75,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "title"
    },
    {
      "slideNumber": 2,
      "title": "Understanding Policy Holds",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Policy holds overview with focus on the impact of state-level and nationwide changes.",
      "narration": "Policy holds are essential in ensuring that policy transactions align with the most current rates and coverage forms. Changes often occur at the state level but can also be nationwide when multiple states adopt the same regulations. Policy holds temporarily pause work to prevent transactions from proceeding with outdated information, safeguarding the accuracy and compliance of policies.",
      "ocrText": "Lesson\nobjectives\n\n• Explain and define the policy holds\n• Describe and work with the Underwriting\nReferral Reasons",
      "ocrWordCount": 18,
      "ocrConfidence": 89.0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "objectives"
    },
    {
      "slideNumber": 3,
      "title": "The Role of Policy Holds in Transactions",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Details on how policy holds block transactions and create underwriting issues.",
      "narration": "When a policy hold is in effect, all related policy transactions are blocked. PolicyCenter automatically generates an underwriting issue tied to the policy hold, signaling that the transaction cannot proceed. This mechanism ensures that any changes are thoroughly reviewed and approved before affecting the policy, maintaining the integrity of the underwriting process.",
      "ocrText": "Darren\nInsurance\nProduct Manager\n\n.\n\nq\n|\n\nThere are situations that require us to\nput customer policies on hold. Does\nPolicyCenter provide this capability?",
      "ocrWordCount": 24,
      "ocrConfidence": 94.42,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 4,
      "title": "Hold and Release a Transaction in PolicyCenter (Part 1)",
      "bodyParagraphs": [],
      "originalNotes": "Policy holds\nFor a business, coverage forms and rates are constantly changing. Changes are generally made at the state level by line of business. Although changes generally pertain to one state, sometimes changes occur on a nationwide level when numerous states adopt the same change simultaneously. Work is put on hold for a number of days before the effective date of the change to ensure that work is not started with incorrect rates or forms.",
      "notes": "Policy holds\nFor a business, coverage forms and rates are constantly changing. Changes are generally made at the state level by line of business. Although changes generally pertain to one state, sometimes changes occur on a nationwide level when numerous states adopt the same change simultaneously. Work is put on hold for a number of days before the effective date of the change to ensure that work is not started with incorrect rates or forms.",
      "narration": "In PolicyCenter, when a policy hold is applied, it directly impacts the transaction flow, effectively blocking further processing. This is managed through the creation of an underwriting issue specific to the policy hold. Understanding this process is crucial for developers, as it involves configuring the data model and user interface to appropriately handle these holds.",
      "ocrText": "| Policy holds G\n\n• Are placed on a transaction in the event of a natural disaster or for changes in\nbusiness\n\n• Are placed in a specific region for a period of time\n« Allow a carrier to prevent users from:\n* Creating new policies\n* Changing existing policies\n« Raise underwriting (UW) issues during a transaction\n« When the effective date of the transaction falls in the date range of the policy hold, and\n* The policy location matches the region affected by the policy hold\n\n« Underwriting issues can be processed by an underwriter with proper underwriting authority",
      "ocrWordCount": 101,
      "ocrConfidence": 89.13,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 5,
      "title": "Hold and Release a Transaction in PolicyCenter (Part 2)",
      "bodyParagraphs": [],
      "originalNotes": "Hold and release a transaction in PolicyCenter (I of 3)\nIf a policy hold applies, then policy transactions are blocked. PolicyCenter creates an underwriting issue of the policy hold type. transaction.",
      "notes": "Hold and release a transaction in PolicyCenter (I of 3)\nIf a policy hold applies, then policy transactions are blocked. PolicyCenter creates an underwriting issue of the policy hold type. transaction.",
      "narration": "An underwriter with the appropriate authority can step in to approve the underwriting issue, which is key to releasing the hold. This action is typically controlled through user permissions and roles within PolicyCenter, ensuring that only qualified individuals can modify the status of a hold. This step is crucial for allowing transactions to progress smoothly once compliance is verified.",
      "ocrText": "| Hold and release a transaction in PolicyCenter (1 of 3) [\n\nThe following explains how a transaction is held and then released:\n\noe 4\nPolicy transaction\nquote, bind or issue\n\nL\npA ©\n\nUW issue created\n\nPolicy Hold evaluated for Policy Hold",
      "ocrWordCount": 43,
      "ocrConfidence": 86.17,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 6,
      "title": "Hold and Release a Transaction in PolicyCenter (Part 3)",
      "bodyParagraphs": [],
      "originalNotes": "Hold and release a transaction in PolicyCenter (2 of 3)\nAn underwriter with proper authority can approve the UW issue.",
      "notes": "Hold and release a transaction in PolicyCenter (2 of 3)\nAn underwriter with proper authority can approve the UW issue.",
      "narration": "PolicyCenter uses a batch process called Policy Hold Job Evaluation to assess whether a hold can be lifted. This process runs at scheduled intervals, comparing current policy conditions against hold criteria. The PolicyHoldJobEvalPlugin plays a critical role here, tracking held transactions and updating their status. Once a hold is eligible for removal, an activity is generated, notifying the producer to proceed with the transaction.",
      "ocrText": "| Hold and release a transaction in PolicyCenter (2 of 3) [\nThe following explains how a transaction is held and then released:\n\neoe\n\nSG\n\nPolicy transaction\nquote, bind or issue\n\n|\npl~- O-f-\n\nUW issue created UW approves Process\n\nPolicy Hold evaluated for Policy Hold issues transaction",
      "ocrWordCount": 48,
      "ocrConfidence": 89.26,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 7,
      "title": "Policy Hold Lifecycle Management",
      "bodyParagraphs": [],
      "originalNotes": "Hold and release a transaction in PolicyCenter (I of 3)\nUntil the issue is approved, a batch process Policy Hold Job Evaluation runs at scheduled times and compares the period values with the hold values. It reevaluates whether the hold can be removed. An issue can be approved when the hold end date has passed, or the hold is modified by a superuser. The PolicyHoldJobEvalPlugin tracks transactions that are currently held by a policy hold and notes the last time the transaction was evaluated against the policy hold. Once a hold can be removed, an activity is sent to the producer so they can process the transaction.",
      "notes": "Hold and release a transaction in PolicyCenter (I of 3)\nUntil the issue is approved, a batch process Policy Hold Job Evaluation runs at scheduled times and compares the period values with the hold values. It reevaluates whether the hold can be removed. An issue can be approved when the hold end date has passed, or the hold is modified by a superuser. The PolicyHoldJobEvalPlugin tracks transactions that are currently held by a policy hold and notes the last time the transaction was evaluated against the policy hold. Once a hold can be removed, an activity is sent to the producer so they can process the transaction.",
      "narration": "Managing the lifecycle of policy holds involves continuous evaluation and timely updates. The batch process not only checks current conditions but also ensures that holds are released promptly when criteria are met. This automated evaluation helps maintain workflow efficiency and minimizes manual intervention, highlighting the power of PolicyCenter's structured approach to policy management.",
      "ocrText": "| Hold and release a transaction in PolicyCenter (1 of 3) [\n\nThe following explains how a transaction is held and then released:\n\na e- f} -&\n\nPolicy transaction Policy Hold Job PolicyHoldJob- ok activity release\n\nquote, bind or issue Evaluation batch EvalPlugin producer\n\n| t |\n\npa- Gi -38-\n\nUW issue created UW approves Process\n\nPolicy Hold evaluated for Policy Hold issues transaction",
      "ocrWordCount": 64,
      "ocrConfidence": 85.7,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 8,
      "title": "Introduction to Underwriting Referral Reasons",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Overview of underwriting referral reasons and their application.",
      "narration": "Underwriting referral reasons offer a means to document issues that arise outside regular transactions. Unlike holds, these can be added at any point, providing flexibility in managing underwriting concerns. Understanding how these reasons integrate with the overall policy lifecycle is crucial for developers aiming to optimize policy evaluation processes.",
      "ocrText": "| Demonstration G\n\nPolicy holds\n\nclick here\n\nNote: The demonstration opens a new tab in your browser. When the demonstration ends, the\noriginal course launch window appears. Return to this window to continue this presentation.",
      "ocrWordCount": 35,
      "ocrConfidence": 95.54,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_instruction",
      "demoVideoIndex": 0
    },
    {
      "slideNumber": 9,
      "title": "Creating Underwriting Referral Reasons",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Steps and considerations for adding referral reasons in PolicyCenter.",
      "narration": "Creating underwriting referral reasons involves identifying the relevant policy concerns and recording them within PolicyCenter. This process often includes interfacing with external systems, where potential issues are flagged and communicated back to PolicyCenter. The integration points and data model configurations are key areas for customization and development.",
      "ocrText": "",
      "ocrWordCount": 0,
      "ocrConfidence": 0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_video"
    },
    {
      "slideNumber": 10,
      "title": "Handling Referral Reasons in Transactions",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Impact of referral reasons on policy transactions and workflow.",
      "narration": "Referral reasons can halt transaction progress until resolved, similar to policy holds. PolicyCenter automatically checks for these reasons during transaction processing, ensuring all issues are addressed before completion. This automatic checking helps prevent policy discrepancies and maintains underwriting standards across all transactions.",
      "ocrText": "Simone\n\nAgent\n\nSometimes | need to refer a policy to an\nunderwriter because there is not enough\ninformation available in the system to make a\ndecision on a policy. Is there a way to do this in\nPolicyCenter?",
      "ocrWordCount": 38,
      "ocrConfidence": 94.87,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 11,
      "title": "Real-World Application of Referral Reasons",
      "bodyParagraphs": [],
      "originalNotes": "Underwriting referral reasons\nReferral reasons can be used to record underwriting issues for a policy outside of the context of a transaction. Since referral reasons are added to the policy, they can be created at any time, even when there is no policy transaction- PolicyCenter creates underwriting issuesfor these referral reasons the next time a user processes a transaction on the policy. It also checks for referral reasons at various point in the transaction progress. Referral reasons can block transaction progress on the policy. In the default application, the renewal transaction checks to see if there are any open referral reasons in the prior term. Referral reasons affect all transactions that handle underwriter issues.\nConsider the following example for referral reason creation. An external claim system stores the loss claims for a policy. The external system notes that loss claims are unacceptably high. The external system sends a message to PolicyCenter to add an undemriting referral reason to the policy. The next time a transaction runs on the policy, an issue is created that corresponds to the referral reason which remains on the policy.\n\nAn underwriter cannot approve an underwriting referral reason, but the UW can remove it. For example, a visit to the customer site revealed numerous safety violations, and an underwriting referral reason was added to the policy- On a subsequent visit, the safety violations had been addressed- The underwriting referral reason is removed from the policy. The next time a transaction is run or reaches a checking set, the corresponding issue is deactivated-",
      "notes": "Underwriting referral reasons\nReferral reasons can be used to record underwriting issues for a policy outside of the context of a transaction. Since referral reasons are added to the policy, they can be created at any time, even when there is no policy transaction- PolicyCenter creates underwriting issuesfor these referral reasons the next time a user processes a transaction on the policy. It also checks for referral reasons at various point in the transaction progress. Referral reasons can block transaction progress on the policy. In the default application, the renewal transaction checks to see if there are any open referral reasons in the prior term. Referral reasons affect all transactions that handle underwriter issues.\nConsider the following example for referral reason creation. An external claim system stores the loss claims for a policy. The external system notes that loss claims are unacceptably high. The external system sends a message to PolicyCenter to add an undemriting referral reason to the policy. The next time a transaction runs on the policy, an issue is created that corresponds to the referral reason which remains on the policy.\n\nAn underwriter cannot approve an underwriting referral reason, but the UW can remove it. For example, a visit to the customer site revealed numerous safety violations, and an underwriting referral reason was added to the policy- On a subsequent visit, the safety violations had been addressed- The underwriting referral reason is removed from the policy. The next time a transaction is run or reaches a checking set, the corresponding issue is deactivated-",
      "narration": "Consider a scenario where an external claims system identifies high loss claims, triggering an underwriting referral reason in PolicyCenter. This seamless integration allows for proactive policy management, as referral reasons are created and resolved based on real-world data. This example underscores the importance of integration capabilities and how they enhance underwriting efficiency.",
      "ocrText": "| Underwriting referral reasons Gi\n\n• Used when a notable condition arises outside of a transaction, possibly outside of\nthe PolicyCenter maintained policy data\n\n* Can be added manually or by external systems through an API\n* Cannot be approved but can be removed from the policy\n\n* Raises UW issues next time a transaction is run on that policy\n\nManual Nb\nExternal .\nSystem UW referral reason added UW issue raised\n\non bound policy on next policy transaction",
      "ocrWordCount": 79,
      "ocrConfidence": 91.69,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 12,
      "title": "Workflow Implications of Referral Reasons",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Exploring the effects of referral reasons on policy workflows.",
      "narration": "Referral reasons impact workflows by introducing checks and balances in the policy process. They ensure that all necessary underwriting concerns are addressed before a transaction is finalized. Understanding how these reasons affect workflow is essential for developers aiming to streamline policy operations while maintaining compliance standards.",
      "ocrText": "| UW referral reasons and UW issues compared Gi\n\nUW referral reason\n\nRelated to the policy — when something\nnotable about the policy needs to be brought\nto the attention of underwriting the next time a\ntransaction runs\n\nGenerates a UWlssue which can stop\ntransactions progress\n\nOften manually created, can only be deleted\nmanually or through an API, can’t be approved\n\nPersists with the policy; resulting UWlssues\ncan be approved\n\nRelated to the transaction - when something\nnotable about this transaction needs to be\nbrought to the attention of underwriting\n\nCan stop transaction progress that somebody\nmight approve when writing the policy\n\nOften automatically generated, is usually\nautomatically removed when the cause no\nlonger exists\n\nCan be approved; with approval, persists\nalong any descendent of the policy period",
      "ocrWordCount": 128,
      "ocrConfidence": 94.22,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 13,
      "title": "Configuring Referral Reasons in PolicyCenter",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Guidelines for setting up and managing referral reasons in PolicyCenter.",
      "narration": "Configuring referral reasons involves setting the criteria and conditions under which they are triggered. Developers must ensure that these configurations align with business requirements and regulatory standards. Proper setup is crucial for effective policy management, as it determines how quickly and accurately issues are identified and resolved.",
      "ocrText": "| Demonstration G\n\nUnderwriting referral reasons\n\nclick here\n\nNote: The demonstration opens a new tab in your browser. When the demonstration ends, the\noriginal course launch window appears. Return to this window to continue this presentation.",
      "ocrWordCount": 36,
      "ocrConfidence": 95.53,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_instruction",
      "demoVideoIndex": 1
    },
    {
      "slideNumber": 14,
      "title": "Developer Insights on Policy Holds and Referral Reasons",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Developer perspective on implementing policy holds and referral reasons.",
      "narration": "From a developer's standpoint, implementing policy holds and referral reasons requires a deep understanding of PolicyCenter's data model and integration points. Customizing these features involves configuring entities and plugins to ensure seamless operation within the broader policy lifecycle. These customizations are central to adapting PolicyCenter to specific business needs.",
      "ocrText": "",
      "ocrWordCount": 0,
      "ocrConfidence": 0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_video"
    },
    {
      "slideNumber": 15,
      "title": "Common Challenges and Solutions",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Identifying and addressing common challenges in managing policy holds and referral reasons.",
      "narration": "Common challenges in managing policy holds and referral reasons include ensuring timely updates and maintaining accurate data flow between systems. Solutions often involve enhancing integration capabilities and refining batch processes to better track and resolve issues. Developers play a crucial role in addressing these challenges through strategic configuration and customization.",
      "ocrText": "Question\nDistinguish underwriting (UW) referral reasons from an UW issue.\n•\n•",
      "ocrWordCount": 21,
      "ocrConfidence": 72.17,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question",
      "questionData": {
        "question": "Distinguish underwriting (UW) referral reasons from an UW issue.",
        "answer": "The underwriting referral reason is specific to a policy. When it generates an underwriting issue, the transaction will not progress further. UW referral reasons are often manually created, cannot be approved, and are manually deleted (or through an API). UW referral reasons persist with the policy. Underwriting issues are related to the transaction. When something is notable about this transaction requiring the attention of underwriting. They are often automatically generated, and are usually automatically removed when the cause no longer exists. Sooo ooo ooo Oooo oOoD"
      }
    },
    {
      "slideNumber": 16,
      "title": "Best Practices for Policy Holds and Referral Reasons",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Best practices for implementing and managing policy holds and referral reasons effectively.",
      "narration": "Implementing best practices involves establishing clear criteria for policy holds and referral reasons, ensuring they are consistently applied across all transactions. Regular reviews and updates to these criteria help maintain compliance and efficiency. Developers should focus on creating flexible configurations that can adapt to changing business needs and regulatory environments.",
      "ocrText": "Answer Gi\nDistinguish underwriting (UW) referral reasons from an UW issue.\n•\n•\n•\nThe underwriting referral reason is specific to a policy. When it generates an\nunderwriting issue, the transaction will not progress further. UW referral reasons are\noften manually created, cannot be approved, and are manually deleted (or through an\nAPI). UW referral reasons persist with the policy.\nUnderwriting issues are related to the transaction. When something is notable about this\ntransaction requiring the attention of underwriting. They are often automatically generated,\nand are usually automatically removed when the cause no longer exists.\nSooo ooo ooo Oooo oOoD",
      "ocrWordCount": 102,
      "ocrConfidence": 92.12,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 17,
      "title": "Summary and Next Steps",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Wrap-up of the lesson with a preview of the next topic on documents.",
      "narration": "In summary, understanding policy holds and underwriting referral reasons is essential for effective policy management in PolicyCenter. These concepts ensure that policies remain compliant and accurately reflect the latest coverage requirements. As we move forward, our next lesson will explore document management, a critical component of the PolicyCenter ecosystem. Stay tuned to learn how to handle documents efficiently within your policy workflows.",
      "ocrText": "Lesson\nobjectives • Explain and define the policy holds\n\nreview * Describe and work with the Underwriting\nReferral Reasons",
      "ocrWordCount": 19,
      "ocrConfidence": 91.37,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "objectives_review"
    }
  ],
  "videos": [
    {
      "index": 1,
      "filename": "In_Policy_24_01.mp4",
      "path": "/academy/guidewire/videos/ch04/In_Policy_24_01.mp4"
    },
    {
      "index": 2,
      "filename": "In_Policy_24_02.mp4",
      "path": "/academy/guidewire/videos/ch04/In_Policy_24_02.mp4"
    }
  ],
  "hasNotes": true,
  "hasTables": false,
  "hasImages": true,
  "ocrMetadata": {
    "totalWords": 762,
    "avgConfidence": 90.46,
    "extractedAt": "2026-02-13T12:07:06.102183"
  }
}
