{
  "lessonId": "ch04-l29",
  "chapterId": 4,
  "chapterSlug": "ch04",
  "lessonNumber": 29,
  "title": "Premium Audits",
  "sourceFile": "In_policy_30 Premium Audits.pptx",
  "sourceFolder": "In_policy_29",
  "totalSlides": 30,
  "estimatedMinutes": 90,
  "slides": [
    {
      "slideNumber": 1,
      "title": "Introduction to Premium Audits",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Introduction to the concept of premium audits, a critical aspect of PolicyCenter.",
      "narration": "Welcome to our exploration of premium audits within Guidewire PolicyCenter. Premium audits play a vital role in ensuring that the premiums charged to policyholders accurately reflect the actual risk exposure over a policy term. In this lesson, we'll dive into how audits are configured, executed, and managed, setting the stage for accurate billing and compliance with regulatory requirements. Let's get started by understanding what makes premium audits unique in the insurance lifecycle.",
      "ocrText": "Premium Audits",
      "ocrWordCount": 2,
      "ocrConfidence": 95.5,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "title"
    },
    {
      "slideNumber": 2,
      "title": "Understanding Audit Types",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Overview of the different types of premium audits used in PolicyCenter.",
      "narration": "In PolicyCenter, it's crucial to distinguish between various audit types. We have final audits, which occur at the end of a policy term, and premium reports, which can happen periodically within the term. Each type serves a different purpose and is triggered by specific conditions and schedules. Understanding these distinctions helps in configuring audits that align with both business needs and regulatory standards.",
      "ocrText": "Lesson\nobjectives ¢ Describe different types of premium audits,\n\nnamely final audits and premium reports\n¢ Work with final audits and premium reports in\nthe application",
      "ocrWordCount": 26,
      "ocrConfidence": 91.31,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "objectives"
    },
    {
      "slideNumber": 3,
      "title": "Audit Methods Overview",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Examine the methods used to conduct premium audits.",
      "narration": "When conducting premium audits, insurers can choose from methods like physical, phone, estimated, or voluntary audits. These methods allow flexibility based on the resources available and the nature of the insured's business. For instance, physical audits are thorough but resource-intensive, while voluntary audits rely on the policyholder's input. This flexibility ensures audits can be tailored to the specific circumstances and requirements of each policy.",
      "ocrText": "Darren\n\nInsurance ,\n- We offer worker’s compensation policies. We\n\nProduct Manager\n\naudit payrolls monthly and at the end of the\npolicy term. How does PolicyCenter handle it?\n\nJulia\nImplementation We\nArchitect\nThere are two ways to handle this:\npremium report and final audit.\n\n!",
      "ocrWordCount": 45,
      "ocrConfidence": 89.78,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 4,
      "title": "Characteristics of Audits",
      "bodyParagraphs": [],
      "originalNotes": "Audits\nAudits are unlike other transactions for the following reasons:\nAudits utilize the policy information and are tied to the policy periods, but they cannot alter the policy contract-\nAudits don't have an associated edit effective date and do not get 'issued\".\nThey can be executed at any time within the policy term. (The only other job which typically executes on a recurring basis is a renewal, and that technically occurs only once per term.)\nThey are initiated and are viewable in a separate place in the Policy Center interface.\n\nIn the case of workers’ compensation LOB, the premium is typically based on the payroll of the insured workers. It cannot be predicted how many workers will be employed during the policy term or their salaries-Consequently, the payroll is estimated. Therefore, an audit is required to convert estimated amounts to actual data which in turn is reflected on the policy premium. Occasionally, an LOB which does not appear to be based on estimates may be subject to a Final Audit (i.e., Business Auto). Final Audits or other audit 'reporting' can be applied to several LOBs.\n\nPremium Reports are available for workers’ compensation LOBs. Final Audits are available for worker's compensation and general liability LOBs- Premium Reports: Premium reports are an audit subtype that are created for interim periods within a policy term. Premium reporting audits adjust estimated data, such as payroll, inventory, and construction reports. The primary distinction between the two types of activities is that an \"audit\" is executed by the insurer whereas a •premium report\" is prepared exclusively by the policyholder (or their representative) and are not typically verified by the insurer. A premium report or a final audit is created using any of the available audit methods (voluntary, phone,  physical or estimate)-",
      "notes": "Audits\nAudits are unlike other transactions for the following reasons:\nAudits utilize the policy information and are tied to the policy periods, but they cannot alter the policy contract-\nAudits don't have an associated edit effective date and do not get 'issued\".\nThey can be executed at any time within the policy term. (The only other job which typically executes on a recurring basis is a renewal, and that technically occurs only once per term.)\nThey are initiated and are viewable in a separate place in the Policy Center interface.\n\nIn the case of workers’ compensation LOB, the premium is typically based on the payroll of the insured workers. It cannot be predicted how many workers will be employed during the policy term or their salaries-Consequently, the payroll is estimated. Therefore, an audit is required to convert estimated amounts to actual data which in turn is reflected on the policy premium. Occasionally, an LOB which does not appear to be based on estimates may be subject to a Final Audit (i.e., Business Auto). Final Audits or other audit 'reporting' can be applied to several LOBs.\n\nPremium Reports are available for workers’ compensation LOBs. Final Audits are available for worker's compensation and general liability LOBs- Premium Reports: Premium reports are an audit subtype that are created for interim periods within a policy term. Premium reporting audits adjust estimated data, such as payroll, inventory, and construction reports. The primary distinction between the two types of activities is that an \"audit\" is executed by the insurer whereas a •premium report\" is prepared exclusively by the policyholder (or their representative) and are not typically verified by the insurer. A premium report or a final audit is created using any of the available audit methods (voluntary, phone,  physical or estimate)-",
      "narration": "Audits in PolicyCenter are unique because they are linked to the policy period but do not alter the policy contract itself. They don't have an edit effective date and aren't 'issued' like other jobs. Because audits are based on estimated data—like payroll in workers' compensation—they are crucial for reconciling estimates with actual figures. This process not only ensures accurate premium calculation but also helps in regulatory reporting and maintaining compliance.",
      "ocrText": "Premium report Premium report Final audit\n\nPolicy term (estimate > actual)\n\nAudits are line of business (LOB) specific\n\nA submission creates a policy with a premium based on estimated information,\nsuch as the insured's revenue\n\nA premium report collects the actual data periodically within the policy term\n* Can change policy premium\n\nA final audit may occur at the end of the term to ensure the policy does not reflect\nestimated data",
      "ocrWordCount": 72,
      "ocrConfidence": 91.27,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 5,
      "title": "Types of Premium Audits",
      "bodyParagraphs": [],
      "originalNotes": "Audit types\nA final audit is a type of premium audit. There is only one final audit; it is run at the end of a policy term. Premium reports, a secondary audit, may take place at regular intervals during the policy term depending on the user's audit configuration schedule.",
      "notes": "Audit types\nA final audit is a type of premium audit. There is only one final audit; it is run at the end of a policy term. Premium reports, a secondary audit, may take place at regular intervals during the policy term depending on the user's audit configuration schedule.",
      "narration": "Final audits and premium reports serve different purposes within the audit framework. Final audits close out a policy term by verifying the ultimate costs, while premium reports adjust estimates during the term. This distinction matters because it affects when and how adjustments to premiums are made, impacting both cash flow and accounting practices for insurers and insureds alike.",
      "ocrText": "| Audit types\n\nFinal Audit\n\n* For general liability and workers’\n\ncompensation in the base configuration\n* Can be configured for other LOBs\n\nPremium reports\n\n* For workers’ compensation in the base\n\nconfiguration\n\n* Can be configured for other LOBs\n\nGi",
      "ocrWordCount": 41,
      "ocrConfidence": 88.12,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 6,
      "title": "Methods of Conducting Premium Audits",
      "bodyParagraphs": [],
      "originalNotes": "Premium audit methods\nPhysical: A representative (i.e. premium auditor) makes an in person visit to the policyholder to review business records, verify,  and obtain required audit information.\nPhone: The auditor contacts the policyholder by phone to obtain audit information.\nEstimated: Used when other methods are unavailable (i.e., policyholder went out of business, or records were lost).\nVoluntary: The insurer distributes a form to the policyholder requesting audit information. The policyholder completes and returns the form for processing.",
      "notes": "Premium audit methods\nPhysical: A representative (i.e. premium auditor) makes an in person visit to the policyholder to review business records, verify,  and obtain required audit information.\nPhone: The auditor contacts the policyholder by phone to obtain audit information.\nEstimated: Used when other methods are unavailable (i.e., policyholder went out of business, or records were lost).\nVoluntary: The insurer distributes a form to the policyholder requesting audit information. The policyholder completes and returns the form for processing.",
      "narration": "PolicyCenter supports several methods for conducting audits: physical, phone, estimated, and voluntary. Each method has its strengths and ideal scenarios. For instance, a physical audit might be necessary for complex cases requiring thorough verification, whereas a voluntary audit can be more efficient for straightforward policies. Understanding these methods allows insurers to choose the most cost-effective and appropriate approach for each audit.",
      "ocrText": "| Premium audit methods Gi\n\n« Physical\n\nHL C) « Phone\n(<=) A] * Estimated\nGa vis + Voluntary",
      "ocrWordCount": 19,
      "ocrConfidence": 66.24,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 7,
      "title": "Roles in Premium Audit Process",
      "bodyParagraphs": [],
      "originalNotes": "Premium audit roles — insurer can tailor roles\nPremium Auditor: The auditor may edit the audit summary and details. However, the auditor may not complete the audit since an audit examiner must check for accuracy. Note: In the default configuration for physical audits, Policy Center assigns the audit to a user with the premium auditor role. Audit Examiner: The audit examiner verifies the accuracy of physical audits, calculates premiums, and completes the audit. If the final audit method is: \nPhysical — The auditexaminer receives the physical audit from the premium auditor and checks it for completeness and accuracy The examiner checks for adherence to the insurance company’s manual rules and guidelines. For example, are all locations and entities includedQ Does it split exposures for the anniversary rating date  (ARD)?\n Voluntary — The audit examiner receives and reviews a completed report form from the policyholder, verifying completeness before billing. If necessary, the audit examiner contacts the policyholder to clarify or amend the reported figures.\nBy phone — The audit examiner calls the policyholder to obtain audit exposures and ask appropriate questions for the audit or renewal. \n     Audit Supervisor: The supervisor has access to team screens where outstanding audits and audit activities can be tracked-",
      "notes": "Premium audit roles — insurer can tailor roles\nPremium Auditor: The auditor may edit the audit summary and details. However, the auditor may not complete the audit since an audit examiner must check for accuracy. Note: In the default configuration for physical audits, Policy Center assigns the audit to a user with the premium auditor role. Audit Examiner: The audit examiner verifies the accuracy of physical audits, calculates premiums, and completes the audit. If the final audit method is: \nPhysical — The auditexaminer receives the physical audit from the premium auditor and checks it for completeness and accuracy The examiner checks for adherence to the insurance company’s manual rules and guidelines. For example, are all locations and entities includedQ Does it split exposures for the anniversary rating date  (ARD)?\n Voluntary — The audit examiner receives and reviews a completed report form from the policyholder, verifying completeness before billing. If necessary, the audit examiner contacts the policyholder to clarify or amend the reported figures.\nBy phone — The audit examiner calls the policyholder to obtain audit exposures and ask appropriate questions for the audit or renewal. \n     Audit Supervisor: The supervisor has access to team screens where outstanding audits and audit activities can be tracked-",
      "narration": "The premium audit process involves distinct roles, such as the Premium Auditor, Audit Examiner, and Audit Supervisor. Each role has specific responsibilities, like verifying data accuracy or managing audit schedules. This separation of duties ensures checks and balances, with auditors gathering data and examiners verifying accuracy. It's crucial to understand these roles to configure user permissions appropriately in PolicyCenter.",
      "ocrText": "| Premium audit roles — insurer can tailor roles Gi\n\nPremium Auditor Audit Examiner Audit Supervisor\n\nTravels to policyholder’s location Non-traveling employees In charge of all audit department\nto conduct the audit employees\n\nAssigned physical and phone Review physical, phone, or Has all audit permissions\n\naudits voluntary audits for accuracy\n\nEdits and returns audit Can start and complete data Can track department employee\ninformation to the insurer's entry to complete audits assignments through team\n\noffice, where accuracy is verified screens",
      "ocrWordCount": 80,
      "ocrConfidence": 92.76,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 8,
      "title": "Scheduling and Managing Audits",
      "bodyParagraphs": [],
      "originalNotes": "Premium audit process\nWhen the policy is issued, PolicyCenter adds scheduled audit items to the policy. These audits can be viewed by clicking the Audit Schedule link in the policy file. These are not actual audit jobs, they are a list of the anticipated, uninitialized audit jobs for the policy period sorted by their start and end dates; their status is Scheduled. When a policy is canceled or reinstated, PolicyCenter revises the number of scheduled audits according to the coverage dates. Each of the scheduled items includes a process start date, an audit method and a due date. Users with the proper permissions canedit these fields before the audit job is initialized.",
      "notes": "Premium audit process\nWhen the policy is issued, PolicyCenter adds scheduled audit items to the policy. These audits can be viewed by clicking the Audit Schedule link in the policy file. These are not actual audit jobs, they are a list of the anticipated, uninitialized audit jobs for the policy period sorted by their start and end dates; their status is Scheduled. When a policy is canceled or reinstated, PolicyCenter revises the number of scheduled audits according to the coverage dates. Each of the scheduled items includes a process start date, an audit method and a due date. Users with the proper permissions canedit these fields before the audit job is initialized.",
      "narration": "Once a policy is issued, PolicyCenter automatically schedules audits based on predefined parameters. These schedules can be viewed and managed via the Audit Schedule link. Each scheduled audit has a process start date and method, which can be adjusted by users with appropriate permissions. This automated scheduling helps streamline audit processes, ensuring they're conducted timely and efficiently.",
      "ocrText": "| Premium audit process\n\neooe\n\nPolicy issued\n\nAudit scheduled\nitems added\n\nEach scheduled item\nincludes:\n\nprocess start date\ndue date\n\naudit method\n\nAudit status:\nscheduled",
      "ocrWordCount": 25,
      "ocrConfidence": 92.88,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 9,
      "title": "Executing the Audit Process",
      "bodyParagraphs": [],
      "originalNotes": "Audit process\nAn Audit Task is a regularly scheduled batch process that starts the audit jobs on its process start date. The Process Start Date is set according to the audit schedule(s) configured in Product Designer.\n\nThe Audit Method dictates how many days before the End Date each audit should be started. Note: Physical audits start approximately a month before the period end. With the correct permissions, a user may Stan an audit prior to the Process Stad Date using the Start button on the audit schedule item. Once the process starts, the audit status changes from Scheduled to In Progress. The audit becomes a draft policy transaction, and the scheduled item becomes a link to the audit wizard. The user can enter the audit information.\n\nEnter the audit details into the Audit Summary and Audit Details screens. Premiums are determined by clicking the Calculate Premiums button. Finalize the calculations by clicking the Submit button. At that time, the audit becomes non- editable, the status becomes Completed, and the audit schedule displays the resulting premiums. The user can change completed audits.",
      "notes": "Audit process\nAn Audit Task is a regularly scheduled batch process that starts the audit jobs on its process start date. The Process Start Date is set according to the audit schedule(s) configured in Product Designer.\n\nThe Audit Method dictates how many days before the End Date each audit should be started. Note: Physical audits start approximately a month before the period end. With the correct permissions, a user may Stan an audit prior to the Process Stad Date using the Start button on the audit schedule item. Once the process starts, the audit status changes from Scheduled to In Progress. The audit becomes a draft policy transaction, and the scheduled item becomes a link to the audit wizard. The user can enter the audit information.\n\nEnter the audit details into the Audit Summary and Audit Details screens. Premiums are determined by clicking the Calculate Premiums button. Finalize the calculations by clicking the Submit button. At that time, the audit becomes non- editable, the status becomes Completed, and the audit schedule displays the resulting premiums. The user can change completed audits.",
      "narration": "Executing an audit involves several steps, starting from the scheduled process date. Users initiate audits via the Start button, moving them from 'Scheduled' to 'In Progress'. During this phase, data entry and premium calculations occur, culminating in submission. This workflow ensures audits are comprehensive and accurate, providing a clear audit trail and maintaining data integrity.",
      "ocrText": "| Audit process\n\nAudit task starts audit job\n\nAudit Status : In progress\n\nAudit — draft policy\ntransaction ready\n\n3 Each item becomes a link to\nthe audit wizard, so the ue ===>\ncan enter audit information\n\nSubmit — audit non-editable\n\nAudit Status: Completed\n\nCalculate premiums\n\nEnter Audit details",
      "ocrWordCount": 49,
      "ocrConfidence": 92.98,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 10,
      "title": "Final Audits in Detail",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Deep dive into final audits and their significance.",
      "narration": "Final audits play a critical role in reconciling estimated premiums with actual figures at the end of a policy term. They ensure that the ultimate cost reflects true exposure, which is essential for accurate billing and regulatory compliance. PolicyCenter's base configuration supports final audits for workers' compensation and general liability, but it can be customized for other lines of business as needed.",
      "ocrText": "Darren\nInsurance\nProduct Manager\n\nHow can | schedule and work with\nfinal audits in PolicyCenter?",
      "ocrWordCount": 15,
      "ocrConfidence": 92.38,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 11,
      "title": "Understanding Final Audits",
      "bodyParagraphs": [],
      "originalNotes": "Final audit\nFinal audits:\nCover the entire policy term\nOne final audit is conducted each policy term\nAvailable in PolicyCenter base configuration for workers' compensation and general liability\n\nA final audit contains the verified, ultimate cost for a variable basis policy- Final audits are important in determining actual policy premiums. When the policy is issued, the estimated annual premium (EAP) is based on the policyholder's estimated basis for the entire policy year- The final audit is conducted at expiration or cancellation. An auditor reviews the policyholder’s records and the actual payroll amounts (submitted by the policyholder) for the past policy term. The cost of the policy is recalculated using the actual basis amount and the policyholder is billed or refunded the difference.\n\nInsurers must also report final audit information to regulatory agencies- Worker’s compensation unit statistical reports (unit stat reports) are sent to state bureaus or councils that handle multiple states (that is, NCCI). Unit stat reports are used by the state to calculate policyholder experience modifications and suggested or mandatory rates obtained by the insurer- PolicyCenter does not create or send unit stat reports. However, PolicyCenter can be configured to export final audit data for statistical reporting. This data can be imported into another system,  such as the unit stat software application used by a particular state.",
      "notes": "Final audit\nFinal audits:\nCover the entire policy term\nOne final audit is conducted each policy term\nAvailable in PolicyCenter base configuration for workers' compensation and general liability\n\nA final audit contains the verified, ultimate cost for a variable basis policy- Final audits are important in determining actual policy premiums. When the policy is issued, the estimated annual premium (EAP) is based on the policyholder's estimated basis for the entire policy year- The final audit is conducted at expiration or cancellation. An auditor reviews the policyholder’s records and the actual payroll amounts (submitted by the policyholder) for the past policy term. The cost of the policy is recalculated using the actual basis amount and the policyholder is billed or refunded the difference.\n\nInsurers must also report final audit information to regulatory agencies- Worker’s compensation unit statistical reports (unit stat reports) are sent to state bureaus or councils that handle multiple states (that is, NCCI). Unit stat reports are used by the state to calculate policyholder experience modifications and suggested or mandatory rates obtained by the insurer- PolicyCenter does not create or send unit stat reports. However, PolicyCenter can be configured to export final audit data for statistical reporting. This data can be imported into another system,  such as the unit stat software application used by a particular state.",
      "narration": "Final audits verify the ultimate cost for a variable basis policy, ensuring premiums reflect actual rather than estimated figures. Conducted at policy expiration or cancellation, these audits are crucial for accurate billing. They also support regulatory reporting, such as unit statistical reports, which are critical for compliance and rate calculations. This makes final audits an indispensable part of the audit process.",
      "ocrText": "| Final audit\n\nFinal audit\nZN\n\nPolicy term (estimate > actual)\n\nContains the ultimate cost for a variable basis policy\n\n* happens once for each policy term\n* is scheduled automatically\n* may not be needed depending on the insurer, insurance laws or regulations\n\n* is conducted at expiration or cancellation",
      "ocrWordCount": 51,
      "ocrConfidence": 90.17,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 12,
      "title": "Steps for Conducting Final Audits",
      "bodyParagraphs": [],
      "originalNotes": "Final audit general steps\nPolicyCenter initially schedules a final audit when a submission, rewrite, or renewal job is issued. The line of business and choices on the Payment page determine whether a final audit is required and a choice of audit schedules. Other jobs, such as policy change, reinstatement, or cancellation can affect the audit.  The batch process audit task uses the audit start date to determine when an audit begins.  If the user selects to audit the policy, the audit is completed by one of the audit methods: physical, phone, voluntary or estimation\n\nIf the user chose to waive the audit, then the audit status changes to complete, however,  an audit can be manually restored to the schedule. The slide diagram shows the steps needed to conduct a final audit.  These steps are for the default configuration of PolicyCenter.  Insurers' business requirements\ncan also alter the process.",
      "notes": "Final audit general steps\nPolicyCenter initially schedules a final audit when a submission, rewrite, or renewal job is issued. The line of business and choices on the Payment page determine whether a final audit is required and a choice of audit schedules. Other jobs, such as policy change, reinstatement, or cancellation can affect the audit.  The batch process audit task uses the audit start date to determine when an audit begins.  If the user selects to audit the policy, the audit is completed by one of the audit methods: physical, phone, voluntary or estimation\n\nIf the user chose to waive the audit, then the audit status changes to complete, however,  an audit can be manually restored to the schedule. The slide diagram shows the steps needed to conduct a final audit.  These steps are for the default configuration of PolicyCenter.  Insurers' business requirements\ncan also alter the process.",
      "narration": "Conducting a final audit involves several steps, starting with scheduling during the policy issuance. The batch process determines when an audit begins, based on start dates and user selections. If waived, it can be manually restored. This process ensures that audits are thorough, accurate, and aligned with both business and regulatory requirements, providing a solid foundation for premium adjustments.",
      "ocrText": "| Final audit general steps\n\nAudit task batch process\nweg starts audit job before\npolicy expiration\n\nNo . Yes\n—— ual Enter audit basis\npolicy\n\nCalculate\npremium and\ncomplete audit\n\nSchedule\nFinal audit\n\npremium adjustments",
      "ocrWordCount": 35,
      "ocrConfidence": 88.08,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 13,
      "title": "Demonstration: Final Audits",
      "bodyParagraphs": [],
      "originalNotes": "Demonstration\n1. A submission payment page includes a field for scheduling a final audit\n2.Viewing final audit schedules\n3.Editing or waiving a final audit\n4.Adding a new final audit question\n5. Starting a final audit schedule\n\nAll report plans in the base application require final audit. The final audit notifies the billing system to release the deposit. Most insurers require a final audit for Workers' Compensation policies. For other lines of business, the rules vary.",
      "notes": "Demonstration\n1. A submission payment page includes a field for scheduling a final audit\n2.Viewing final audit schedules\n3.Editing or waiving a final audit\n4.Adding a new final audit question\n5. Starting a final audit schedule\n\nAll report plans in the base application require final audit. The final audit notifies the billing system to release the deposit. Most insurers require a final audit for Workers' Compensation policies. For other lines of business, the rules vary.",
      "narration": "In this demonstration, we'll explore scheduling a final audit, viewing audit schedules, and editing or waiving audits. Observe how PolicyCenter's interface allows you to manage audits efficiently, ensuring they're aligned with billing requirements. This practical walkthrough will reinforce your understanding of how final audits integrate into the overall policy lifecycle.",
      "ocrText": "| Demonstration G\n\nFinal audit\n\nclick here\n\nNote: The demonstration opens a new tab in your browser. When the demonstration ends, the\noriginal course launch window appears. Return to this window to continue this presentation.",
      "ocrWordCount": 35,
      "ocrConfidence": 95.57,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_instruction"
    },
    {
      "slideNumber": 14,
      "title": "Revising Final Audits",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Process for revising a completed final audit.",
      "narration": "Revising a final audit involves withdrawing the original audit and creating a new one to incorporate changes. This ensures that any updates are accurately reflected in the policy's financials. PolicyCenter handles this process seamlessly, notifying the billing system of reversals and updates, which maintains consistency across systems and reduces the risk of billing errors.",
      "ocrText": "",
      "ocrWordCount": 0,
      "ocrConfidence": 0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_video"
    },
    {
      "slideNumber": 15,
      "title": "Revising Completed Audits",
      "bodyParagraphs": [],
      "originalNotes": "Revising final audit\nIf changes to a completed final audit are needed, it can be revised. Revising a Final Audit withdraws the original audit, so the new audit can incorporate changes made by another job. PolicyCenter notifies the billing system that the first audit is reversed and will be replaced by a new audit. The new final audit is created automatically when the previous version is revised.",
      "notes": "Revising final audit\nIf changes to a completed final audit are needed, it can be revised. Revising a Final Audit withdraws the original audit, so the new audit can incorporate changes made by another job. PolicyCenter notifies the billing system that the first audit is reversed and will be replaced by a new audit. The new final audit is created automatically when the previous version is revised.",
      "narration": "Revisions to completed audits are sometimes necessary when new information arises. In PolicyCenter, revising a final audit involves reversing the initial audit and generating a new one. This process ensures that all changes are captured and reflected in billing, maintaining accuracy across the board. It's a critical part of handling dynamic business environments where changes are inevitable.",
      "ocrText": "| Revising final audit G\n\n¢ Revising a final audit cancels the original audit, so a new audit can incorporate\nchanges made by another job\n\n¢ Revision occurs\n\n* on policies that have completed final audit\n\n* as a result of cancellation, policy change, reinstatement, or manual revision\n\nBilling system\n\n. notifies\n. ————— >\n\nPolicyCenter\n\nReverses charges related to final audit,\n\nCreates a new audit Sets reversal date to current date",
      "ocrWordCount": 72,
      "ocrConfidence": 90.07,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 16,
      "title": "Premium Reports for Workers' Compensation",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Understanding premium reports and their role in workers’ compensation policies.",
      "narration": "Premium reports serve as interim audits within a policy period, particularly useful for workers' compensation with variable bases like seasonal payrolls. These reports help adjust premiums more accurately throughout the term, ensuring that the amounts billed align closely with actual exposures. This proactive adjustment reduces the likelihood of large discrepancies at policy term end, facilitating smoother financial operations.",
      "ocrText": "| Student exercise\n\nPremium Audits —\nFinal Audits",
      "ocrWordCount": 8,
      "ocrConfidence": 94.67,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "exercise"
    },
    {
      "slideNumber": 17,
      "title": "Steps for Premium Reports",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "General process for conducting premium reports.",
      "narration": "Premium reports are scheduled similarly to final audits but occur more frequently within the policy term. The process involves scheduling, executing, and potentially waiving reports based on business needs. This flexibility allows insurers to maintain accurate premium records throughout the policy lifecycle, ensuring financial stability and minimizing surprises at term end.",
      "ocrText": "Darren\nInsurance\nProduct Manager\n\nHow can | schedule and work with\npremium reports in PolicyCenter?",
      "ocrWordCount": 15,
      "ocrConfidence": 92.25,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 18,
      "title": "Adding New Premium Reports",
      "bodyParagraphs": [],
      "originalNotes": "Premium reports: workers’ compensation policies\nPremium report:\nis sent by a insurer’s premium audit department\n by default, audit method is Voluntary\nPremium reports may be used when the insured-\nis not able to accurately predict payroll\nhas variable basis, such as seasonal variations\n\nPremium reports are a type of audit created for interim periods within a policy period- Premium reporting audits adjusted estimated data, such as payroll, inventory, and construction reports. The primary distinction between the two types of audit is:\nPremium Report is an optional way to bill premiums throughout the policy term\nFinal Audit bills an accurate premium for the entire policy term.\n\nPremium Reports are configured for the workers’ compensation LOBs in the base application, but they can be configured for other LOBs using Guidewire Studio.  Premium Report attempts to ensure that the premium billed is close to the final audit amount. In most cases, the bills are more accurate than an estimate. For direct bill policies, the insured sends payment along with the report. If a report is not submitted in a timely fashion,  the insurer can cancel the policy.\n\nThe insured may choose premium reports because they are unable to accurately predict payroll in advance or they have variable basis, i.e.,  seasonal payroll variations.  Others may choose premium reports because they end up paying only the premiums that are actually owed. This may be preferred to paying in advance or agreeing to an estimated amount.",
      "notes": "Premium reports: workers’ compensation policies\nPremium report:\nis sent by a insurer’s premium audit department\n by default, audit method is Voluntary\nPremium reports may be used when the insured-\nis not able to accurately predict payroll\nhas variable basis, such as seasonal variations\n\nPremium reports are a type of audit created for interim periods within a policy period- Premium reporting audits adjusted estimated data, such as payroll, inventory, and construction reports. The primary distinction between the two types of audit is:\nPremium Report is an optional way to bill premiums throughout the policy term\nFinal Audit bills an accurate premium for the entire policy term.\n\nPremium Reports are configured for the workers’ compensation LOBs in the base application, but they can be configured for other LOBs using Guidewire Studio.  Premium Report attempts to ensure that the premium billed is close to the final audit amount. In most cases, the bills are more accurate than an estimate. For direct bill policies, the insured sends payment along with the report. If a report is not submitted in a timely fashion,  the insurer can cancel the policy.\n\nThe insured may choose premium reports because they are unable to accurately predict payroll in advance or they have variable basis, i.e.,  seasonal payroll variations.  Others may choose premium reports because they end up paying only the premiums that are actually owed. This may be preferred to paying in advance or agreeing to an estimated amount.",
      "narration": "Adding a new premium report involves configuring the policy for additional reports beyond what's originally scheduled. This can be necessary when changes occur mid-term, such as policy endorsements or shifts in business operations. By managing these reports effectively, insurers can ensure that premiums reflect current exposures, maintaining financial accuracy and reducing end-term adjustments.",
      "ocrText": "| Premium reports: workers’ compensation policies [5\n\nPremium report Premium report Final audit\n\nFa Fa --Fl\n\nPolicy term (estimate > actual)\n\n« Apply to workers’ compensation policies\n\n¢« Apremium report is a premium bill issued at regular intervals throughout the\npolicy term based on reported values\n\n¢ All premium reporting policies must have a final audit at term end to determine\nthe entire policy premium",
      "ocrWordCount": 65,
      "ocrConfidence": 91.61,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 19,
      "title": "Demonstration: Premium Reports",
      "bodyParagraphs": [],
      "originalNotes": "Premium reports general steps\nIf the payment type is premium reporting, PolicyCenter schedules premium reports when a workers’ compensation rewrite, submission, or renewal is issued. Other jobs, such as policy change, reinstatement, or cancellation can revise the reporting schedule. The batch process uses the process start date to determine when to begin each premium report. The selected premium report is waived, however, a new premium report may be scheduled manually for the waived period. The slide diagram displays the steps necessary to conduct a premium report These steps are for the default configuration of PolicyCenter. Insurers business requirements can alter the process.",
      "notes": "Premium reports general steps\nIf the payment type is premium reporting, PolicyCenter schedules premium reports when a workers’ compensation rewrite, submission, or renewal is issued. Other jobs, such as policy change, reinstatement, or cancellation can revise the reporting schedule. The batch process uses the process start date to determine when to begin each premium report. The selected premium report is waived, however, a new premium report may be scheduled manually for the waived period. The slide diagram displays the steps necessary to conduct a premium report These steps are for the default configuration of PolicyCenter. Insurers business requirements can alter the process.",
      "narration": "In this demonstration, we'll cover how to schedule premium reports, view and edit schedules, and manage report data. Pay attention to how PolicyCenter's tools facilitate these tasks, helping you maintain premium accuracy throughout the policy term. This hands-on walkthrough will solidify your understanding of premium reports' role in effective policy management.",
      "ocrText": "| Premium reports general steps\n\nSchedule Audit task batch process\npremium faa Starts each premium\nreports report\n\nWaive\npremium\nreport\n\n<— premium\nreport?\n\nBilling system reconci\nreceived with PC amount $n\nmake necessary adjustments\n\nNo Conduct Yes Send report to\n\ninsured to get\naudit basis\n\nEnter report data\nreceived and\n\ncalculate premium\n\nnotified with\npayment received",
      "ocrWordCount": 56,
      "ocrConfidence": 93.03,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_instruction"
    },
    {
      "slideNumber": 20,
      "title": "Summary and Transition to Rating",
      "bodyParagraphs": [],
      "originalNotes": "Adding a new Premium Report\nSimilar to revising a final audit, a premium report can be reversed, however, it does not create a new premium report after it is reversed. A user must explicitly add the premium report and process it.\n\nPolicy Center lets you add a premium report to a policy for any unreported portion of a policy period. A premium report may be added to a policy in the following example cases:\nThe policy originally had eleven ( 11) monthly reports plus a final audit The underwriter wants to add a 12th report instead of waiting for the final audit to collect the final month's premium.\nA user submits a policy change on a policy with one or more completed reports.  These reports must be reversed and added. \nThe user waived a period and wants to add it again.",
      "notes": "Adding a new Premium Report\nSimilar to revising a final audit, a premium report can be reversed, however, it does not create a new premium report after it is reversed. A user must explicitly add the premium report and process it.\n\nPolicy Center lets you add a premium report to a policy for any unreported portion of a policy period. A premium report may be added to a policy in the following example cases:\nThe policy originally had eleven ( 11) monthly reports plus a final audit The underwriter wants to add a 12th report instead of waiting for the final audit to collect the final month's premium.\nA user submits a policy change on a policy with one or more completed reports.  These reports must be reversed and added. \nThe user waived a period and wants to add it again.",
      "narration": "We've covered the essentials of premium audits, including types, methods, and processes within PolicyCenter. Understanding these concepts ensures accurate premium calculations and compliance with regulatory standards. As we conclude this lesson, get ready to dive into rating basics next, where we'll explore how premiums are calculated and adjusted based on risk factors. Stay tuned for more insights into PolicyCenter's robust capabilities.",
      "ocrText": "| Adding a new Premium Report Gi\n\n« Premium reports can be reversed, which cancels the original report and notifies\nthe billing system\n\n« Anew premium report can be added if it is missing or as a result of being reversed\nor waived\n\nSubmit\n\nPremium report Reverse\nCompleted Exe Reversed\neee\nPremium Report\n\nWaive\n\nAnew Premium\nReport can be added",
      "ocrWordCount": 60,
      "ocrConfidence": 89.8,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 21,
      "title": "",
      "bodyParagraphs": [],
      "originalNotes": "Demonstration\nHow to schedule a premium report payment plan choice on the Payment page (workers’  comp). The audit schedule determines the frequency and number of premium reports\n1.Show the Audit Schedule .\n2.Describe the reporting trend analysis (Premiums Page).\n3.View premium report audit schedule\n4.Start the Premium report audit schedule.\n5.Edit or waive the premium report.\n6.Add a new final audit or premium report\n7.PolicyCenter lets you add a premium report to a policy for any unreported portion of a policy period.\n8.View the premium report data (Audit Summary) using the link in the schedule, and view Details and Premium information.",
      "notes": "Demonstration\nHow to schedule a premium report payment plan choice on the Payment page (workers’  comp). The audit schedule determines the frequency and number of premium reports\n1.Show the Audit Schedule .\n2.Describe the reporting trend analysis (Premiums Page).\n3.View premium report audit schedule\n4.Start the Premium report audit schedule.\n5.Edit or waive the premium report.\n6.Add a new final audit or premium report\n7.PolicyCenter lets you add a premium report to a policy for any unreported portion of a policy period.\n8.View the premium report data (Audit Summary) using the link in the schedule, and view Details and Premium information.",
      "narration": "",
      "ocrText": "| Demonstration G\n\nPremium reports\n\nclick here\n\nNote: The demonstration opens a new tab in your browser. When the demonstration ends, the\noriginal course launch window appears. Return to this window to continue this presentation.",
      "ocrWordCount": 35,
      "ocrConfidence": 95.57,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_instruction"
    },
    {
      "slideNumber": 22,
      "title": "",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "",
      "ocrWordCount": 0,
      "ocrConfidence": 0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_video"
    },
    {
      "slideNumber": 23,
      "title": "",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Question G\n\n_~ — What are the two types of premium audit?\n\n4\n¢\n¢\n\nSoS oD DD DDS De Say",
      "ocrWordCount": 21,
      "ocrConfidence": 60.7,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question"
    },
    {
      "slideNumber": 24,
      "title": "",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Answer Gi\n\nae What are the two types of premium audit?\n\n¢\n¢\n\nThe two types of premium audit are: final audits and premium reports.\n\nA final audit contains the verified, ultimate cost for a variable basis policy and usually\noccurs at the end of the policy term.\n\nApremium report is a premium bill issued at regular intervals throughout policy term\nbased on reported values.\n\nSop DD DD SDSS oe",
      "ocrWordCount": 70,
      "ocrConfidence": 87.62,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 25,
      "title": "",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Question G\n\n,~ — What are the different audit roles available in PolicyCenter?\n\n4\n¢\n¢\n\nSoS oD DD DDS De Say",
      "ocrWordCount": 22,
      "ocrConfidence": 57.25,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question"
    },
    {
      "slideNumber": 26,
      "title": "",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Answer Gi\n\n,~ — What are the different audit roles available in PolicyCenter?\n\n¢\n¢\n¢\n\nThe different roles in PolicyCenter are premium auditor, audit examiner, and audit\nsupervisor.\n\nSop DD DD SDSS oe",
      "ocrWordCount": 34,
      "ocrConfidence": 72.53,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 27,
      "title": "",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Question\n\n_~ — Whatare the different premium audit methods?\n\n4\n¢\n¢\n\nSoS oD DD DDS De Say",
      "ocrWordCount": 18,
      "ocrConfidence": 57.6,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question"
    },
    {
      "slideNumber": 28,
      "title": "",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Answer Gi\n\n,~ — What are the different premium audit methods?\n¢\n\n¢\n¢\n\nThe different audit methods are physically, by phone, voluntary or estimated.\n\nSop DD DD SDSS oe",
      "ocrWordCount": 30,
      "ocrConfidence": 69.41,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 29,
      "title": "",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "Lesson\nobjectives ¢ Describe different types of premium audits,\n\nI namely final audits and premium reports\nreview ¢ Work with final audits and premium reports in\n\nthe application",
      "ocrWordCount": 28,
      "ocrConfidence": 90.39,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "objectives_review"
    },
    {
      "slideNumber": 30,
      "title": "",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "",
      "narration": "",
      "ocrText": "I Student exercise\n\nPremium Audits —\nPremium Reports",
      "ocrWordCount": 8,
      "ocrConfidence": 87.56,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "exercise"
    }
  ],
  "videos": [
    {
      "index": 1,
      "filename": "In_Policy_30_01.mp4",
      "path": "/academy/guidewire/videos/ch04/In_Policy_30_01.mp4"
    }
  ],
  "hasNotes": true,
  "hasTables": false,
  "hasImages": true,
  "ocrMetadata": {
    "totalWords": 1037,
    "avgConfidence": 85.61,
    "extractedAt": "2026-02-13T12:08:02.094692"
  }
}