{
  "lessonId": "ch04-l28",
  "chapterId": 4,
  "chapterSlug": "ch04",
  "lessonNumber": 28,
  "title": "Validation",
  "sourceFile": "In_policy_29 Validation.pptx",
  "sourceFolder": "In_policy_28",
  "totalSlides": 16,
  "estimatedMinutes": 48,
  "slides": [
    {
      "slideNumber": 1,
      "title": "Introduction to Validation in PolicyCenter",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Introduce validation in PolicyCenter and its role in ensuring data integrity and adherence to business rules.",
      "narration": "Welcome to our lesson on Validation in PolicyCenter. In this session, we'll explore how validation ensures data integrity and enforces business rules across PolicyCenter. Understanding validation is crucial, as it dictates how data is entered, saved, and processed. We'll delve into different types of validations, from field-level checks to comprehensive job-level evaluations, to ensure your PolicyCenter implementation maintains high data quality standards.",
      "ocrText": "Validation",
      "ocrWordCount": 1,
      "ocrConfidence": 95.33,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "title"
    },
    {
      "slideNumber": 2,
      "title": "Understanding the Data Model",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Discuss the importance of the data model and how validation interacts with entities and fields.",
      "narration": "Before diving deeper, let's consider the data model in PolicyCenter. It's the backbone of how data is structured, and validation is intricately tied to it. Each entity and field can have specific validation rules that ensure only correct and consistent data enters your system. Understanding this relationship is fundamental for customizing validation to meet your unique business needs.",
      "ocrText": "Lesson\nobjectives\n\nDescribe validation with field validators\nDescribe validation during save\n\nDescribe validation at some level during a job\nDescribe warnings and errors",
      "ocrWordCount": 23,
      "ocrConfidence": 95.65,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "objectives"
    },
    {
      "slideNumber": 3,
      "title": "The Role of PCF Configuration",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Explain how PCF files are used to configure the UI and validation behavior.",
      "narration": "PCF files, or Page Configuration Files, are where the magic of UI configuration happens in PolicyCenter. They don't just dictate layout—they also influence validation behavior. By configuring fields as required or defining input masks, you're setting the stage for how users interact with the system. Mastering PCF configuration allows you to tailor the user experience and maintain data accuracy effortlessly.",
      "ocrText": "Gi\n\nMarcus A +\nBusiness | need to write requirements that ensure that\nnalys' ©\n\nthe business data is valid. For example, we\n\nneed to validate addresses. How does\n\nPolicyCenter validate information that the user\n• has entered?",
      "ocrWordCount": 38,
      "ocrConfidence": 88.31,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 4,
      "title": "Gosu and Validation Logic",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Explore the use of Gosu programming language in implementing custom validation logic.",
      "narration": "Gosu is a powerful ally when it comes to implementing custom validation logic in PolicyCenter. While standard validations cover many cases, Gosu enables you to script complex checks that align with specific business rules. Whether you're handling intricate calculations or conditional validations, Gosu provides the flexibility to enforce the rules that matter most to your organization.",
      "ocrText": "| Validation basics G\n\n• Validation is a check executed by PolicyCenter prior to a given action, to ensure\nthat the current business data is valid\n\n« Ensures that the user enters data that makes sense\n* Ensures that the user enters all necessary data\n+ Manages relationships between data fields\n• Validation behaviors:\n* Validation with field validators\n* Validation during a save, such as clicking ‘update’\n\n« Using validation levels in a transaction which are run at certain points in a transaction",
      "ocrWordCount": 84,
      "ocrConfidence": 87.15,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 5,
      "title": "Validation with Field Validators",
      "bodyParagraphs": [],
      "originalNotes": "Validation with field validators\nA field validator is a pattern tied to one or more fields in the data model. If a field value does not match the prescribed pattern, data cannot be saved and an error message is displayed. Field validators are useful when the validation logic involves simple pattern matching and the pattern holds true every time the field is used. Input-masks can be specified at the data model level or in a user interface ( Ul) widget's property, so that certain information is stored in a certain format. For example, the digits in zip code or postal codes are separated by and SSN numbers or official IDs are also separated by after a pre- determined number of digits. An input mask appears as a field watermark, and disappears when the user enters data in the field. For example, in Date of Birth, the input mask restricts the user input which must match a prescribed pattern.",
      "notes": "Validation with field validators\nA field validator is a pattern tied to one or more fields in the data model. If a field value does not match the prescribed pattern, data cannot be saved and an error message is displayed. Field validators are useful when the validation logic involves simple pattern matching and the pattern holds true every time the field is used. Input-masks can be specified at the data model level or in a user interface ( Ul) widget's property, so that certain information is stored in a certain format. For example, the digits in zip code or postal codes are separated by and SSN numbers or official IDs are also separated by after a pre- determined number of digits. An input mask appears as a field watermark, and disappears when the user enters data in the field. For example, in Date of Birth, the input mask restricts the user input which must match a prescribed pattern.",
      "narration": "Field validators are your go-to solution for ensuring data consistency at the field level. These validators check whether input matches a specified pattern, such as zip codes or SSNs, before allowing data to be saved. By using input masks at the data model or UI level, you help guide users in entering data correctly, enhancing both user experience and data integrity.",
      "ocrText": "| Validation with field validators\n\n• Field validators handle simple validation for a single field\n« Must match patterns or input-masks specified by the field validator\n\n• Restricts user inputs\n\nSSN",
      "ocrWordCount": 31,
      "ocrConfidence": 90.26,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 6,
      "title": "Validation When Data is Saved",
      "bodyParagraphs": [],
      "originalNotes": "Validation when data is saved\nA field marked as required must contain a value. The user cannot proceed to the next page or screen without entering a value in the required field. There is a required property on the field in PCF that can be configured to make a field required. The validatable entities are those marked at the data model level which will trigger validation before data is committed to the database.",
      "notes": "Validation when data is saved\nA field marked as required must contain a value. The user cannot proceed to the next page or screen without entering a value in the required field. There is a required property on the field in PCF that can be configured to make a field required. The validatable entities are those marked at the data model level which will trigger validation before data is committed to the database.",
      "narration": "When it comes to saving data, required fields play a pivotal role. Configuring a field as required in a PCF ensures that users must provide input before proceeding. Additionally, validatable entities invoke validation processes before data is committed to the database, ensuring that only complete and accurate records are stored. This mechanism is vital for maintaining high-quality data throughout the system.",
      "ocrText": "| Validation when data is saved\n\n• Consists of coded validation checks\n\n* In the user interface, required fields are marked with an asterisk\n« In the business rules for validated entities\n\n• Checked before validatable entity is committed to database\n\nNew Producer Code\n\n@ Code: Missing required field \"Code\"\n\nBasics | Roles | Groups | Users\n\nRequired field ———[]\n\nDescription\n\nOrganization * | Builders’ Risk brokers Q",
      "ocrWordCount": 68,
      "ocrConfidence": 87.06,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 7,
      "title": "Validation at Various Job Stages",
      "bodyParagraphs": [],
      "originalNotes": "Validation at some level during a job\nConditions during a job (policy transaction) may return a warning or an error depending on the level within the job. This can be configured to have the desired validation results. Some validation levels are Load and Save, Default, Quick Quotable, Quotable, Bindable and Ready for Issue. For example, if a Personal Auto submission in the base application does not have a vehicle defined, and the user attempts to navigate away from the Vehicles page, the IJI will display a warning message so the user can enter other policy data and return to the Vehicles page later. An error message will be displayed when the Quote button is clicked; a vehicle must be entered in order to receive a valid quote.",
      "notes": "Validation at some level during a job\nConditions during a job (policy transaction) may return a warning or an error depending on the level within the job. This can be configured to have the desired validation results. Some validation levels are Load and Save, Default, Quick Quotable, Quotable, Bindable and Ready for Issue. For example, if a Personal Auto submission in the base application does not have a vehicle defined, and the user attempts to navigate away from the Vehicles page, the IJI will display a warning message so the user can enter other policy data and return to the Vehicles page later. An error message will be displayed when the Quote button is clicked; a vehicle must be entered in order to receive a valid quote.",
      "narration": "In PolicyCenter, validations are not limited to data entry alone—they extend to various stages of a policy job. Depending on the job level, such as Load, Save, or Quote, validations can trigger warnings or errors. For instance, a missing vehicle in a Personal Auto submission might raise a warning during navigation but will prevent quoting without resolution. This layered validation approach ensures that critical data is captured at the right time.",
      "ocrText": "| Validation at some level during a job Gi\n\n* Consists of validation checks coded in Gosu classes\n* In base application, used for validation associated to policy objects\n* Can be checked at any time when validation is required\n\n* Can be configured to display either a warning or an error based on the level in the\n\njob\n5 .\niy Vehicles\nVe c les Validation Results\nThere is a Message on another page Validation Results\nA The policy must specify at least one vehicle.\nThere is a Message on another page\n@ The policy must specify at least one vehicle.\n\nOn Save (navigating away from page\n( gating y page) At Quote",
      "ocrWordCount": 114,
      "ocrConfidence": 89.87,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 8,
      "title": "Handling Warnings and Errors",
      "bodyParagraphs": [],
      "originalNotes": "Warnings and errors\nAfter PolicyCenter detects a validation issue, a message is displayed showing errors and warnings. Clearing a validation warning does not remove or correct the issue, you will be able to continue entering data . Fields in the user interface can be validated, however, situations causing the error must be rectified before the user can reattempting the same action. For example, the •Quote\" button may have been clicked, and an error issued. In order to \"Quote“ successfully, the error must be fixed . However, they can •continue\" taking other actions including, but not limited to, the ones required to fix the error.",
      "notes": "Warnings and errors\nAfter PolicyCenter detects a validation issue, a message is displayed showing errors and warnings. Clearing a validation warning does not remove or correct the issue, you will be able to continue entering data . Fields in the user interface can be validated, however, situations causing the error must be rectified before the user can reattempting the same action. For example, the •Quote\" button may have been clicked, and an error issued. In order to \"Quote“ successfully, the error must be fixed . However, they can •continue\" taking other actions including, but not limited to, the ones required to fix the error.",
      "narration": "When PolicyCenter detects validation issues, it presents them as warnings or errors. Warnings inform users of potential issues but allow them to continue, while errors must be resolved before proceeding. This distinction helps users prioritize actions and ensures that critical errors are addressed promptly to maintain data integrity and process continuity.",
      "ocrText": "| Warnings and errors Gi\n\n• PolicyCenter displays warning/error messages in the UI if a problem is detected\n« Warnings\n\n« Warnings are non-blocking\n\n« User can continue with the action without clearing the warning\n\n* It is recommended to clear the warnings as they appear\n\nA There are no assigned drivers for vehicle(s) #1.\n• Errors\n* Errors are blocking\n\n* Situations causing error must be rectified before reattempting the same action\n\n@ Written Date: Missing required field \"Written Date\"",
      "ocrWordCount": 81,
      "ocrConfidence": 84.96,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 9,
      "title": "Appearance of Warnings and Errors",
      "bodyParagraphs": [],
      "originalNotes": "Warning and error appearance\nThe first image shows that if the error or warning is on the current page then it is displayed on the top of that page. This behavior can vary across PolicyCenter. The second image shows that the user is on the Policy Review page and the error is on the Vehicles page. PolicyCenter usually displays a link to Vehicles\npage in the worksheet (at the bottom) where the error is displayed. The errors or warnings may appear at the bottom on a worksheet during save if it calls the validation methods. Othewise, they will appear on the top of the page.",
      "notes": "Warning and error appearance\nThe first image shows that if the error or warning is on the current page then it is displayed on the top of that page. This behavior can vary across PolicyCenter. The second image shows that the user is on the Policy Review page and the error is on the Vehicles page. PolicyCenter usually displays a link to Vehicles\npage in the worksheet (at the bottom) where the error is displayed. The errors or warnings may appear at the bottom on a worksheet during save if it calls the validation methods. Othewise, they will appear on the top of the page.",
      "narration": "The presentation of warnings and errors in PolicyCenter is strategically designed to guide users. Errors on the current page appear at the top, while those from other pages might include links to navigate users directly to the source of the issue. This approach ensures that users are always aware of where to make corrections, streamlining the problem-solving process and enhancing the overall user experience.",
      "ocrText": "| Warning and error appearance\n\n• Attop of page\n\n• Most errors appear during save, such as\nmissing required fields\n\n« Warnings in a job on the current page\n\n• At the bottom on the worksheet\n\n* During a save that calls validation rules using\nspecial validation methods\n\n« When clicking Quote or Bind buttons in a job\n\n* Displays a message about the page when\nthe user is on a different page from where the\nerror occurred\n\n| There is a Message on another page\n\nA. There are no assigned drivers for vehicle(s) # 1.\n\nr PA Coverages\n\nLiability - Bodily Injury and Property Damage\n\nValidation Results\n\nValidation Results\n\n© There are no assigned drivers for vehicle(s) # 1.",
      "ocrWordCount": 120,
      "ocrConfidence": 88.04,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 10,
      "title": "Customizing Validation Messages",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Discuss how developers can customize validation messages for clarity and user guidance.",
      "narration": "Developers have the ability to customize validation messages, providing clarity and guidance to users. By crafting messages that are specific and informative, you can reduce user frustration and improve data entry accuracy. Custom messages can also reflect your organization's tone and terminology, creating a more cohesive user experience.",
      "ocrText": "| Demonstration G\n\nValidation basics\n\nclick here\n\nNote: The demonstration opens a new tab in your browser. When the demonstration ends, the\noriginal course launch window appears. Return to this window to continue this presentation.",
      "ocrWordCount": 35,
      "ocrConfidence": 95.54,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_instruction",
      "demoVideoIndex": 0
    },
    {
      "slideNumber": 11,
      "title": "Demo: Implementing a Field Validator",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Guide viewers through a demo of creating and applying a field validator.",
      "narration": "In this demo, we'll walk through the process of implementing a field validator in PolicyCenter. Watch as we define a pattern for a field, apply it to a PCF, and test its behavior during data entry. Pay attention to how the input mask guides user input and how errors are displayed if the pattern isn't matched. This practical example will highlight the power of field validators in ensuring data consistency.",
      "ocrText": "",
      "ocrWordCount": 0,
      "ocrConfidence": 0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_video"
    },
    {
      "slideNumber": 12,
      "title": "Demo: Custom Validation Logic with Gosu",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Show how to use Gosu for custom validation logic, enhancing standard validation capabilities.",
      "narration": "Now, let's explore how to leverage Gosu for custom validation logic. We'll demonstrate scripting a complex validation scenario that goes beyond standard capabilities. Observe how Gosu's flexibility allows you to implement intricate business rules, ensuring your validation logic is both robust and adaptable to changing requirements.",
      "ocrText": "Question\nWhat are the three types of PolicyCenter validation?\n•\n•",
      "ocrWordCount": 20,
      "ocrConfidence": 66.24,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question",
      "questionData": {
        "question": "What are the three types of PolicyCenter validation?",
        "answer": "Validation with field validators, validation during save and validation on demand which\ncan be run in a job wizard step or at a certain time in a job."
      }
    },
    {
      "slideNumber": 13,
      "title": "Best Practices for Validation",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Highlight key best practices for implementing validation effectively in PolicyCenter.",
      "narration": "Implementing validation effectively requires adherence to best practices. Focus on keeping validation logic as simple and clear as possible, and utilize field validators for consistent patterns. Remember to test thoroughly to ensure validations work as intended and provide meaningful feedback to users. These practices will help maintain data quality and enhance user satisfaction.",
      "ocrText": "Answer\nWhat are the three types of PolicyCenter validation?\n•\n•\nValidation with field validators, validation during save and validation on demand which\ncan be run in a job wizard step or at a certain time in a job.\nSooo ooo ooo Oooo oOoD",
      "ocrWordCount": 45,
      "ocrConfidence": 89.71,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 14,
      "title": "Common Validation Challenges",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Discuss typical challenges developers face with validation and how to overcome them.",
      "narration": "Even with robust validation systems, challenges can arise. Common issues include overly complex validation logic, performance impacts, and user confusion. To overcome these, prioritize simplicity, optimize validation checks, and provide clear error messages. By addressing these challenges head-on, you can ensure a smooth and effective validation process.",
      "ocrText": "Question\nWhat is the difference between an error and a waming?\n•\n•",
      "ocrWordCount": 22,
      "ocrConfidence": 63.68,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question",
      "questionData": {
        "question": "What is the difference between an error and a waming?",
        "answer": "Errors block the action that the user was taking. Warnings are non-blocking and allow\nthe user to proceed to the next step and continue performing actions."
      }
    },
    {
      "slideNumber": 15,
      "title": "Summary of Validation Concepts",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Recap the key points from the lesson, reinforcing the importance of validation.",
      "narration": "As we wrap up, let's recap the key concepts of validation in PolicyCenter. We've covered field validators, required fields, job-level validations, and the role of Gosu. Each of these components plays a critical role in maintaining data integrity and enforcing business rules. By understanding and applying these concepts, you'll ensure that your PolicyCenter implementation is both robust and reliable.",
      "ocrText": "Answer\nWhat is the difference between an error and a waming?\n•\n•\n•\nErrors block the action that the user was taking. Warnings are non-blocking and allow\nthe user to proceed to the next step and continue performing actions.\nSooo ooo ooo Oooo oOoD",
      "ocrWordCount": 47,
      "ocrConfidence": 87.59,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 16,
      "title": "Preview of Next Lesson: Premium Audits",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Introduce the next lesson on Premium Audits and its relevance to PolicyCenter.",
      "narration": "Looking ahead, our next lesson will dive into Premium Audits. This topic is essential for understanding how PolicyCenter handles post-bind activities to ensure accurate policy premiums. Stay tuned to learn how audits can uncover discrepancies and adjust premiums accordingly, further enhancing your policy administration capabilities.",
      "ocrText": "Lesson\nobjectives\nreview\n\nDescribe validation with field validators\nDescribe validation during save\n\nDescribe validation at some level during a job\nDescribe warnings and errors",
      "ocrWordCount": 24,
      "ocrConfidence": 95.71,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "objectives_review"
    }
  ],
  "videos": [
    {
      "index": 1,
      "filename": "In_Policy_29_01.mp4",
      "path": "/academy/guidewire/videos/ch04/In_Policy_29_01.mp4"
    }
  ],
  "hasNotes": true,
  "hasTables": false,
  "hasImages": true,
  "ocrMetadata": {
    "totalWords": 753,
    "avgConfidence": 87.01,
    "extractedAt": "2026-02-13T12:07:50.251960"
  }
}
