{
  "lessonId": "ch04-l11",
  "chapterId": 4,
  "chapterSlug": "ch04",
  "lessonNumber": 11,
  "title": "Users and groups",
  "sourceFile": "In_policy_12_ Users and groups.pptx",
  "sourceFolder": "In_policy_11",
  "totalSlides": 22,
  "estimatedMinutes": 66,
  "slides": [
    {
      "slideNumber": 1,
      "title": "Introduction to Users and Groups in PolicyCenter",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "This chapter introduces the concepts of users and groups within PolicyCenter, setting the foundation for understanding how roles and responsibilities are managed. The lesson covers user types, group management, and the significance of producer codes.",
      "narration": "Welcome to our deep dive into Users and Groups within Guidewire PolicyCenter. This lesson is crucial for understanding how responsibilities and workflows are structured in the insurance domain. We'll explore the various user types, how groups are configured, and the role of producer codes in aligning tasks with organizational goals. Let's get started by understanding the core concepts that form the backbone of user management in PolicyCenter.",
      "ocrText": "Users and Groups",
      "ocrWordCount": 3,
      "ocrConfidence": 95.6,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "title"
    },
    {
      "slideNumber": 2,
      "title": "Understanding User Roles",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Images illustrate the different roles users can have in PolicyCenter such as underwriters, customer service representatives, and producers.",
      "narration": "The roles users play in PolicyCenter are diverse, reflecting the complex nature of insurance operations. As you can see, users might serve as underwriters, CSRs, or producers, each with unique responsibilities. These roles dictate the kind of transactions they can perform and their level of interaction with policies. Understanding these roles is key to configuring PolicyCenter to match your organization's workflow.",
      "ocrText": "Lesson\nobjectives\n\n• Describe and manage Users\n* Describe and manage Groups\n« Use the Team tab",
      "ocrWordCount": 17,
      "ocrConfidence": 85.18,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "objectives"
    },
    {
      "slideNumber": 3,
      "title": "User Group Dynamics",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Images depict how users belong to different groups, showing the organizational structure within PolicyCenter.",
      "narration": "Moving on to how users fit within groups, this visual helps clarify the structure. Groups are essentially the building blocks of your organizational hierarchy in PolicyCenter. They help streamline processes by grouping users based on department, geography, or function. This setup is crucial for managing workloads and ensuring that policy tasks are seamlessly assigned and executed.",
      "ocrText": "Marci |\nConfiguration Yam\nDeveloper _.\n\nHow can | create and organize users who work\n_{ with PolicyCenter?\n\nJulia §\nImplementation\n\nYou can manage them through Architect We\nthe community model, which\nincludes users, groups,\norganizations, and producer\ncodes.\n\nbt",
      "ocrWordCount": 40,
      "ocrConfidence": 87.05,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 4,
      "title": "Defining Users in PolicyCenter",
      "bodyParagraphs": [],
      "originalNotes": "Users\nEach policy is usually managed by several users. Every user assigned to a policy has a role to play on that policy, such as an underwriter, a customer service representative or a producer.\nA user can:\n\nperform policy transactions or look up the status of a policy\nmanage activities, assignment rules, notes, attached documents, history, team views and more\nbelong to one or more groups",
      "notes": "Users\nEach policy is usually managed by several users. Every user assigned to a policy has a role to play on that policy, such as an underwriter, a customer service representative or a producer.\nA user can:\n\nperform policy transactions or look up the status of a policy\nmanage activities, assignment rules, notes, attached documents, history, team views and more\nbelong to one or more groups",
      "narration": "In PolicyCenter, users are the actors who drive policy processes forward. Each user has a specific role, whether it's underwriting, customer service, or sales. These roles determine the transactions they can perform and their interaction with policies. Users are not isolated; they manage activities, handle assignments, and can belong to multiple groups. This multifaceted structure ensures that policy management is both comprehensive and flexible.",
      "ocrText": "| Users Gi\n\nA user is an individual who interacts with PolicyCenter\n\nProducer\n\nbd Underwriter\n. —9\n\n1\n@\nCc Supervisor\n\nAuditor",
      "ocrWordCount": 22,
      "ocrConfidence": 79.79,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 5,
      "title": "Exploring User Types",
      "bodyParagraphs": [],
      "originalNotes": "User types\nTypically, the user belongs to at least one group that represents the actual reporting relationship found in the company’s organizational chart This is the main group that the user works in and includes the user’s supervisor. Users can belong to an unlimited number of groups or none at all.\nCaptive agents are sometimes internal, however, they are often external users that are not actually employees of the insurer. They have an exclusive contract to do business with that insurer and will often be modeled as external users. In other cases, they are, in fact, employees and would be modeled as intimal users. You can also have internal users who are customer service representatives (CSR) or an equivalent, who are not agents, but are selling policies through a call center and may be using producer codes.",
      "notes": "User types\nTypically, the user belongs to at least one group that represents the actual reporting relationship found in the company’s organizational chart This is the main group that the user works in and includes the user’s supervisor. Users can belong to an unlimited number of groups or none at all.\nCaptive agents are sometimes internal, however, they are often external users that are not actually employees of the insurer. They have an exclusive contract to do business with that insurer and will often be modeled as external users. In other cases, they are, in fact, employees and would be modeled as intimal users. You can also have internal users who are customer service representatives (CSR) or an equivalent, who are not agents, but are selling policies through a call center and may be using producer codes.",
      "narration": "Understanding user types is crucial for implementing effective policy management. Users can be internal, like CSRs, or external, such as captive agents. This distinction often depends on their contractual relationship with the insurer. Internal users are typically part of the organization’s hierarchy, reflected in group memberships that mirror the company's structure. Captive agents, while external, have exclusive contracts and are integrated differently, showcasing PolicyCenter's versatility in handling diverse user scenarios.",
      "ocrText": "| User types\n\nAn internal user is an employee of the insurer\n* Can potentially view an external user’s group and permissions\nAn external user is a person outside the company\n* Needs to access PolicyCenter data\n* Typically, producers\n« Must be associated with an organization\nCaptive agents are sometimes\n* Internal users when they are employees of the insurer or\n+ External users who have an exclusive contract to do business with an insurer\n\nAccess is controlled through roles and producer codes",
      "ocrWordCount": 84,
      "ocrConfidence": 91.44,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 6,
      "title": "Group Configuration in PolicyCenter",
      "bodyParagraphs": [],
      "originalNotes": "Groups\nA group is a collection of users, producer codes, queues, and regions. Administrators create groups based on:\n\ngeographic regions;\nDivisions; and\ndepartments\n\nEach group can also contain sub- groups which have their own users and producer codes. Users can belong to one or more groups. Group membership influences several PolicyCenter functionality aspects. For example, once a policy is assigned to a group, the assignment engine can automatically assign it to one of the users in the group using a round robin selection.",
      "notes": "Groups\nA group is a collection of users, producer codes, queues, and regions. Administrators create groups based on:\n\ngeographic regions;\nDivisions; and\ndepartments\n\nEach group can also contain sub- groups which have their own users and producer codes. Users can belong to one or more groups. Group membership influences several PolicyCenter functionality aspects. For example, once a policy is assigned to a group, the assignment engine can automatically assign it to one of the users in the group using a round robin selection.",
      "narration": "Groups in PolicyCenter are fundamental to organizing and automating workflows. They're more than just collections of users; they include producer codes, queues, and regions. This setup allows administrators to tailor the grouping to specific needs like geographic regions or departmental divisions. Once a policy is assigned to a group, the assignment engine can efficiently distribute tasks within the group, enhancing operational efficiency through automated assignments.",
      "ocrText": "Groups ee Gi\n@1(@\naeOn\n~~)\nee\n@ &2\n@\n\nus\n@ sa\\@\n(=),\nq@ly|\" &\nyy 9\nProducer\nUsers codes Queues Regions Groups",
      "ocrWordCount": 24,
      "ocrConfidence": 59.82,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 7,
      "title": "Group Hierarchies and Sub-Groups",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Images detail how groups can contain sub-groups, further refining task assignments and user roles within PolicyCenter.",
      "narration": "Here we delve into the hierarchical nature of groups. Sub-groups allow for a deeper level of organization within PolicyCenter, enabling precise task assignments and user management. This hierarchy ensures that the right tasks reach the right users, maintaining workflow efficiency even in complex organizational structures. Understanding this dynamic is vital for customizing PolicyCenter to fit your company's unique needs.",
      "ocrText": "Marci\nConfiguration\nDeveloper\n\nHow to work with users and groups?",
      "ocrWordCount": 10,
      "ocrConfidence": 95.91,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 8,
      "title": "Managing Users in PolicyCenter",
      "bodyParagraphs": [],
      "originalNotes": "Managing users\nAdministrators define users, assigning group membership, roles, credentials etc- Both the Team tab and theAdministration tab contain User Profile screens that\nallow administrators to define and edit these characteristics.\n\nUser information can be viewed and managed in the Administration tab- Users can use the left sidebar links to search or edit users, groups, organizations, regions, or producer codes. They can view, edit or create roles (discussed in detail in the Permisslons lesson). They can also define attributes that the system can use for making assignment decisions.\n\nWhen you create an external user, the fields and available values in the User sub-tabs change accordingly. External users must be associated with an Organization. The tree browser (as seen on the Administration tab) will always show the home organization of the user (either internal or external).\n\nTypically, the user belongs to at least one group that represents the actual reporting relationship found in the company's organizational chart. This is the main group that the user works in and contains the user’s supervisor. Users can belong to an unlimited number of groups or none at all. An external user cannot view or edit internal users or their organization's details- Access is controlled through the role and producer codes.",
      "notes": "Managing users\nAdministrators define users, assigning group membership, roles, credentials etc- Both the Team tab and theAdministration tab contain User Profile screens that\nallow administrators to define and edit these characteristics.\n\nUser information can be viewed and managed in the Administration tab- Users can use the left sidebar links to search or edit users, groups, organizations, regions, or producer codes. They can view, edit or create roles (discussed in detail in the Permisslons lesson). They can also define attributes that the system can use for making assignment decisions.\n\nWhen you create an external user, the fields and available values in the User sub-tabs change accordingly. External users must be associated with an Organization. The tree browser (as seen on the Administration tab) will always show the home organization of the user (either internal or external).\n\nTypically, the user belongs to at least one group that represents the actual reporting relationship found in the company's organizational chart. This is the main group that the user works in and contains the user’s supervisor. Users can belong to an unlimited number of groups or none at all. An external user cannot view or edit internal users or their organization's details- Access is controlled through the role and producer codes.",
      "narration": "User management is a critical administrative function in PolicyCenter. Administrators have the tools to define user roles, assign group memberships, and manage credentials. The Administration tab is your hub for these tasks, offering a comprehensive view of user information. External users have restricted access to internal details, ensuring security and maintaining organizational integrity. This management capability is crucial for aligning user roles with business processes efficiently.",
      "ocrText": "| Managing users\n\n* Search, view, edit or create the users using the Administration tab\n• Every user has details about\n\n* what a user owns for assignment purposes(user type, etc.)\n\n* what a user can access (roles, underwriting (UW) authority, region, etc.)\n* Create a new user\n\n+ Administration > Actions > New User\n\n« External users must explicitly specify to which organization they belong",
      "ocrWordCount": 66,
      "ocrConfidence": 90.11,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 9,
      "title": "User Access and Permissions",
      "bodyParagraphs": [],
      "originalNotes": "User Access\nGroups:\nThe Groups lists which groups the user belongs to, if the user is a member, whether the user is a Manager, load factor permissions and the load factor within that group. This is useful for activity assignments usingassignment rules. Click on a linked group name and open the Groups screen to configure the Groups. Groups are discussed in detail later in this lesson.\n\nProducer Codes from Groups.\nThe users automatically obtain all of the producer codes assigned to their groups. A user can create collections of permissions as roles and attach them to\nproducer codes, which can then be assigned to users,policies, or accounts. Users for whom Producer Code Security is set to Yes can only use their role\npermissions against policies that have a matching producer code- Only the producer code permissions that match can be used against a policy, even if the user has a larger set of permissions available through their user roles- Both producer code and user role permissions must match in order for the user to gain access.\n\nAdditional Producer Codes:\nUsers can add producer codes through this option. By default, external producer users can have producer codes from their own organization/groups added. Internal users who have their producer code security turned on can have producer codes from any organization added. However, you can configure the ExternallJserAccess parameter in config.xml to control the level of access for external users.",
      "notes": "User Access\nGroups:\nThe Groups lists which groups the user belongs to, if the user is a member, whether the user is a Manager, load factor permissions and the load factor within that group. This is useful for activity assignments usingassignment rules. Click on a linked group name and open the Groups screen to configure the Groups. Groups are discussed in detail later in this lesson.\n\nProducer Codes from Groups.\nThe users automatically obtain all of the producer codes assigned to their groups. A user can create collections of permissions as roles and attach them to\nproducer codes, which can then be assigned to users,policies, or accounts. Users for whom Producer Code Security is set to Yes can only use their role\npermissions against policies that have a matching producer code- Only the producer code permissions that match can be used against a policy, even if the user has a larger set of permissions available through their user roles- Both producer code and user role permissions must match in order for the user to gain access.\n\nAdditional Producer Codes:\nUsers can add producer codes through this option. By default, external producer users can have producer codes from their own organization/groups added. Internal users who have their producer code security turned on can have producer codes from any organization added. However, you can configure the ExternallJserAccess parameter in config.xml to control the level of access for external users.",
      "narration": "Access and permissions in PolicyCenter are finely tuned to ensure that users can perform their roles effectively. Group memberships dictate what users can access, including producer codes assigned to their groups. Permissions are dual-layered, relying on both user roles and matching producer codes. This ensures that access is appropriately gated, maintaining security while supporting operational needs. Configuring these permissions correctly is essential for seamless policy management.",
      "ocrText": "User Access\n\n• Turn on/off producer code security (Yes for user type Producer)\n\n• User inherits producer code from their group and can add additional producer\n\ncodes\nUser: Frede\n\nrick Dwight\n\nAttributes\n\nBasics\n\nAccess || Roles | Profile | Region | UWAuthority\n\n[peresiercose sco vs]\n\nGroup details = S™uPs\n\nGroup Member Manager Load Factor Permissions Load Factor\nProducers ‘Yes\nProducer codes Producer Codes from Groups\nCode Description Status Groups Actions\n\nTo add a producer code\nto this user\n\n301-008597 Cid Vicious agency Active\n\nAdditional Producer Codes\n\nCode Description Status > Actions",
      "ocrWordCount": 91,
      "ocrConfidence": 90.39,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 10,
      "title": "Group Management and Producer Codes",
      "bodyParagraphs": [],
      "originalNotes": "Managing groups\nUsers should have admin privileges to view the groups using Administration tab. This slide shows the producer codes in the group Eastern Mid-West Region. The producer codes tab shows all of the producer codes available to the parent group, which can be made available to the current group. All users in this group can use the producer codes available to the group. This is not implicit, a user must be granted access to producer codes and groups through the user's Access tab.",
      "notes": "Managing groups\nUsers should have admin privileges to view the groups using Administration tab. This slide shows the producer codes in the group Eastern Mid-West Region. The producer codes tab shows all of the producer codes available to the parent group, which can be made available to the current group. All users in this group can use the producer codes available to the group. This is not implicit, a user must be granted access to producer codes and groups through the user's Access tab.",
      "narration": "Managing groups involves understanding the assignment and accessibility of producer codes. In the Administration tab, administrators can view and modify group configurations. Producer codes are crucial as they dictate what policies a group can handle. By managing these codes effectively, you ensure that users have the necessary permissions to perform their roles efficiently, aligning with organizational objectives.",
      "ocrText": "| Managing groups fa\n• Search, view, edit and create groups using the Administration tab\n\n• Any user (internal or external) assigned to a group has access to all of the\nproducer codes available to that group\n\nProducer Codes tab lists all producer codes assigned to the group\n\nGroup: Eastern Mid-West Region\n\nBasics | Users Queues | Regions\n\nProducer codes can be selected here from those available to the parent group\n\nAvailable Code Description Status Branch\nQALPRODUCERCODEO1 Internal Producer Code-2 Active Los Angeles Branch UW\n\nStandard Code Internal Producer Code-1 Active Los Angeles Branch UW",
      "ocrWordCount": 95,
      "ocrConfidence": 90.25,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 11,
      "title": "Navigating Group Structures",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Images illustrate the setup and navigation of group structures within PolicyCenter, including regions and departments.",
      "narration": "Navigating group structures in PolicyCenter involves understanding how different regions and departments are organized. The visual layout helps you see the interconnections between groups, sub-groups, and the users within them. This clarity is essential for optimizing policy assignment and ensuring that tasks are routed to the appropriate teams, enhancing both efficiency and accountability in policy handling.",
      "ocrText": "| Demonstration G\n\nManaging users and groups\n\nclick here\n\nNote: The demonstration opens a new tab in your browser. When the demonstration ends, the\noriginal course launch window appears. Return to this window to continue this presentation.",
      "ocrWordCount": 37,
      "ocrConfidence": 95.41,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_instruction",
      "demoVideoIndex": 0
    },
    {
      "slideNumber": 12,
      "title": "User Management Tools",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Demonstration of user management tools available in PolicyCenter.",
      "narration": "Let's explore the user management tools that PolicyCenter offers. As you navigate the interface, notice how administrators can easily search, edit, and configure user profiles. These tools are designed to streamline the management of user roles and permissions, ensuring that each user is aligned with their designated tasks and organizational goals. Pay attention to how roles and group memberships are adjusted, reflecting the dynamic nature of modern insurance operations.",
      "ocrText": "",
      "ocrWordCount": 0,
      "ocrConfidence": 0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_video"
    },
    {
      "slideNumber": 13,
      "title": "Configuring User Access",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Visual examples of configuring user access and permissions within PolicyCenter.",
      "narration": "Configuring user access involves setting up permissions that align with both user roles and organizational needs. The visuals here demonstrate how access is modified and managed, highlighting key areas like producer codes and group memberships. Proper configuration ensures that users can access the resources they need without compromising security. This balance is crucial for maintaining efficient and secure operations within PolicyCenter.",
      "ocrText": "Andri\nSupervisor\n\n| want to view the activity and job details for the\nusers within my group and be able to reassign\nthem.",
      "ocrWordCount": 23,
      "ocrConfidence": 94.75,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 14,
      "title": "Team Management in PolicyCenter",
      "bodyParagraphs": [],
      "originalNotes": "Team tab\nSupervisors and managers can manage their teams, obtain status information, monitor caseloads, identify backlogs and reassign activities on the Team tab- In some respects, team management is a reporting tool, where a summary of agroup's workload can be seen You can then drill down to view and manage the workload of a specific team member- The reporting categories for workloads ar : Activities, Submissions, Renewals, and Other Policy Transactions.\n\nThe Team screens show the job workload for groups or individual users and can assist the supervisor determine if a user has work to do on a job depending upon the role of the user or whether an activity is assigned to the user- All the tabs display statistics for the current week in base configuration- Batch processes are run at scheduled time intervals based on configurations set in config.xml. The parameters that set the time window used to calculate user statistics are also set in config-xml. Configuration users can configure config.xml using Guidewire Studio.\n\nThe Misassigned category contains jobs and activities assigned to the group where the node appears, but was assigned to an invalid user. An invalid user is someone who is no longer a member of the group- Misassigned jobs or activities can appear when a user leaves the group or company and their activities/jobs must be reassigned- Activities and jobs can be mass reassigned. For example, an underwriter is leaving his company, all of his jobs can be reassigned to someone else with one command.",
      "notes": "Team tab\nSupervisors and managers can manage their teams, obtain status information, monitor caseloads, identify backlogs and reassign activities on the Team tab- In some respects, team management is a reporting tool, where a summary of agroup's workload can be seen You can then drill down to view and manage the workload of a specific team member- The reporting categories for workloads ar : Activities, Submissions, Renewals, and Other Policy Transactions.\n\nThe Team screens show the job workload for groups or individual users and can assist the supervisor determine if a user has work to do on a job depending upon the role of the user or whether an activity is assigned to the user- All the tabs display statistics for the current week in base configuration- Batch processes are run at scheduled time intervals based on configurations set in config.xml. The parameters that set the time window used to calculate user statistics are also set in config-xml. Configuration users can configure config.xml using Guidewire Studio.\n\nThe Misassigned category contains jobs and activities assigned to the group where the node appears, but was assigned to an invalid user. An invalid user is someone who is no longer a member of the group- Misassigned jobs or activities can appear when a user leaves the group or company and their activities/jobs must be reassigned- Activities and jobs can be mass reassigned. For example, an underwriter is leaving his company, all of his jobs can be reassigned to someone else with one command.",
      "narration": "The Team tab is a powerful feature for supervisors and managers, providing a comprehensive overview of workloads and team dynamics. Here, you can monitor caseloads, identify backlogs, and reassign tasks as needed. This functionality transforms team management into an insightful process, allowing leaders to optimize workload distribution and ensure that no team member is overwhelmed. It's a critical tool for maintaining operational efficiency and enhancing team performance.",
      "ocrText": "| Team tab i\n\n• Provides a visual management tool that helps supervisors and managers manage\ntheir groups\n\n* Each group can have only one supervisor\n\n« Users in the group can be set as managers\n• Reports all activities and jobs grouped by time and status\n* Can mass reassign the activities and jobs\n\n* Can view policy transactions by role or activity",
      "ocrWordCount": 64,
      "ocrConfidence": 88.19,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 15,
      "title": "Viewing Workloads by Categories",
      "bodyParagraphs": [],
      "originalNotes": "View by categories\nBy Role — Users work on jobs when they have a participating role. A CSR is an example of a role user, where the CSR ensures that a job progresses. The CSR may not have any activities associated with the job, so when the By Role button is clicked, the Team screen displays the jobs where the user is a participant.\nBy Activity — These users work on jobs when they are assigned to an activity on the job. An underwriter is an example of a by activity user. For example, one underwriter may be assigned to a large number of policies generated by a group of CSRs. The under writer may participate in thousands of jobs, butthey do not have to take action on each policy .Only when an activity is explicitly assigned to them, do they have to perform a task- Similarly, for personal lines which renew every six months, a third or more of the policies may have an active renewal in process at any time- Each renewalis assigned to anunder writer, even if the renewal is expected to complete automatically without intervention. These renewal jobs do not represent work for the underwriter unless a job",
      "notes": "View by categories\nBy Role — Users work on jobs when they have a participating role. A CSR is an example of a role user, where the CSR ensures that a job progresses. The CSR may not have any activities associated with the job, so when the By Role button is clicked, the Team screen displays the jobs where the user is a participant.\nBy Activity — These users work on jobs when they are assigned to an activity on the job. An underwriter is an example of a by activity user. For example, one underwriter may be assigned to a large number of policies generated by a group of CSRs. The under writer may participate in thousands of jobs, butthey do not have to take action on each policy .Only when an activity is explicitly assigned to them, do they have to perform a task- Similarly, for personal lines which renew every six months, a third or more of the policies may have an active renewal in process at any time- Each renewalis assigned to anunder writer, even if the renewal is expected to complete automatically without intervention. These renewal jobs do not represent work for the underwriter unless a job",
      "narration": "PolicyCenter allows for viewing workloads by categories, such as Role and Activity. This distinction is vital for understanding who is responsible for what within a policy workflow. Viewing by Role shows which jobs a user is participating in, while Activity focuses on tasks explicitly assigned to them. This dual perspective helps in accurately assessing workloads and ensuring that users are focused on their key responsibilities, thereby enhancing productivity and accountability.",
      "ocrText": "Gi\n\nView by categories\n\n* By Role — displays jobs where a user is a participant, such as CSR\n\n« May not have any activities associated with job\n* By Activity — displays jobs where a user has an activity, such as an underwriter\n\n« An activity makes the underwriter aware that work is required on job\n\nMy Groups: Summary (Calculated on: Mon, Sep 24,\n2018 11:03:00 AM PDT)\n\nView Policy Transactions | ByRole\ni\nBy Role Submissions Renewals Other Policy\n“ eek) (this week) (this week) (this week)\nName @ | Bi\\vi@/r H\\@e\\x ibiIR\\|B|@/Xx\\o\nEastern Region Underwriting 0 Oo 0 oO 0 oO oO o oO 0 0 0 0 0\n132 | 126 0 4 0 8 15 1 2 0 0 6 1 16\n\nLos Angeles Branch UW",
      "ocrWordCount": 131,
      "ocrConfidence": 79.82,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 16,
      "title": "Role-Based Work Management",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Images depict how roles influence task assignments and user responsibilities.",
      "narration": "Role-based management is central to how tasks are assigned in PolicyCenter. The images here illustrate how different roles influence the distribution of work. Understanding this relationship helps administrators ensure that each user is adequately equipped to handle their responsibilities, aligning tasks with both user capabilities and organizational needs, thus streamlining policy operations.",
      "ocrText": "| Reporting icons and their meanings fa\n\n• Hover over the icons to view their meanings on the team page\n* Common icon: Open > oO\n\nRenewed\n\nOverdue New New Non- New\n\nName @ix w\nEastern Region Underwriting 0 0 0 0 0 0 0 0 0 0 it) 0 (\\) 0\nLos Angeles Branch UW 132 | 126 0 4 0 8 15 1 2 0 0 6 1 16",
      "ocrWordCount": 71,
      "ocrConfidence": 87.56,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 17,
      "title": "Activity-Centric Workflows",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Visuals show how activities are assigned to users, highlighting the importance of specific task assignments.",
      "narration": "Activity-centric workflows highlight the importance of task-specific assignments in PolicyCenter. Visuals demonstrate how activities are allocated to users, ensuring that responsibility is clear and manageable. This focus on specific tasks ensures that nothing falls through the cracks, maintaining the integrity and efficiency of the policy management process. It's a key aspect of how PolicyCenter facilitates effective operational workflows.",
      "ocrText": "| Demonstration G\n\nTeam tab\n\nclick here\n\nNote: The demonstration opens a new tab in your browser. When the demonstration ends, the\noriginal course launch window appears. Return to this window to continue this presentation.",
      "ocrWordCount": 35,
      "ocrConfidence": 95.43,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_instruction",
      "demoVideoIndex": 1
    },
    {
      "slideNumber": 18,
      "title": "Monitoring and Adjusting Workloads",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Demonstration of how supervisors can monitor and adjust workloads based on current needs.",
      "narration": "Monitoring and adjusting workloads is a dynamic process in PolicyCenter. As a supervisor, you're equipped with tools to assess current workloads and make necessary adjustments. This ensures that resources are optimally utilized and that no team member is overburdened. The demonstration here highlights how you can leverage these tools to maintain balance and efficiency within your team, adapting swiftly to changing demands.",
      "ocrText": "",
      "ocrWordCount": 0,
      "ocrConfidence": 0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_video"
    },
    {
      "slideNumber": 19,
      "title": "Ensuring Workflow Efficiency",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Images illustrate strategies for maintaining efficient workflows within PolicyCenter.",
      "narration": "Ensuring workflow efficiency requires strategic planning and execution. The images here depict various strategies employed within PolicyCenter to streamline operations. By understanding and implementing these strategies, you can significantly enhance the speed and accuracy of policy processing, ensuring that your team is working at peak efficiency and that customer satisfaction remains high.",
      "ocrText": "Question\nAnswer true or false:\n_’ _ An internal user could be assigned a producer code for any organization.\n•\n•\nGi",
      "ocrWordCount": 28,
      "ocrConfidence": 75.4,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question",
      "questionData": {
        "question": "Answer true or false:\nAn internal user could be assigned a producer code for any organization.",
        "answer": "True"
      }
    },
    {
      "slideNumber": 20,
      "title": "Adapting to Organizational Changes",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Visuals show how PolicyCenter adapts to changes within an organization, such as restructuring or new policy regulations.",
      "narration": "Adapting to organizational changes is a critical capability of PolicyCenter. Whether it's restructuring or adapting to new policy regulations, the system is designed to accommodate these changes seamlessly. The visuals here illustrate how flexibility is built into the architecture, allowing you to adjust configurations swiftly to meet new business requirements without disrupting ongoing operations.",
      "ocrText": "Answer\nAnswer true or false:\n_,’  An internal user could be assigned a producer code for any organization.\n•\n•\nTrue\nSooo ooo ooo Oooo oOoD\nGi",
      "ocrWordCount": 28,
      "ocrConfidence": 79.44,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 21,
      "title": "Security and Compliance in User Management",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Images emphasize the importance of maintaining security and compliance through user management practices.",
      "narration": "Security and compliance are paramount in user management within PolicyCenter. The images highlight the practices and configurations that help maintain a secure and compliant environment. By adhering to these guidelines, you ensure that sensitive data is protected and that your organization remains compliant with industry standards, safeguarding both your operations and your reputation.",
      "ocrText": "Lesson\nobjectives • Describe and manage Users\nreview * Describe and manage Groups\n\n• Use the Team tab",
      "ocrWordCount": 18,
      "ocrConfidence": 87.22,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "objectives_review"
    },
    {
      "slideNumber": 22,
      "title": "Summary and Next Steps",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Recap the key points about users and groups, and introduce the next lesson on Organizations and Producer Codes.",
      "narration": "We've covered the essentials of managing users and groups in PolicyCenter, from role assignments to group configurations and access permissions. These components are vital for creating a structured and efficient workflow. As we move forward, our next lesson will delve into Organizations and Producer Codes, further expanding your understanding of how PolicyCenter supports complex insurance operations. Stay tuned as we continue to build on this foundation, enhancing your expertise in Guidewire systems.",
      "ocrText": "| Student exercise\n\nUsers and Groups",
      "ocrWordCount": 6,
      "ocrConfidence": 95.86,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "exercise"
    }
  ],
  "videos": [
    {
      "index": 1,
      "filename": "In_Policy_12_01.mp4",
      "path": "/academy/guidewire/videos/ch04/In_Policy_12_01.mp4"
    },
    {
      "index": 2,
      "filename": "In_Policy_12_02.mp4",
      "path": "/academy/guidewire/videos/ch04/In_Policy_12_02.mp4"
    }
  ],
  "hasNotes": true,
  "hasTables": false,
  "hasImages": true,
  "ocrMetadata": {
    "totalWords": 893,
    "avgConfidence": 87.23,
    "extractedAt": "2026-02-13T12:05:08.495979"
  }
}
