{
  "lessonId": "ch04-l14",
  "chapterId": 4,
  "chapterSlug": "ch04",
  "lessonNumber": 14,
  "title": "Introduction to Underwriting Authority",
  "sourceFile": "In_policy_15_Introduction to Underwriting Authority.pptx",
  "sourceFolder": "In_policy_14",
  "totalSlides": 22,
  "estimatedMinutes": 66,
  "slides": [
    {
      "slideNumber": 1,
      "title": "Welcome to Underwriting Authority",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Introduction to the concept of underwriting authority in PolicyCenter.",
      "narration": "Welcome to our exploration of underwriting authority within Guidewire PolicyCenter. In this session, we'll dive into how underwriting authority impacts the policy lifecycle, focusing on the interactions between agents and underwriters. It's crucial for ensuring policies meet a company's risk standards before they're issued or renewed. Let's set the stage for understanding these interactions and how they tie into the broader PolicyCenter data model.",
      "ocrText": "Introduction to Underwriting Authority",
      "ocrWordCount": 4,
      "ocrConfidence": 95.33,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "title"
    },
    {
      "slideNumber": 2,
      "title": "The Role of Underwriting",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Understanding how underwriting fits into the insurance process.",
      "narration": "Underwriting plays a pivotal role in the insurance process by assessing risk and determining policy terms. In PolicyCenter, this involves evaluating data such as applicant details and policy specifics to decide on coverage options. You'll often interact with entities like PolicyPeriod and related policy line items, which provide the necessary data for underwriting decisions. This sets the foundation for understanding how authority levels are assigned and managed.",
      "ocrText": "Lesson\nobjectives\n\n• Explain the concepts of Underwriting Authority\n* Describe Underwriting Issues",
      "ocrWordCount": 13,
      "ocrConfidence": 83.23,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "objectives"
    },
    {
      "slideNumber": 3,
      "title": "Underwriting Authority in PolicyCenter",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Overview of how underwriting authority is represented in the system.",
      "narration": "In PolicyCenter, underwriting authority is not just a concept; it's implemented as part of the system's configuration. This authority determines who can approve certain underwriting decisions and is often tied to roles and permissions defined within the application. As a developer, you'll configure these authorities to ensure that the right level of approval is required for different underwriting issues, reflecting your organization's risk management policies.",
      "ocrText": "Darren\nInsurance\nProduct Manager\n\nUnderwriting is a very important aspect of our\nbusiness. Most people in our industry need to\nunderstand the basics around underwriting authority\nin the application. How does it work?",
      "ocrWordCount": 33,
      "ocrConfidence": 95.71,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 4,
      "title": "Underwriting Process Flow",
      "bodyParagraphs": [],
      "originalNotes": "Underwriting process\nAn agent or a producer creates a policy using the submission transaction. If the policy has an issue that blocks quoting, the agent cannot view the quote until the undewriter approves the issue and releases the policy back to the agent. Once the underwriter approves the issue, then the agent can view the quote, then bind and issue the policy, or the agent can edit the policy which potentially raises new issues. The new issues will have to go through the underwriting process agaim",
      "notes": "Underwriting process\nAn agent or a producer creates a policy using the submission transaction. If the policy has an issue that blocks quoting, the agent cannot view the quote until the undewriter approves the issue and releases the policy back to the agent. Once the underwriter approves the issue, then the agent can view the quote, then bind and issue the policy, or the agent can edit the policy which potentially raises new issues. The new issues will have to go through the underwriting process agaim",
      "narration": "Let's walk through the underwriting process flow in PolicyCenter, starting with the creation of a policy using a submission transaction. If a policy issue arises that blocks quoting, the agent must wait for underwriter approval before proceeding. This ensures that any risk concerns are addressed early. Once approved, the agent can view the quote and decide to bind and issue the policy. However, any policy edits might introduce new issues, requiring another round of underwriting. This iterative process ensures compliance with underwriting standards.",
      "ocrText": "| Underwriting process fa\n\nAgent requests UW approves UW releases\nUW review @ issue(s) policy back to\nagent\n\n@\n(wa [eee and quotes\n—— ao”\n\nPolicy has Under UW Review Agent cannot Agent can view\nunderwriting issues edit policy or see quote, edit, bind\nAgent cannot edit the quote and issue policy\n\nAgent cannot policy\n\napprove",
      "ocrWordCount": 56,
      "ocrConfidence": 89.49,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 5,
      "title": "Configuring Underwriting Authority",
      "bodyParagraphs": [],
      "originalNotes": "Underwriting authority\nThe details on how to configure the undewriting authority will be covered in the Configuring Undenvriting Authority module in the Po/icyCenter Configuration Guide course.",
      "notes": "Underwriting authority\nThe details on how to configure the undewriting authority will be covered in the Configuring Undenvriting Authority module in the Po/icyCenter Configuration Guide course.",
      "narration": "Configuring underwriting authority in PolicyCenter is a critical task that aligns with your organization's risk management framework. While we'll delve deeper into this configuration in a dedicated module, it's important to understand that it involves setting roles, permissions, and approval levels. This configuration ensures that decisions are made by the right personnel with the appropriate oversight, maintaining the integrity of the underwriting process.",
      "ocrText": "| Underwriting authority Gi\n\n• Provides underwriting rules and an underwriting infrastructure to manage\nunderwriting issues\n\n• Major components\n« Underwriting Issue — A specific occurrence on a policy transaction where an underwriting\ncondition was true.\n\n« Underwriting Rule — Describes how the policy transaction is affected by underwriting issues\nand how issues can be approved. The rules include the conditions which will raise an\nunderwriting issue.\n\n• Authority Grant — The ability to approve underwriting issues and to what degree.\n\n• Authority Profile — A group of authorities that can be given to a user, allowing the user to\napprove underwriting issues.",
      "ocrWordCount": 103,
      "ocrConfidence": 91.41,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 6,
      "title": "Handling Underwriting Issues",
      "bodyParagraphs": [],
      "originalNotes": "Underwriting issues\nThere are certain issues that can be approved by agents, but certain issues need special approval from underwriters. Forexample, if the driver or applicant has a suspended/revoked license, then the agent cannot quote the policy and an underwriting issue is raised and sent to the underwriter for approval. However, if a driver is driving a vehicle garaged in CA but has a valid MA driver’s license, then the agents canverify the license and an underwriting issue will not be raised. PolicyCenter raises issues automatically based on policy choices such as vehicles types on a policy or coverage amounts.",
      "notes": "Underwriting issues\nThere are certain issues that can be approved by agents, but certain issues need special approval from underwriters. Forexample, if the driver or applicant has a suspended/revoked license, then the agent cannot quote the policy and an underwriting issue is raised and sent to the underwriter for approval. However, if a driver is driving a vehicle garaged in CA but has a valid MA driver’s license, then the agents canverify the license and an underwriting issue will not be raised. PolicyCenter raises issues automatically based on policy choices such as vehicles types on a policy or coverage amounts.",
      "narration": "Underwriting issues in PolicyCenter can vary in complexity. Some can be resolved by agents, while others require underwriter intervention. For example, a suspended license will trigger an issue needing underwriter approval, preventing the quote until resolved. PolicyCenter automates issue detection based on predefined rules, reacting to factors like vehicle types or coverage levels. This automation helps streamline operations while ensuring compliance with underwriting guidelines.",
      "ocrText": "Underwriting issues i\n\nyN\n©).\n\n* Created when a condition gives undesirable results\nbased on data on the policy or account such as:\n\n* a level of coverage or price of a coverable or\n* a jurisdiction or\n* more complex issue such as drivers in urban areas\n\n* Can stop jobs unless approved",
      "ocrWordCount": 54,
      "ocrConfidence": 84.85,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 7,
      "title": "Understanding Checking Sets",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Introduction to checking sets in underwriting rules.",
      "narration": "Checking sets are a key component of underwriting rules in PolicyCenter. They determine when the system should evaluate certain conditions. For example, a rule might specify a checking set at the pre-quote stage, triggering an evaluation of whether a policy meets specific criteria before a quote is generated. This proactive approach helps identify potential issues early, allowing for timely resolution and smoother policy processing.",
      "ocrText": "| Creating underwriting issues\n\n« Raised automatically based on policy choices\n\n« UWrules trigger UW issues\n+ Rule conditions can be created in the UW rule user interfaces\n\n+ More complex conditions can be written in Gosu code\n« Automatically removed when the condition is resolved\n* Can be added manually on the UW Issues screen\n\n* Manual issues are not removed automatically",
      "ocrWordCount": 63,
      "ocrConfidence": 88.73,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 8,
      "title": "The Role of Checking Sets",
      "bodyParagraphs": [],
      "originalNotes": "Checking set\nA checking set is one of the important fields in underwriting rules. It works together with the blocking point, which is discussed in detail on the next slide. For example, the underwriting rule for high-value vehicles has a checking set as pre-quote. When a quote is requested, it checks if this issue exists. Ifthe issueexists, it raises a high-value vehicle underwriting issue at quote time. The rule has a blocking point as a bind, so a premium is generated and displayed, however, it blocks binds and the issue must be resolved before binding the policy.",
      "notes": "Checking set\nA checking set is one of the important fields in underwriting rules. It works together with the blocking point, which is discussed in detail on the next slide. For example, the underwriting rule for high-value vehicles has a checking set as pre-quote. When a quote is requested, it checks if this issue exists. Ifthe issueexists, it raises a high-value vehicle underwriting issue at quote time. The rule has a blocking point as a bind, so a premium is generated and displayed, however, it blocks binds and the issue must be resolved before binding the policy.",
      "narration": "Checking sets and blocking points work hand-in-hand within underwriting rules in PolicyCenter. A checking set can be used to flag issues like high-value vehicles during the pre-quote stage. Even if issues are detected, the system can generate a quote, but the bind process is blocked until resolution. This mechanism ensures that policies are scrutinized appropriately before finalization, balancing operational efficiency with risk management.",
      "ocrText": "| Checking set\n\n•« Achecking set represents a point in a job where issues can be raised\n* pre-quote\n* bind\n* pre-issuance, etc.\n\n• Used to specify when to check if an issue exists",
      "ocrWordCount": 35,
      "ocrConfidence": 90.77,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 9,
      "title": "Understanding Blocking Points",
      "bodyParagraphs": [],
      "originalNotes": "Blocking point\nUsers define a blocking point for each underwriting rule. For example, PolicyCenter prevents a user from binding a policy until a high-value vehicle underwriting issue is approved.\n\nBlocking points can be set to non-blocking so that an issue does not stop the job, but shows up as an informational issue on the Risk Analysis page as shown in the slide. When the underwriting issue is informational, the agent can progress further in the job and quote, bind and issue the policy. Informational issues do not need underwriter approval.\n\nNote: Issues can be detected early, but then block at a much later point. For example, you can detect fire-breathing clowns before quoting a policy, but the issue will block binding.\nBy detecting issues early, you can provide added visibility to PolicyCenter users, and improve their ability to plan their work.\nDetect issues as early as possible and think carefullyabout where they will block progress.\nIf a field were only available on a quote screen (e.g. manual pricing adjustment factor), but its value blocked the quote, it would result in you not being able to return to the earlier screen to implement changes.",
      "notes": "Blocking point\nUsers define a blocking point for each underwriting rule. For example, PolicyCenter prevents a user from binding a policy until a high-value vehicle underwriting issue is approved.\n\nBlocking points can be set to non-blocking so that an issue does not stop the job, but shows up as an informational issue on the Risk Analysis page as shown in the slide. When the underwriting issue is informational, the agent can progress further in the job and quote, bind and issue the policy. Informational issues do not need underwriter approval.\n\nNote: Issues can be detected early, but then block at a much later point. For example, you can detect fire-breathing clowns before quoting a policy, but the issue will block binding.\nBy detecting issues early, you can provide added visibility to PolicyCenter users, and improve their ability to plan their work.\nDetect issues as early as possible and think carefullyabout where they will block progress.\nIf a field were only available on a quote screen (e.g. manual pricing adjustment factor), but its value blocked the quote, it would result in you not being able to return to the earlier screen to implement changes.",
      "narration": "Blocking points in underwriting rules dictate when a detected issue prevents further progress in a policy transaction. This could be at the quote or bind stage, depending on the rule configuration. Sometimes, issues are flagged as informational, allowing the process to continue while highlighting potential risks. As developers, understanding how and when to set blocking points is crucial, as it directly impacts policy workflow and user experience. Early detection of issues allows agents to plan and address these concerns proactively, ensuring smoother policy management.",
      "ocrText": "| Blocking point\n\n• Ablocking point stops progress of the job until an issue is approved\n\n@ @ Underwriter @\nQuote “s-» approves issues\n> >\nia —\nAgent creates UW issues blocking Policy can be quoted,\nsubmission quote, bind or issue bound and issued\n\n* Specific issue types can be configured as informational (non-blocking)\n\n* Agent can progress further in job\n\nInformational\n\nDiver under 25 2s\n\n* Do not need underwriter approval",
      "ocrWordCount": 73,
      "ocrConfidence": 86.56,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    },
    {
      "slideNumber": 10,
      "title": "Underwriting Authority: Practical Considerations",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Discuss practical considerations when implementing underwriting authority.",
      "narration": "When implementing underwriting authority in PolicyCenter, consider the practical aspects like role-based access and alignment with organizational policies. It's vital to ensure that authority levels match the complexity and risk associated with different policy types. This not only ensures compliance but also empowers agents to make decisions within their scope, streamlining the approval process and enhancing operational efficiency.",
      "ocrText": "| Demonstration G\n\nUnderwriting authority overview\n\nclick here\n\nNote: The demonstration opens a new tab in your browser. When the demonstration ends, the\noriginal course launch window appears. Return to this window to continue this presentation.",
      "ocrWordCount": 36,
      "ocrConfidence": 95.39,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_instruction",
      "demoVideoIndex": 0
    },
    {
      "slideNumber": 11,
      "title": "Demonstration: Viewing Underwriting Authority",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "A practical demonstration of accessing underwriting authority settings.",
      "narration": "Let's take a moment to explore how underwriting authority is viewed within PolicyCenter. As you navigate the system, focus on the user interface elements that display authority levels and permissions. Notice how these settings align with the roles defined in your organization, providing a structured approach to managing underwriting approvals. This demonstration will highlight the user experience aspect of underwriting authority management.",
      "ocrText": "",
      "ocrWordCount": 0,
      "ocrConfidence": 0,
      "hasTable": false,
      "hasChart": false,
      "hasImage": false,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "demo_video"
    },
    {
      "slideNumber": 12,
      "title": "Configuring Underwriting Rules",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Overview of configuring underwriting rules in PolicyCenter.",
      "narration": "Configuring underwriting rules in PolicyCenter is where your understanding of the data model becomes crucial. These rules are defined based on policy attributes and risk factors, using entities like PolicyLine and Coverage. The configuration involves setting conditions and actions that guide the system's decision-making process, ensuring that policies adhere to underwriting guidelines while automating routine checks.",
      "ocrText": "Question\nWhen is an undermnriting issue raised?\n•\n•",
      "ocrWordCount": 18,
      "ocrConfidence": 62.87,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question",
      "questionData": {
        "question": "When is an undermnriting issue raised?",
        "answer": "Underwriting issues are raised when policy choices meet the conditions defined in the underwriting rules or Gosu code. In certain situations, underwriters can add issues manually depending on their permissions. Sooo ooo ooo Oooo oOoD"
      }
    },
    {
      "slideNumber": 13,
      "title": "Demonstration: Configuring Underwriting Rules",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "A practical demonstration of configuring underwriting rules.",
      "narration": "In this demonstration, observe the process of configuring underwriting rules within PolicyCenter. Pay attention to how conditions are set based on policy data and how actions are defined to trigger specific outcomes. This hands-on view will help you understand the intricacies of rule configuration and its impact on the underwriting workflow, making it easier to implement these rules in real-world scenarios.",
      "ocrText": "Answer a\nWhen is an undermnriting issue raised?\n•\n•\n•\nUnderwriting issues are raised when policy choices meet the conditions defined in the\nunderwriting rules or Gosu code. In certain situations, underwriters can add issues\nmanually depending on their permissions.\nSooo ooo ooo Oooo oOoD",
      "ocrWordCount": 48,
      "ocrConfidence": 86.04,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 14,
      "title": "Data Model Considerations",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Exploring the data model entities related to underwriting authority.",
      "narration": "Understanding the data model is critical when dealing with underwriting authority in PolicyCenter. Key entities include PolicyPeriod, UnderwritingIssue, and UserRole, each playing a distinct part in defining and managing authority levels. Familiarity with these entities allows you to effectively configure and customize the system to meet specific business needs, ensuring that data integrity and process efficiency are maintained.",
      "ocrText": "Question\nWhere are the underwriting issues displayed?\n•\n•",
      "ocrWordCount": 18,
      "ocrConfidence": 63.87,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question",
      "questionData": {
        "question": "Where are the underwriting issues displayed?",
        "answer": "Underwriting issues are displayed on the Risk Analysis page under the tab - UW Issues. Sooo ooo ooo Oooo oOoD"
      }
    },
    {
      "slideNumber": 15,
      "title": "Integration Points for Underwriting Authority",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Identifying integration points within PolicyCenter for underwriting authority.",
      "narration": "Underwriting authority doesn't exist in isolation; it often requires integration with other systems and modules within Guidewire. Consider how data flows between PolicyCenter and external systems like claims or billing, ensuring that underwriting decisions are informed by the latest data. Identifying these integration points is crucial for maintaining consistency and accuracy across the insurance suite, enhancing the overall decision-making process.",
      "ocrText": "Answer\nWhere are the underwriting issues displayed?\n•\n•\n•\nUnderwriting issues are displayed on the Risk Analysis page under the tab - UW\nIssues.\nSooo ooo ooo Oooo oOoD",
      "ocrWordCount": 32,
      "ocrConfidence": 81.76,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 16,
      "title": "Customizing Underwriting Workflows",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Discussing customization options for underwriting workflows in PolicyCenter.",
      "narration": "Customizing underwriting workflows in PolicyCenter allows you to tailor the system to meet specific business requirements. Whether it's adjusting approval thresholds or modifying notification settings, these customizations ensure that the underwriting process aligns with your company's operational goals. Leveraging Gosu scripts and PCF configurations, you can enhance the system's flexibility and responsiveness, providing a competitive edge in policy management.",
      "ocrText": "Question\nWhat decides when an underwriting issues is raised, checking set or\nblocking point?\nGi",
      "ocrWordCount": 24,
      "ocrConfidence": 78.81,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question",
      "questionData": {
        "question": "What decides when an underwriting issues is raised, checking set or",
        "answer": "X blocking point? Checking set decides at which point an underwriting issue should be raised. For example, whether an issue should be raised at pre-quote, bind or issue. Sooo ooo ooo Oooo oOoD"
      }
    },
    {
      "slideNumber": 17,
      "title": "Best Practices for Managing Underwriting Authority",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Highlight best practices in managing underwriting authority in PolicyCenter.",
      "narration": "Managing underwriting authority effectively requires adhering to best practices. This includes regularly reviewing and updating authority levels, ensuring alignment with current business policies, and facilitating continuous training for underwriters and agents. By maintaining clear documentation and utilizing PolicyCenter's built-in tools, you can ensure that the authority management process remains transparent, efficient, and adaptable to changing market conditions.",
      "ocrText": "Answer\nWhat decides when an undermiting issues is raised, checking set or\nblocking point?\nChecking set decides at which point an underwriting issue should be raised. For\nexample, whether an issue should be raised at pre-quote, bind or issue.\nSooo ooo ooo Oooo oOoD\nGi",
      "ocrWordCount": 48,
      "ocrConfidence": 88.11,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 18,
      "title": "Common Challenges and Solutions",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Address common challenges in implementing underwriting authority and their solutions.",
      "narration": "Implementing underwriting authority can present challenges such as managing complex approval hierarchies and ensuring data accuracy. Solutions involve leveraging PolicyCenter's rule engine to automate decision-making and employing robust data validation techniques. By anticipating these challenges and planning accordingly, you can streamline the authority management process and minimize disruptions to policy operations.",
      "ocrText": "Question G\nWho can approve or reject underwriting issues? How is this decided?\n•\n•",
      "ocrWordCount": 24,
      "ocrConfidence": 74.57,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question",
      "questionData": {
        "question": "Who can approve or reject underwriting issues? How is this decided?",
        "answer": "Auser, normally an underwriter or an agent, can approve or reject underwriting issues depending on their authority grants. Sooo ooo ooo Oooo oOoD"
      }
    },
    {
      "slideNumber": 19,
      "title": "Case Study: A Real-World Implementation",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Review a case study of implementing underwriting authority in a real-world scenario.",
      "narration": "Let's explore a case study where underwriting authority was implemented in a real-world setting. This example illustrates how a company successfully aligned its underwriting processes with PolicyCenter's capabilities, addressing challenges such as complex risk assessments and multi-tier approvals. By examining their approach, you can gain insights into effective strategies for deploying underwriting authority in your organization.",
      "ocrText": "Answer a\nWho can approve or reject underwriting issues? How is this decided?\n•\n•\n•\nAuser, normally an underwriter or an agent, can approve or reject underwriting issues\ndepending on their authority grants.\nSooo ooo ooo Oooo oOoD",
      "ocrWordCount": 41,
      "ocrConfidence": 85.42,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 20,
      "title": "Demonstration: Reviewing Underwriting Authority in Action",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "A practical demonstration of underwriting authority in action within PolicyCenter.",
      "narration": "In this demonstration, observe underwriting authority in action within PolicyCenter. Focus on how the system enforces authority rules during a policy transaction, ensuring that all necessary approvals are obtained before proceeding. This practical view will help you see the direct impact of authority configurations on the policy lifecycle, reinforcing the concepts we've discussed.",
      "ocrText": "Question\nAnswer true or false:\no A. An approved UW issue cannot be reopened?\nB. An agent can reject an UW issue?",
      "ocrWordCount": 31,
      "ocrConfidence": 73.88,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "question",
      "questionData": {
        "question": "Answer true or false:",
        "answer": "O A. An approved UW issue cannot be reopened? B. An agent can reject an UW issue? Correct answers: A. False B. True Sooo ooo ooo Oooo oOoD"
      }
    },
    {
      "slideNumber": 21,
      "title": "Questions and Interactive Discussion",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Encourage questions and interactive discussion on underwriting authority.",
      "narration": "Now that we've covered the fundamentals of underwriting authority, let's open the floor for questions and interactive discussion. Share your thoughts on the challenges and opportunities you've encountered in implementing these concepts. This is a great opportunity to learn from each other's experiences and deepen your understanding of how underwriting authority functions within PolicyCenter.",
      "ocrText": "Answer\nAnswer true or false:\n•\no A. An approved UW issue cannot be reopened?\nB. An agent can reject an UW issue?\nCorrect answers:\nA. False\nB. True\nSooo ooo ooo Oooo oOoD",
      "ocrWordCount": 36,
      "ocrConfidence": 80.93,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "answer"
    },
    {
      "slideNumber": 22,
      "title": "Conclusion and Next Steps",
      "bodyParagraphs": [],
      "originalNotes": "",
      "notes": "Summarize key takeaways and introduce the next lesson on managing underwriting authority.",
      "narration": "As we wrap up, let's recap the key takeaways from our session on underwriting authority. We've explored how it's configured, the role of checking sets and blocking points, and practical considerations for implementation. In our next lesson, we'll delve into managing underwriting authority, focusing on ongoing maintenance and optimization strategies. Thanks for joining, and I look forward to continuing our journey into PolicyCenter's capabilities.",
      "ocrText": "Lesson\nobj ectives * Explain the concepts of Underwriting Authority\nreview • Describe Underwriting Issues",
      "ocrWordCount": 15,
      "ocrConfidence": 86.07,
      "hasTable": false,
      "hasChart": false,
      "hasImage": true,
      "tableData": null,
      "mediaReferences": [],
      "slideType": "content"
    }
  ],
  "videos": [
    {
      "index": 1,
      "filename": "In_Policy_15_01.mp4",
      "path": "/academy/guidewire/videos/ch04/In_Policy_15_01.mp4"
    }
  ],
  "hasNotes": true,
  "hasTables": false,
  "hasImages": true,
  "ocrMetadata": {
    "totalWords": 805,
    "avgConfidence": 83.99,
    "extractedAt": "2026-02-13T12:05:51.947169"
  }
}
